#1 - İmportlar:
import pygame
import pgzrun
from pgzero.actor import Actor
import time
import random
pygame.mixer.init()
#2 - Malzemeler:
#2.1 - Karakter:
dex = Actor("dex",(170,80))
dex1 = Actor("dex",(405,380))
dex2 = Actor("dex",(250,35))
dex3 = Actor("dex",(240,240))
#2.2 - Oyun:
#2.2.1 - Görseller:
#2.2.1.1 - Menü:
buton = Actor("buton",(240,240))
b0 = Actor("boşluk")
b01 = Actor("boşbuton",(120,120))
b02 = Actor("boşbuton",(120,360))
b03 = Actor("boşbuton",(360,120))
b04 = Actor("boşbuton",(360,360))
exit = Actor("exit",(470,9))
tkalp = Actor("tkalp")
#2.2.1.2 - Başlangıç:
zemin1 = Actor("zemin")
haliorta = Actor("halıorta")
halisağ = Actor("halısağ")
halisol = Actor("halısol")
halialt = Actor("halıalt")
haliüst = Actor("halıüst")
haliort = Actor("halıortayan")
kapialt = Actor("kapıalt")
kapiüst = Actor("kapıüst")
kitaplik = Actor("kitaplık")
kitaplikalt = Actor("kitaplıkalt")
piyanosag = Actor("piyanosağ")
piyanosol = Actor("piyanosol")
yatak = Actor("yatak")
duvar1 = Actor("duvar")
menü = Actor("plan")
#2.2.1.3 - 1.Kısım:
alt1 = Actor("alt1")
alt2 = Actor("alt2")
duvar1 = Actor("duvar1")
gecis = Actor("giriş")
sağ1 = Actor("sağ1")
sağ2 = Actor("sağ2")
sağüst1 = Actor("sağüst1")
sağalt1 = Actor("sağalt1")
sol1 = Actor("sol1")
sol2 = Actor("sol2")
solalt1 = Actor("solalt1")
solüst1 = Actor("solüst1")
üst1 = Actor("üst1")
üst2 = Actor("üst2")
zemin11 = Actor("zemin11")
zemin12 = Actor("zemin12")
zemin13 = Actor("zemin13")
kitaplikalt1 = Actor("kitaplıkalt1")
piyanosag1 = Actor("piyanosağ1")
piyanosol1 = Actor("piyanosol1")
yatak2 = Actor("yatak2")
#2.2.1.4 - Koridor1:
tabela1 = Actor("tabela1")
hali1alt = Actor("halı1alt")
hali1üst = Actor("halı1üst")
hali1ort = Actor("halı1ortayan")
hali1sağ = Actor("halı1sağ")
hali1sol = Actor("halı1sol")
hali1orta = Actor("hali1orta")
hali1tuzak = Actor("halı1tuzak")
hali1tuzaksol = Actor("halı1tuzaksol")
hali1tuzaksağ = Actor("halı1tuzaksağ")
zemin11tuzak = Actor("zemin11tuzak")
zemin12tuzak = Actor("zemin12tuzak")
zemin13tuzak = Actor("zemin13tuzak")
sağ1tuzak = Actor("sağ1tuzak")
sol1tuzak = Actor("sol1tuzak")
#2.2.1.999.1.1 - Level 1:
level1duvar = Actor("level1duvar")
level1zemin = Actor("level1zemin")
level1button = Actor("level1button")
dusman1 = Actor("düşman1")
dusman1.hp = 5
dusman1.hit = 1
#2.2.1.999.1.2 - Level 1(lose):
öldün = Actor("öldün",(240,240))
#2.2.1.999.1.3 - Level 1(win):
yasadin = Actor("yaşadın",(240,240))
#2.2.2 - Ses:
no1 = pygame.mixer.Sound('eeggg.mp3')
a1 = pygame.mixer.Sound("a1.mp3")
no3 = pygame.mixer.Sound("eeggg2.mp3")
#3 - Pencere:
eg = 30
ey = 30
WIDTH = b0.width * eg
HEIGHT = b0.height * ey
TITLE = "Kötü çocukluk"
FPS = 165
#4 - Değişkenler ve listeler:
bilgiler = []
oda = "menü"
düşman1Liste = []
d1p = [(230, 200),(250, 200),(200, 230),(280, 230),(200,250),(280,250),(230,280),(250,280)]
dex3i = {
     "hp": 10,
    "hit": 3,
    "xp": 0,      
    "level": 1,         
    "nlevel": 100
}
eskiy = dex3.y
eskix = dex3.x
rünler = []
#5 - Haritalar:
#5.1 - Başlangıç:
mab1 = [[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,1,11,11,1,1,1,2,1,1,1,11,11,1,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,1,11,11,1,1,1,3,1,1,1,11,11,1,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,4,10,10,4,5,6,6,6,7,4,10,10,4,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,4,4,4,4,5,6,6,6,7,4,4,4,4,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,4,4,4,4,5,6,6,6,7,4,4,4,46,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,4,4,4,4,5,6,6,6,7,4,4,4,46,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,4,4,4,4,5,6,6,6,7,4,4,4,46,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,4,4,4,4,5,6,6,6,7,4,4,4,46,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,4,4,4,4,5,6,6,6,7,4,4,4,46,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,4,4,4,4,5,6,6,6,7,4,4,4,46,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,4,4,4,4,5,6,6,6,7,4,4,4,46,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,4,4,4,4,5,6,6,6,7,4,4,4,4,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,4,4,4,4,5,6,6,6,7,4,4,4,4,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,4,4,4,4,5,6,6,6,7,4,4,4,4,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,4,4,4,4,5,6,6,6,7,4,4,4,4,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,4,4,4,4,4,4,4,4,4,4,4,4,4,1,1,1,1,1,1,1,1,1,1,1,1,1],
        [0,1,1,1,4,4,4,4,4,4,4,4,4,4,4,4,4,1,1,1,1,1,1,1,1,1,1,1,1,1],
        [0,1,1,1,4,4,4,4,4,4,4,4,4,4,4,4,4,1,1,1,1,1,1,8,9,1,1,1,1,1],
        [0,1,1,1,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,1,1,1],
        [0,1,1,1,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,1,1,1],
        [0,1,1,1,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,1,1,1],
        [0,1,1,1,4,4,4,4,4,4,4,4,4,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,4,4,4,1,1,1],
        [0,1,1,1,4,4,4,4,4,4,4,4,4,-2,-2,-2,-2,-2,-2,-2,-2,-2,-2,-2,4,4,-4,1,1,1],
        [0,1,1,1,4,4,4,4,4,4,4,4,4,-3,-3,-3,-3,-3,-3,-3,-3,-3,-3,-3,4,4,4,1,1,1],
        [0,1,1,1,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,1,1,1],
        [0,1,1,1,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,1,1,1],
        [0,1,1,1,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,1,1,1],
        [0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
        [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]]
#5.2 - 1.Kısım:
mab2 = [[0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,1,3,3,1,1,1,2,1,1,1,3,3,1,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,1,3,3,1,1,1,4,1,1,1,3,3,1,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,5,7,7,6,16,14,14,14,15,6,7,7,9,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,-1,10,11,12,16,14,14,14,15,10,10,11,13,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,-1,12,11,10,16,14,14,14,15,11,10,10,17,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,-2,12,11,11,16,14,14,14,15,12,10,10,17,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,-1,11,12,11,16,14,14,14,15,11,12,12,13,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,-1,12,11,12,16,14,14,14,15,11,12,11,13,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,-2,12,11,12,16,14,14,14,15,10,11,10,13,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,-1,11,10,10,16,14,14,14,15,11,12,11,17,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,-1,10,11,10,16,14,14,14,15,11,12,11,17,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,-2,11,10,12,16,14,14,14,15,11,12,11,13,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,-1,12,10,11,16,14,14,14,15,11,12,10,13,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,-2,12,11,11,16,14,14,14,15,11,11,10,13,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,-2,11,11,10,16,14,14,14,15,10,11,12,17,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,-1,11,12,11,16,14,14,14,15,10,10,11,17,1,1,1,0,0,0,0,0,0,0,0,0,0],
        [0,1,1,1,-2,11,12,10,11,10,12,11,10,10,11,11,17,1,1,1,1,1,1,1,1,1,1,1,1,1],
        [0,1,1,1,-1,11,12,10,11,11,12,10,10,11,11,10,13,1,1,1,1,1,1,1,1,1,1,1,1,1],
        [0,1,1,1,-1,11,10,10,10,11,12,12,10,11,10,11,13,1,1,1,1,1,1,-8,-9,1,1,1,1,1],
        [0,1,1,1,-2,10,10,11,12,11,10,11,12,11,10,11,12,6,6,8,6,6,8,8,8,8,9,1,1,1],
        [0,1,1,1,-2,10,11,10,12,11,10,10,11,10,11,10,12,12,11,10,11,10,11,10,12,11,13,1,1,1],
        [0,1,1,1,-1,11,10,11,12,10,10,10,11,10,11,12,10,11,11,10,11,10,11,10,11,12,17,1,1,1],
        [0,1,1,1,-1,11,10,11,12,11,10,10,12,-3,-3,-3,-3,-3,-3,-3,-3,-3,-3,-3,-3,10,13,1,1,1],
        [0,1,1,1,-2,11,10,12,11,10,11,10,11,-4,-4,-4,-4,-4,-4,-4,-4,-4,-4,-4,-4,-6,13,1,1,1],
        [0,1,1,1,-2,11,10,11,12,11,10,10,11,-5,-5,-5,-5,-5,-5,-5,-5,-5,-5,-5,-5,10,13,1,1,1],
        [0,1,1,1,-2,11,10,10,10,11,12,12,11,10,10,10,11,12,11,11,11,10,12,11,12,10,17,1,1,1],
        [0,1,1,1,-1,11,10,11,12,11,10,10,11,12,11,10,10,10,10,10,11,10,10,10,11,12,13,1,1,1],
        [0,1,1,1,-7,20,20,20,31,31,21,20,20,20,21,21,21,21,21,21,21,21,20,20,20,21,22,1,1,1],
        [0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1]]
#5.3 - Koridor(1):
mab3 = [[0,0,0,4,1,2,3,1,2,3,1,1,1,2,8,8,2,3,2,1,2,2,3,2,1,2,5,0,0,0],
        [0,0,0,6,2,1,2,3,2,3,2,1,2,3,9,9,3,2,1,2,3,2,1,2,3,2,5,0,0,0],
        [0,0,0,6,2,3,2,1,2,3,12,11,11,11,11,11,11,11,11,13,1,2,3,2,1,2,7,0,0,0],
        [0,0,0,4,2,2,1,3,1,2,12,11,11,11,11,11,11,11,11,13,1,2,3,1,2,3,7,0,0,0],
        [0,0,0,4,2,3,2,1,2,3,12,11,11,11,11,11,11,11,11,13,2,3,2,1,2,3,7,0,0,0],
        [0,0,0,4,2,1,2,3,2,1,12,11,11,11,11,11,11,11,11,13,2,1,2,3,2,3,5,0,0,0],
        [0,0,0,6,2,3,1,3,2,1,12,11,11,11,11,11,11,11,11,13,1,3,1,3,2,2,5,0,0,0],
        [0,0,0,6,2,3,1,3,2,2,12,11,11,11,11,11,11,11,11,13,1,3,2,3,2,1,5,0,0,0],
        [0,0,0,6,2,1,2,3,1,2,12,11,11,11,11,11,11,11,11,13,1,3,2,3,2,1,7,0,0,0],
        [0,0,0,4,3,1,2,3,1,3,12,11,11,11,11,11,11,11,11,13,1,3,1,2,3,1,5,0,0,0],
        [0,0,0,6,2,3,1,2,3,1,12,11,11,11,11,11,11,11,11,13,1,2,3,1,1,2,7,0,0,0],
        [0,0,0,4,3,2,3,1,2,3,12,11,11,11,11,11,11,11,11,13,3,2,1,3,2,3,7,0,0,0],
        [0,0,0,4,3,1,2,3,3,3,12,11,11,11,11,11,11,11,11,13,2,3,1,3,2,1,5,0,0,0],
        [0,0,0,4,3,2,1,2,2,3,12,11,11,11,11,11,11,11,11,13,2,2,3,1,1,3,5,0,0,0],
        [0,0,0,96,92,101,92,92,93,101,90,89,89,89,89,89,89,89,89,91,92,101,93,14,101,92,95,0,0,0],
        [0,0,0,96,92,93,101,93,92,101,90,89,89,89,89,89,89,89,89,91,92,93,92,101,92,93,95,0,0,0],
        [0,0,0,4,2,1,3,1,3,2,12,11,11,11,11,11,11,11,11,13,2,1,2,3,2,1,7,0,0,0],
        [0,0,0,6,3,2,1,3,2,3,12,11,11,11,11,11,11,11,11,13,1,3,2,3,2,3,7,0,0,0],
        [0,0,0,6,3,2,3,2,1,2,12,11,11,11,11,11,11,11,11,13,1,3,2,1,2,3,7,0,0,0],
        [0,0,0,6,2,3,1,3,2,3,12,11,11,11,11,11,11,11,11,13,1,2,1,1,1,3,5,0,0,0],
        [0,0,0,6,3,1,1,2,3,1,12,11,11,11,11,11,11,11,11,13,1,2,3,2,2,2,7,0,0,0],
        [0,0,0,4,3,3,3,2,1,2,12,11,11,11,11,11,11,11,11,13,1,2,3,3,2,1,5,0,0,0],
        [0,0,0,4,2,3,2,1,3,2,12,11,11,11,11,11,11,11,11,13,2,3,2,1,2,2,7,0,0,0],
        [0,0,0,6,2,3,1,1,2,3,12,11,11,11,11,11,11,11,11,13,3,2,3,1,2,3,5,0,0,0],
        [0,0,0,6,3,2,3,3,1,2,12,11,11,11,11,11,11,11,11,13,3,3,3,3,2,1,7,0,0,0],
        [0,0,0,4,2,1,3,1,2,3,12,11,11,11,11,11,11,11,11,13,3,1,1,1,1,2,7,0,0,0],
        [0,0,0,4,2,2,2,2,2,2,12,11,11,11,11,11,11,11,11,13,2,3,3,1,1,1,7,0,0,0],
        [0,0,0,4,2,1,3,3,2,1,12,11,11,11,11,11,11,11,11,13,3,2,1,2,2,2,5,0,0,0],
        [0,0,0,4,2,1,3,1,3,1,12,11,11,11,11,11,11,11,11,13,3,2,2,2,1,1,5,0,0,0],
        [0,0,0,4,1,2,3,3,3,1,12,11,11,11,1000,1000,11,11,11,13,2,3,1,2,3,1,7,0,0,0]]
mab4 = [[0,0,0,4,1,2,3,1,2,3,1,1,1,2,8,8,2,3,2,1,2,2,3,2,1,2,5,0,0,0],
        [0,0,0,6,2,1,2,3,2,3,2,1,2,3,9,9,3,2,1,2,3,2,1,2,3,2,5,0,0,0],
        [0,0,0,6,2,3,2,1,2,3,12,11,11,11,11,11,11,11,11,13,1,2,3,2,1,2,7,0,0,0],
        [0,0,0,4,2,1,2,1,2,2,12,11,11,11,11,11,11,11,11,13,1,1,1,2,3,1,5,0,0,0],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        [],
        []]
#5.?.1 - Level 1:
mab901 = [[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,1,2,2,2,2,2,2,2,2,1,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,1,2,2,2,2,2,2,2,2,1,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,1,2,2,2,2,2,2,2,2,1,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,1,2,2,2,3,3,2,2,2,1,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,1,2,2,2,3,3,2,2,2,1,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,1,2,2,2,2,2,2,2,2,1,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,1,2,2,2,2,2,2,2,2,1,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,1,2,2,2,2,2,2,2,2,1,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
          [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]]
#5.?.? - Geçiş:
mab999 = [
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]
]
#6 - Harita çizdirme fonksiyonları:
def mab1cizim():
    for i in range(len(mab1)):
        for j in range(len(mab1[i])):
            if mab1[i][j] == 0:
                b0.left = b0.width*j
                b0.top = b0.height*i
                b0.draw()
            elif mab1[i][j] == -4:
                yatak.left = b0.width*j
                yatak.top = b0.height*i
                yatak.draw()
            elif mab1[i][j] == -3:
                halialt.left = b0.width*j
                halialt.top = b0.height*i
                halialt.draw()
            elif mab1[i][j] == -2:
                haliort.left = b0.width*j
                haliort.top = b0.height*i
                haliort.draw()
            elif mab1[i][j] == -1:
                haliüst.left = b0.width*j
                haliüst.top = b0.height*i
                haliüst.draw()
            elif mab1[i][j] == 1:
                duvar1.left = b0.width*j
                duvar1.top = b0.height*i
                duvar1.draw()
            elif mab1[i][j] == 2:
                kapiüst.left = b0.width*j
                kapiüst.top = b0.height*i
                kapiüst.draw()
            elif mab1[i][j] == 3:
                kapialt.left = b0.width*j
                kapialt.top = b0.height*i
                kapialt.draw()
            elif mab1[i][j] == 4:
                zemin1.left = b0.width*j
                zemin1.top = b0.height*i
                zemin1.draw()
            elif mab1[i][j] == 5:
                halisol.left = b0.width*j
                halisol.top = b0.height*i
                halisol.draw()
            elif mab1[i][j] == 6:
                haliorta.left = b0.width*j
                haliorta.top = b0.height*i
                haliorta.draw()
            elif mab1[i][j] == 7:
                halisağ.left = b0.width*j
                halisağ.top = b0.height*i
                halisağ.draw()
            elif mab1[i][j] == 8:
                piyanosol.left = b0.width*j
                piyanosol.top = b0.height*i
                piyanosol.draw()
            elif mab1[i][j] == 9:
                piyanosag.left = b0.width*j
                piyanosag.top = b0.height*i
                piyanosag.draw()
            elif mab1[i][j] == 10:
                kitaplikalt.left = b0.width*j
                kitaplikalt.top = b0.height*i
                kitaplikalt.draw()
            elif mab1[i][j] == 11:
                kitaplik.left = b0.width*j
                kitaplik.top = b0.height*i
                kitaplik.draw()
def mab2cizim():
    for i in range(len(mab2)):
        for j in range(len(mab2[i])):
            if mab2[i][j] == 0:
                b0.left = b0.width*j
                b0.top = b0.height*i
                b0.draw()
            elif mab2[i][j] == 1:
                duvar1.left = b0.width*j
                duvar1.top = b0.height*i
                duvar1.draw()
            elif mab2[i][j] == 2:
                kapiüst.left = b0.width*j
                kapiüst.top = b0.height*i
                kapiüst.draw()
            elif mab2[i][j] == 3:
                kitaplik.left = b0.width*j
                kitaplik.top = b0.height*i
                kitaplik.draw()
            elif mab2[i][j] == 4:
                kapialt.left = b0.width*j
                kapialt.top = b0.height*i
                kapialt.draw()
            elif mab2[i][j] == 5:
                solüst1.left = b0.width*j
                solüst1.top = b0.height*i
                solüst1.draw()
            elif mab2[i][j] == 6:
                üst1.left = b0.width*j
                üst1.top = b0.height*i
                üst1.draw()
            elif mab2[i][j] == 7:
                kitaplikalt1.left = b0.width*j
                kitaplikalt1.top = b0.height*i
                kitaplikalt1.draw()
            elif mab2[i][j] == 8:
                üst2.left = b0.width*j
                üst2.top = b0.height*i
                üst2.draw()
            elif mab2[i][j] == 9:
                sağüst1.left = b0.width*j
                sağüst1.top = b0.height*i
                sağüst1.draw()
            elif mab2[i][j] == 10:
                zemin11.left = b0.width*j
                zemin11.top = b0.height*i
                zemin11.draw()
            elif mab2[i][j] == 11:
                zemin12.left = b0.width*j
                zemin12.top = b0.height*i
                zemin12.draw()
            elif mab2[i][j] == 12:
                zemin13.left = b0.width*j
                zemin13.top = b0.height*i
                zemin13.draw()
            elif mab2[i][j] == 13:
                sağ1.left = b0.width*j
                sağ1.top = b0.height*i
                sağ1.draw()
            elif mab2[i][j] == 14:
                haliorta.left = b0.width*j
                haliorta.top = b0.height*i
                haliorta.draw()
            elif mab2[i][j] == 15:
                halisağ.left = b0.width*j
                halisağ.top = b0.height*i
                halisağ.draw()
            elif mab2[i][j] == 16:
                halisol.left = b0.width*j
                halisol.top = b0.height*i
                halisol.draw()
            elif mab2[i][j] == 17:
                sağ2.left = b0.width*j
                sağ2.top = b0.height*i
                sağ2.draw()
            elif mab2[i][j] == 20:
                alt1.left = b0.width*j
                alt1.top = b0.height*i
                alt1.draw()
            elif mab2[i][j] == 21:
                alt2.left = b0.width*j
                alt2.top = b0.height*i
                alt2.draw()
            elif mab2[i][j] == 22:
                sağalt1.left = b0.width*j
                sağalt1.top = b0.height*i
                sağalt1.draw()
            elif mab2[i][j] == 31:
                gecis.left = b0.width*j
                gecis.top = b0.height*i
                gecis.draw()
            elif mab2[i][j] == -1:
                sol1.left = b0.width*j
                sol1.top = b0.height*i
                sol1.draw()
            elif mab2[i][j] == -2:
                sol2.left = b0.width*j
                sol2.top = b0.height*i
                sol2.draw()
            elif mab2[i][j] == -3:
                haliüst.left = b0.width*j
                haliüst.top = b0.height*i
                haliüst.draw()
            elif mab2[i][j] == -4:
                haliort.left = b0.width*j
                haliort.top = b0.height*i
                haliort.draw()
            elif mab2[i][j] == -5:
                halialt.left = b0.width*j
                halialt.top = b0.height*i
                halialt.draw()
            elif mab2[i][j] == -6:
                yatak2.left = b0.width*j
                yatak2.top = b0.height*i
                yatak2.draw()
            elif mab2[i][j] == -7:
                solalt1.left = b0.width*j
                solalt1.top = b0.height*i
                solalt1.draw()
            elif mab2[i][j] == -8:
                piyanosol1.left = b0.width*j
                piyanosol1.top = b0.height*i
                piyanosol1.draw()
            elif mab2[i][j] == -9:
                piyanosag1.left = b0.width*j
                piyanosag1.top = b0.height*i
                piyanosag1.draw()
def mab3cizim():
    for i in range(len(mab3)):
        for j in range(len(mab3[0])):
            if mab3[i][j] == 0:
                b0.left = b0.width*j
                b0.top = b0.height*i
                b0.draw()
            elif mab3[i][j] == 1:
                zemin11.left = b0.width*j
                zemin11.top = b0.height*i
                zemin11.draw()
            elif mab3[i][j] == 2:
                zemin12.left = b0.width*j
                zemin12.top = b0.height*i
                zemin12.draw()
            elif mab3[i][j] == 3:
                zemin13.left = b0.width*j
                zemin13.top = b0.height*i
                zemin13.draw()
            elif mab3[i][j] == 4:
                sol1.left = b0.width*j
                sol1.top = b0.height*i
                sol1.draw()
            elif mab3[i][j] == 5:
                sağ1.left = b0.width*j
                sağ1.top = b0.height*i
                sağ1.draw()
            elif mab3[i][j] == 6:
                sol2.left = b0.width*j
                sol2.top = b0.height*i
                sol2.draw()
            elif mab3[i][j] == 7:
                sağ2.left = b0.width*j
                sağ2.top = b0.height*i
                sağ2.draw()
            elif mab3[i][j] == 8:
                kapiüst.left = b0.width*j
                kapiüst.top = b0.height*i
                kapiüst.draw()
            elif mab3[i][j] == 9:
                kapialt.left = b0.width*j
                kapialt.top = b0.height*i
                kapialt.draw()
            elif mab3[i][j] == 11:
                hali1orta.left = b0.width*j
                hali1orta.top = b0.height*i
                hali1orta.draw()
            elif mab3[i][j] == 12:
                hali1sol.left = b0.width*j
                hali1sol.top = b0.height*i
                hali1sol.draw()
            elif mab3[i][j] == 13:
                hali1sağ.left = b0.width*j
                hali1sağ.top = b0.height*i
                hali1sağ.draw()
            elif mab3[i][j] == 14:
                tabela1.left = b0.width*j
                tabela1.top = b0.height*i
                tabela1.draw()
            elif mab3[i][j] == 89:
                hali1tuzak.left = b0.width*j
                hali1tuzak.top = b0.height*i
                hali1tuzak.draw()
            elif mab3[i][j] == 90:
                hali1tuzaksol.left = b0.width*j
                hali1tuzaksol.top = b0.height*i
                hali1tuzaksol.draw()
            elif mab3[i][j] == 91:
                hali1tuzaksağ.left = b0.width*j
                hali1tuzaksağ.top = b0.height*i
                hali1tuzaksağ.draw()
            elif mab3[i][j] == 92:
                zemin12tuzak.left = b0.width*j
                zemin12tuzak.top = b0.height*i
                zemin12tuzak.draw()
            elif mab3[i][j] == 93:
                zemin13tuzak.left = b0.width*j
                zemin13tuzak.top = b0.height*i
                zemin13tuzak.draw()
            elif mab3[i][j] == 95:
                sağ1tuzak.left = b0.width*j
                sağ1tuzak.top = b0.height*i
                sağ1tuzak.draw()
            elif mab3[i][j] == 96:
                sol1tuzak.left = b0.width*j
                sol1tuzak.top = b0.height*i
                sol1tuzak.draw()
            elif mab3[i][j] == 101:
                zemin11tuzak.left = b0.width*j
                zemin11tuzak.top = b0.height*i
                zemin11tuzak.draw()
            elif mab3[i][j] == 1000:
                gecis.left = b0.width*j
                gecis.top = b0.height*i
                gecis.draw()
def mab4cizim():
    for i in range(len(mab4)):
        for j in range(len(mab4[0])):
            if mab4[i][j] == 0:
                b0.left = b0.width*j
                b0.top = b0.height*i
                b0.draw()
            elif mab4[i][j] == 1:
                zemin11.left = b0.width*j
                zemin11.top = b0.height*i
                zemin11.draw()
            elif mab4[i][j] == 2:
                zemin12.left = b0.width*j
                zemin12.top = b0.height*i
                zemin12.draw()
            elif mab4[i][j] == 3:
                zemin13.left = b0.width*j
                zemin13.top = b0.height*i
                zemin13.draw()
            elif mab4[i][j] == 4:
                sol1.left = b0.width*j
                sol1.top = b0.height*i
                sol1.draw()
            elif mab4[i][j] == 5:
                sağ1.left = b0.width*j
                sağ1.top = b0.height*i
                sağ1.draw()
            elif mab4[i][j] == 6:
                sol2.left = b0.width*j
                sol2.top = b0.height*i
                sol2.draw()
            elif mab4[i][j] == 7:
                sağ2.left = b0.width*j
                sağ2.top = b0.height*i
                sağ2.draw()
            elif mab4[i][j] == 8:
                kapiüst.left = b0.width*j
                kapiüst.top = b0.height*i
                kapiüst.draw()
            elif mab4[i][j] == 9:
                kapialt.left = b0.width*j
                kapialt.top = b0.height*i
                kapialt.draw()
            elif mab4[i][j] == 1:
                zemin11.left = b0.width*j
                zemin11.top = b0.height*i
                zemin11.draw()
            elif mab4[i][j] == 11:
                hali1orta.left = b0.width*j
                hali1orta.top = b0.height*i
                hali1orta.draw()
            elif mab4[i][j] == 12:
                hali1sol.left = b0.width*j
                hali1sol.top = b0.height*i
                hali1sol.draw()
            elif mab4[i][j] == 13:
                hali1sağ.left = b0.width*j
                hali1sağ.top = b0.height*i
                hali1sağ.draw()
def mab901cizim():
    for i in range(len(mab901)):
        for j in range(len(mab901[0])):
            if mab901[i][j] == 0:
                b0.left = b0.width*j
                b0.top = b0.height*i
                b0.draw()
            elif mab901[i][j] == 1:
                level1duvar.left = b0.width*j
                level1duvar.top = b0.height*i
                level1duvar.draw()
            elif mab901[i][j] == 2:
                level1zemin.left = b0.width*j
                level1zemin.top = b0.height*i
                level1zemin.draw()
            elif mab901[i][j] == 3:
                level1button.left = b0.width*j
                level1button.top = b0.height*i
                level1button.draw()

def mab999cizim():
    for i in range(len(mab999)):
        for j in range(len(mab999[i])):
            if mab999[i][j] == 0:
                b0.left = b0.width*j
                b0.top = b0.height*i
                b0.draw()
#7 - Diğer işlemler:

def d1pBF():
    for i in range(8):
        dusman = Actor("düşman1",d1p[i])
        dusman.hp = 5
        dusman.hit = 1
        düşman1Liste.append(dusman)
d1pBF()  
def no2():
    if oda == "başlangıç":
        if dex.colliderect(piyanosol):
            no1.play()
        else:
            no1.stop()
        if dex.colliderect(piyanosag):
             no1.play()
        else:
            no1.stop()
    elif oda == "1.kısım":
        if dex1.colliderect(piyanosol1):
            no3.play()
        else:
            no3.stop()
        if dex1.colliderect(piyanosag1):
            no3.play()
        else:
            no3.stop()
def a():
    if oda == "level1lose:(":
        a1.play()
#8 - Draw():
def draw():
    if oda == "menü":
        menü.draw()
        b01.draw()
        b02.draw()
        b03.draw()
        b04.draw()
        tkalp.draw()
        screen.draw.text("Kötü çocukluk",color=(255 ,215 ,0),center=(130,30),fontsize=50)
        screen.draw.text("Başla",color=(34 ,139, 34),center=(120,120),fontsize=30)
        screen.draw.text("Credit",color="red",center=(120,360),fontsize=30)
        screen.draw.text("Rünler",color="purple",center=(360,360),fontsize=30)
        screen.draw.text("Düşmanlar",color=(0,0,128),center=(360,120),fontsize=30)
    elif oda == "başlangıç":
        mab1cizim()
        dex.draw()
        if dex.colliderect(kapialt):
            screen.draw.text("Şimdi gidemezsin",color="Cyan",center=(400,180),fontsize=24)
    elif oda == "credit":
        menü.draw()
        exit.draw()
        tkalp.draw()
        screen.draw.text("1.:Gnossienne No.1",color="red",center=(130,30),fontsize=24)

    elif oda == "hikaye":
        menü.draw()
        exit.draw()
        tkalp.draw()
        y = 20
        for key, value in hikaye.items():
            screen.draw.text(f"{key}: {value[0]}", color="magenta", topleft=(-15, y), fontsize=22)
            y += 30
    elif oda == "1.kısım":
        mab2cizim()
        dex1.draw()
    elif oda == "geçişdönemi1":
        mab999cizim()
        screen.draw.text("Başlangıç",color="cyan",center=(240,30),fontsize=50)
        screen.draw.text("Son uyku",color="cyan",center=(240,60),fontsize=35)
        screen.draw.text("0-1 Korkunç rüyalar",color="cyan",center=(240,90),fontsize=30)
        screen.draw.text("Uyanmak için ENTER'a basın",color="blue",center=(400,470),fontsize=15)
    elif oda == "koridor1":
        mab3cizim()
        dex2.draw()
    elif oda == "level1":
        mab901cizim()
        dex3.draw()
        for i in range(len(düşman1Liste)):
            düşman1Liste[i].draw()
    elif oda == "gecisdönemi2":
        mab999cizim()
        screen.draw.text("Act 1",color=(72,61,139),center=(240,20),fontsize=50)
        screen.draw.text("Uğultulu Evren",color=(132, 112, 255),center=(240,50),fontsize=35)
        screen.draw.text("1-1: Yankıların yolu",color=(65 ,105 ,225),center=(240,80),fontsize=30)
        screen.draw.text("Devam etmek için ENTER'a bas",color="red",center=(400,470),fontsize=15)
    elif oda == "level1lose1":
        mab999cizim()
        öldün.draw()
        screen.draw.text("Umudunu yitirme",color="white",center=(240,260),fontsize=20)
        screen.draw.text("Devam etmek için ENTER'a bas",color="red",center=(400,470),fontsize=15)
    elif oda == "level1lose2":
        mab999cizim()
        öldün.draw()
        screen.draw.text("İyi olucaksın",color="white",center=(240,260),fontsize=20)
        screen.draw.text("Devam etmek için ENTER'a bas",color="red",center=(400,470),fontsize=15)
    elif oda == "level1lose3":
        mab999cizim()
        öldün.draw()
        screen.draw.text("Bu savaşın asıl galibi sen olucaksın",color="white",center=(240,260),fontsize=20)
        screen.draw.text("Devam etmek için ENTER'a bas",color="red",center=(400,470),fontsize=15)
    elif oda == "level1lose4":
        mab999cizim()
        öldün.draw()
        screen.draw.text("Kendine gel ve tekrar dene",color="white",center=(240,260),fontsize=20)
        screen.draw.text("Devam etmek için ENTER'a bas",color="red",center=(400,470),fontsize=15)
    elif oda == "level1lose:(":
        mab999cizim()
        öldün.draw()
        mm1 = random.randint(1,9)
        if mm1 == 1:
            screen.draw.text("ļ̸̨̨̡̡̨̧̢̧̧̢̨̡̧̧̢̛̠̱̱̲̜̲̱͈̺̠͇͎̬̪̳̥̹͎̙̠͔̰͖͎̰̦̭̻̯͖̮͕͇̻͚̟͖̥͖̠͎̹̼̟̜͖̫̳̙͎͔̹̩̜̗̘̰͉̥͔̭̹͎̭̜̲̯̲̮̰͉̪͍̹̲͓̯͚̪̙͔̩̜̮͇̳̰̹̫̺̠̣̝̣̙̯͍͎̻̲͔̦͕̮̦̳͉͈̳̜̞̮̟͇͇̭͎͉̖͇̦̙͔̗͔̘͚͔̮͙̣͈̖̻͇̦͇̪̘̱̮̤͇͔̱͍͈̲͖̫̠̪̟͍̬̞̘͉̩͕̗̣̣̠̯̻̱͔̥̤̗͍̭̼͇͔͓̥̤̠͇̹͕͇̦͈̻̬̯̜̼̠̫͎̪͙͈̗͔̥̪̪̘̠͓̦̙̰͓̙̼̜͖͍͇͉̙̰͖͙̰̠̘̫̳̖̲͚̟̮̦̱̹͓̩̝̹̰̹̺̻̼̺̝͙͓̦̫͖̖̼̩̠̺̬͆́̿̾̏̔̀̌̓̓̇̿͑̽̀̅́̔̋̍̆̈́̉̒̎̅͛̔̿̿̃͆̄͊̃̾̄̎̆̅̐̿́̿͛̽̽̈́̽͋̾͑̂͐̔͐́̓̉͐̍̆̄̄̔̉̏̒̉̄̐͛̑̉̾̀͑̋̽̈͐̔̏͐̏͌̏̐́̿̈́̓̅̋͘̕̕̚̕̚̕͘͜͜͜͜͝͝͝͝͠ͅͅͅͅͅͅͅͅͅͅͅư̸̢̢̡̨̧̧̨̧̧̢̢̢̢̨̱͚͉͚̦͉͙̪̝̥͍̩̠̞̝̼̯͙̮̮̱̣̭̭̱̣̟͙͕͚̝̫͓̯͉̳̬͔͎͉͈̯͍̥͓̭̩̦̞̞̩̮̦͕̻̭̝̝̙̺͙̜̫̖̲̮̳̻͙̪̟̗͈̲̯͙͚͇̭͉̭͍̱̫̯͇̠̺̦̙̪̣̥̞͉̱͖͖̯̩͕͍̰̝̦̳̥̮̞̹͓̮̟̠̹̪̘͙̦̰͓͔̞̳̳̮̫̮̪͔̩̫̯̤͇̱͇͔̳̖̮̖̤̩̪̯̜̬̭̲̰̹͚̣͇̤̱̥̣̬̤̖̼̖̰̱̪̳̱̲͍͚͕̤̟̺̠͙̟̟̝̲͙̲̱̱̰̱̜̩̰̮̗͇͙̥͖̘͖̱̜̝̪͚̺͈̬̪̖̫͍͕͖̼͚̈̓͋͑̉͐͐̀̈́̉̅͑̃͗̈͛̈́͒͊͛̔̾͒͗̑͌̒͐͐̔̂̒͊̾̃́̒̀̀̈́̽̄̆͗́͊̾͛̉́́͆̐̓͊͌̊͌̍̌̈́̉͒̊̊̿̀͂͐̾̒̇̔͑̿͑̀̓͊̾͛̊̊̊̈͘̕̚͜͜͜͜͜͝͝͝͝͠ͅͅt̸̢̢̧̡̧̡̨̧̡̢̢̧̧̢̧̛̛̛̛̛̛̰̫͔̮̞̭͉̝̙͈̻̭̖̭͇̙̼̝̞̝͉̣̳̟͙̰̯̰̙̼̪̥̗̖̳͚̹͈̥̣̥̜͚̤̯͉̮̥̙͉̯̲͖̪̦̞͈͎̱̦̪̺̱̝̝͓̫̗͚̯̥̻̺͖̫̞̪͍̤̼̟͚̯̤̰͍̠̖̰̬͇̞͚̲̜̝͍͕͈̫͕̥͍͍̞͖͚̘̙̦̲͍̠̖͎̙͇͕͇̤͇̱̼̗̟̣̠͉̘̙̜͇̼̪̙̭͚͇͎̯̙̮̙̬̬̹̩͓̘͈̖̻̪̫͇̬͉̬͙̰̣̩͕͙͙̜̬̩̩͕͔̖̠̗̗̦͙̣͉̥͕̗̮̺͓̫̳̩̙̆̄̍́͊̽͐͑͆̊̔̒̓̔͗̑̑̽͒̏̈͊̈͌̈̑̎̽̓͒̆̔͊̈́̃̆͒̿̿͑̌͐̄͊͂͐͆̈́̎̀̄͌̓͐̽͒̈̔͐̈̌̊͂̍̌͊̓̆̽̆̽̆́̀̅̉̿̍̀̓͐̾͂͌̌͐͑͂̿͂̓͆͐̋̋́̈́̏̽̇̉̓̏̀̾̌̑̾̆̄͛̓̂͆͛͊̒̌̈́̾̀̈́̽̿̈̋͆́̏̉̿̑͌͌̓̒́̍̉̓͂̈́͑̈́́͂̉̊͆̒̈͛̌͋̅̑͆̈́́̎͐͌̌̏̔̉͌̉̚̕̕̚̕͘̕̚̚͘̕͘͘̕͘̚͜͜͜͜͜͝͝͠͠͠͠͝͝͝͝ͅͅͅͅf̷̡̨̧̨̨̨̛̛̯̝͍͉̰̙̦̤̥̱̩͕̮̤̼̹͓̰͓̟̞͉̪̲̠͓̹͎͇̟͓̘̖̻̬͍̣̥̦̦̫̻̬͉̪̤̣̻̖̠̯͖̪͚͇͆̾̀̓͑̊͗͊̍͐̎̄̍́̃͋̽͌͂͂́͛͛͊̐̉̉́̌́̑͂̎́̓͒̒̀̽̇̽͐̈́̅̅̈́̓͂͂̍̅͆̑̊̏̓̅̾̾̋̉̒́͗̈͗̾͒̓̌̉͑̉̂̉̿̂̈͒̿̏̀͗̈́̓͑̀̑̓̐̈́̐̍̔͌̈́̈́̈́͂͂̋͒͗̆͛̇̈̍̓̿̑̀̊̈́͛̓̇̀́̂̐͑́͂͐̑̐́͐͐̓̓̆͒́̔͌̈́̊͗̈́̐͋̂͐̑͗̃͆̀͗͆̅̈̂̌̅̍̀́̈́̕͘̚͘̕̕͘͘̚͘͜͜͜͜͝͝͝͝͠͠͠͝͠͝ͅͅͅȩ̵̢̧̧̢̡̨̢̨̨̡̨̡̡̧̧̢̨̧̢̢̛̛̛̛̗͓̮͕̞̰̳̜̫̱̯̯̩̪̼͓̻̠̥̳̻͉̱̻̯̖̳̪̝̜̗̹̪͈̞͈̠͔͔͇̟̳̦̘͍̝̩̥͍̜͔̯̝͔̞̺̩̮̯̥̗̱̖̻̺̯̻͖̖͇̭͕̘̰̭͓̝̣̠̩̞̻͍̜͈̰͈̬̦̤̪̟̘͍̫̝̝͍͖͇̯̣̲͇̖̟̖̮̲͔̮̟̳̪̲͈͔̝͚͙͓̥̻͉͓̥̪̜͉̠̭̫̭̭̗̣̗̞̥̩̳̼̹͉͇̳͔̥̖͍͎̰̺̜̻̺̤͍̠̪̱̳͛̌̓̐̉̒̇̓́̒̅̐̓͐̐̂̌̆͊̅̆͑̈́̏̓̂̈́̈́̆̐̓͛̎̀̆́̈́͊͌̈́̈͒̈́̏̓̽́̎̾͋̆̏̃̽͒̌͋̊͒̋͗̅̓̓͌̋̋͋͗̍̀͗̊̐̈́̑̓̒̀̓͂̆̽̽͑͛̌̈́̀͛͛͗̈̑́̌͋̅͊̑̈́̉̉̑͗̾̃̎̏͑̃͊͂͒͋̊̊̓̀͊͌̈́̃͒̍̈̈̀͂͊̋̾͛͐̐́̈́̅͐̈́̌͋̌̀͗́͒̓̌͑͒̎́̂͐̏̏̾̂̅̄̈̂̈́̐͑̅̄͋̌̆̃̊̊̓͂̒̉̽̓́́͗̀͒̅̀́͌̅̆̅̔̅̕̕̚̕͘̕͘̚̕̚̕̚͘̕͜͜͜͠͝͝͠͝͠͝͝͝͝͠͝͝͝͝ͅͅͅͅn̶̨̧̧̨̢̡̡̨̧̨̧̡̡̨̡̡̛̛̛͇͖̫̰͖̝̠̠̠̠̦͇̺̘̻̥̱̥̗̲̣̙̱̮̣̳͍̯̺̳̥̰̟̼̠̥̹̞͈̗͔͇̹̣͔̹̥͍̗̗̤̟͇̬͖͎͖͉̪̹̜̮̗͕̹̝̤̬̖̰̖̼̳̞̺͇͍̖̘͚̙͎̮̲͖̱̣̥̪̰̟̦̼̜̟̥͚̗̬̞̰͔͔͈͙̯̭̟͕̗̈́̓̌̈́̅̽͐̽̏͌̐̅̈́̆̔̀́͛̉̎̋͊̌͗́̃̓̊͒̀̒̅̀̑̋̎̆̒̐̅̓̒͒̈́̎͑͆͗͒͑͋̈̓̉̄̓͌̀̃̔̎̀̆͑̒̀̑͋͘͘͘̚̕͘͜͜͝͝͝ ̶̢̡̨̧̧̧̡̨̨̡̛̛̛̩͖̳̞̯̮̭͚̞̯͓͇͖̲͕̰̥͓̜̰̰͍̦͍͖̮̗̯͚̦̰̹̦̬̰̞̩͈͈̠̺̼̯̯̰͙̫̠̪͚̬̜̦͚̩̟̤̯̤̦͙̗̬̲̭̪̝̩̣͙͓͔̰͓͎̤̻͙͉̳̩̫̬̟͉͈̥͖͍͍͕̖̻͔̼̰͔̊̌̽̔̍̿͐̉̅̃̋̔͒̀͂͒̆̅̋͐̾̈́̿͆̍̅̇͊̔́͊̀͊̒̆̅͒̔̍͊̊̒̇̒̌́̽̇͆͗͌͗̉͂͛̿̈́̃̽͆̆̂̂͋̓͆͗̉͊̈́̆͋͊̃̒̔̔̾͆̒̈́̐̒̐̉͆̊́̀̽͋̅͆̀̑͗̀̈́͋̎̔̾͒̎̎͋̆̇̄͗͋̿̅̔́͒̈́̃̄̔̊̑͒̄̓̂̾̉͒̈́̃̓̚͘̕̕̕̕͘͘̕͠͝͝͝͠͝͠͝͠ͅͅͅͅd̶̨̢̡̡̢̛̛̳̬̖̫͕̘̟͉̣̣͔̰͙̟͈̘̲̻̫̞͙̮͇̣̭̖̭̱̯̼̰̼̫̥̦͔̟͕͙͉̘̪̺̤̠̍͋̐́̉̃̇̑̈́̈́͐̔̄̂̂̅̀̆͌̆̐̌̅͊͒͐̆̈́̆̆̈́̈͂̊̀̓̓͌͊̌͒͛̈́͊̔̏̽̅̎͌͆̀͗̂̇̎̃̈́̓̆͐̽̀̿̾̇͋͋̓̅́͌̍̌́͂͊͊̈́̅̓͑̅̃͗́͗͗̑̋̿̏̄̋̒̆̔͘̚̕̕͘͘͘͘̚͜͜͜͜͠͝͝͝͠͝ͅư̶̧̧̨̧̨̨̢̢̤̬̼͇̞̝̠̯̻͓̺̤͔͚̱̣͎̘̖̙̣̩̬͔̻̦̭͍̥̩͉̠̱̻͍͕̖͙͖͍̩̯̦̲̭͍̱̠̗͍̠̪͔̬͓̥̩̬̬͔͉̘̹͔̼̩̮͖͇̳̭̳͍̭͔̞͐̆̐̃̽̂́͐͐̑̔̈́͑̾́̊͂̽̾͆̍̇̌̆̿͗́͑̂͜͜͝ͅͅr̷̢̧̡̢̨̨̡̢̨̡̨̧̨̨̨̡̧̧̨̢̡̧̡̧̡̧̨̨̛̛̛̻̯̞͍̗̝̹̳̤̱͓̪̠̖̦̲̩͎̣̼̹̩̭̯̻̘͔͙̦͔̥̱̟̫̺̱͔̜̮͎͍͕̘͉̦̟̭̗̤͕͓̙̱̬̞̦̼̭̯̫̺̖̖̙̰̩͖̰̗̱̻̱̜̞͙͓̞̫̳̙͓͙͖̱̗̗͙͙͍̲̟̹̟̩̲̼̙͙͙͕͖̼̫̹̲̯͉͇͖̯̯̖̩̤̦̯̹͈̗̙̥͍̼̭̝̩̫͙̠̝̹̬͔̬͍͈̳̱̗̹̳̯͓̤͓̯̗̖̩̯̣̠̙̙̖͎̳͖͙̼̪͕͔̙̜͉̠͖͍̞͈͎̪̞̹̞̭͉͔̞̲̣̼͓̹̟̥̝̹̮͈̰̭̼͚͇̟̮̱̜̼̝̪͔͚͕̬͚̼͇̩̮̯͙̣̠̦̠͔̗͓̻̩͖̫̞̳͇̭̦̮͇̫͚̱̤̭͖͈̱̫͎̖̰̜͎͈̻͚̙͍͓̖͚̤͕̫͕̺͚̄͌͂̄͊̄̿͋͒͛͌̍́͒̎̋̏̍̔̓̃͛̆͋́̃̑͗̎̍̍͐̽̈̅́̈̈͆̈́̑̈́̍͗͒̈͛̎́́̇̂͛̈̄͆̒̏̓͂̓͐́͛̐̅̀̅̑̀̑̃̄̀̆̀̈́̌̃̽̓̃̈́̀̾̈͒͗̂͂̿̈̀̇̌̈́̉͋͌͌̊̓̀̈́̉̏̈́̍͆́̊̃͗̓̈́̌͗̔̄́̈́̾̌̔̉̊̎̇͗̌̅̅͒̍͛̈́̾̀̉̆͑̂̌̀̏͆̐̉̎͑͐͆̒̄̅͌̃͒̂́̐͗̉̑̄̀̓̈̋̒̐̀̂͗̆̃̐̊̀͂͗̈́̀̎̈́͐̊̃͌̆̉̾̈́̾̓̆̄̋͌̃̀̈́̀̓̊̌͒͌̍͒͗̎̍̊̓̅͒̊͆̒͂̊̅͌͌͑̂̈́̇́̎̌͆̇̅̔̾̃̆̓̋̃̓̔͊̇͑̓̀͑͘̚͘̚̚̚̕̚̚̕͘͘̕̕͘͘̚̚̕̚̕̚͘̕̚͜͜͜͜͜͜͠͝͝͝͠͠͝͝͝͝ͅͅͅ",color="purple",center=(240,220),fontsize=20)
        elif mm1 == 2:
            screen.draw.text("ş̶̢̧̨̢̢̧̧̨̧̢̨̧̡̡̧̛̛̛̛̠̺͈̹̝͙̳̠͖̞̪̥̬̫͖̣͖͈̮̲̪̙̟̬̯̯̻͎͍͚̺̹̟̠͇̱̦̟͍̞̳̘̦̘̠̮̙̩͓̪̝̘̹̦͚̖̟̘̤̺̬͔̯͖̙̫͔̤̥͓̥̯̱͈̩͚͕͙͎̫̭̗̖̜͙̦̝̱̮̰͔͇̱̼͔̫̝͖̬̬̻͖̬̺̤̱̱̥̬͚̦̯̗̝̮̥̦̹̩̘̩͔̪̰̪̥̠̭̠̲̞̳̦̫̪͈̼̩̳͕̬̤̗͉͖̼͎̌͆̈͂̍͑͊̉̑̈́́̈́̌̅̆̀̒̓͗̄́̍͐̃̔͒́̉̒́̊͆͐̊̈́̿́̀̆̓̌̈́̏̆̓̈́̒̎͋̑͆̋̔̈͗͐͊͂́̂̂́͆͌̎̃̈́̓̍̄̐̆͐̏͐̒̀̍͌̀̅̑̐̿̄̆̉͗̅̄̈̇̀̈́̍̌͊̈́͆̉̿̐̐͂̌̀͌̀͋̏̒̾̋̌̂̈́̍̆̂̊̋̀̍̈̿͒̊̾̓̾͂̔̓̿͆͛́̊̅͑̆̄̑̒̏͒̓̏̀̀̏͊̾̀͊̊̀͒̇̒͘͘̚͘͘̚͘̚̚̕͘̕̚͜͜͜͜͜͜͜͜͜͜͜͜͝͠͝͝͠͝͝͠͝͠͝͝ͅͅͅͅͅe̵̡̧̡̨̧̧̡̢̢̡̢̨̨̧̢̧̡̧̨̢̡̢̧̧̧̢̡̢̧̧̢̡̡̡̢̢̛̛̛̛̼̟̝̙̪̙̝͍̹̠̟̺̣̹̰͉̬̼̹͙̮̹̤̼͍͉̠͎̮̮̲̫̲̩̠̮͚̝̣̦̻̲͎͔͉͚̥͚̱̺̬̺̼̻̟̪͕̪̜̤͍̰̮͈͖̺̮͖̙͙͉͙̪̲̜͓͕̼̣̠̤̜̪͓̘͔̮̫͙̮̬͓̺̹̝̗͈͉̻̹͇̮͇̜̻̪̯̖̥̱̺̘̥̺͚͓̱̰͓͓͓͙̪̭̬͎͕͙̙͍̥̹̭͓̲̲̱͕̳͇̞̣̯̠̜͎̰̖̟̲̯̥̰̮̯̻̦͉͉̫̬̼̠͓̞̱͖͍̟̳̦̞̝̫̘̺̫̩͚͓̖͔͎̯̥̞̳̟̫̗̯̫͎͓͓̰̙͇̳̞̗̻͇͕͖̟͍̖͖͖̼̺̰̪̜͍͖͚̯͇̪̗̰̝̫͉̤͎͍̩͖̱͓͙͓̮̣̫͇͕̬̪͕͙̐̓̐͆̾̃̋̿̌̓̋̏̎̑͂̆̈́̍̓̾̆͌̐͑̓̓̆͋̎̀̎̆́̌̆̂̾̓̈́̃̅̎͌̑̏̄̔̔͋͛̑̋̂̆͒̓̍͂͒͗̅̎͑̍̾̾͒́̃̂͌̊͐͆̇̾́̀̈́̋́́̾̋̂̿̓̂̽̒̇̎̍̀̐̾̅̈͋̋̚̕̚̚͘̚͘̕̚͘͜͜͜͜͜͝͝͠͠͝͝͝ͅͅņ̴̨̢̢̨̢̧̡̧̡̢̨̡̧̡̧̨̧̡̢̛̛̛̛̛̳͙̪̲̝̞̥̣͕͍͖͓̬͇̯̠̮̺̬̖͎̻͖̣͕̮̺͔̩̟̘̦̗̤̦͔̣̹̯͇̙̤̭̖̪͕̹̯̘̠̗͕͎̘̝̜̜̟͉̩̫̻͔̜̺͙̫̘̥̥̮̦̺͔͓͚͕̻͔͓͙͚̲̙̭͇̰̻̲͓̟̃̈̄̋́͋̎͐͌͋̂͗̾̀̅̄̓͂̽̈̓̋̀̈́͂̊͋̆̂͆̑̔́̓̾̂̆͆̄͛̐̐̃̾͒͂̃̀̿̈́́͐̅̈́͌̈́͒̏̈̃̎̿̉̈́̒̇̔̅̔̆̇͊̂̆̍̔̊̉̍̈́̌̓͂̽͛̂̉͆̂̒͊̎̀͊̅͆̓̿͗̑̆͋̈́̔̽͊̐̾͛̑͛̅̈́́̉̀̾̀͋͗̉̾̈́̾́̿̍͑́͑̓̈́́̈̽̈́͒̉̿͒̉̇͌̾̇̇̿̽̀́̑́̂̿̐̀͆̇̃̈̒̏̅̈́̊̔̊̐̾̊̇̾̂̍̈́́̈́̍́͂̑̾͆̊̆͒̓̒̆̌̔̀̍́́̽͊̄̅̈́̀́̇͊̊͑̔͌͆̓̎̈́͊͛̆̾̓̒̿͂̐͗̽̒̉̀̽͛̾͛̓̇̀̇͌͋̈̈́̽̀͊͋͘̕̕͘̚̕͘̚̕̚͘͘̕͜͜͜͠͝͝͝͝͠͠͝͝͝͝͠͠͝͠͝͝͝͝͠͠ͅĩ̴̧̡̧̢̢̧̨̢̡̡̡̡̢̧̨̡̡̨̡̨̨̡̧̢̨̨̛̛̛̜̘̞͇̫̟̘̠̝̹̞̮̬̰͙̭̘̱̻͚̟͚̱͓̞͓̮̜͙̻̩̣̼͇̟̝̳̗͓͉̲̟̥̥̹̦̦̩͇̻̥̗̥̺̘͓͔̜̭̲̫͙̪̞͈͍̱̣̭̭̠͖̙̰̞̘͖̯͕̮͎͍̯̟̪̤͈̦͓͚̥̩͔̪͉̘̩̪͙͔̺͕̖̦̦̥̜͉̺̻̪̖̜̹̠͇̼̩̺̬͙͈̻̺̤̤̺̰͇̠̠̫̣̝͍͙̱̰̲̫͍̳͎̺̭͇̖̥̦͚̫͖̠͚͓͕͔͈̞̳͕̲͇͖̘̞̱͍̗̹̝̣̘̞̝͉̲͖̬̼̬͕̙̦̲̻͙̥̺̦̯̙̭̣͉̯̣͖̝̻̥̱͕̫͙͕͉͙̣̭̌͒͂̆͊̂̈̍̈͐̒̔̐͂̿̈́̓̈́̍̐͌̂͊͛̌̇̐̀̅́͊̄̀͒̐̀́̈͐̔̽̎͒͌͒͆̉̅̈͌̅̌́̽͂̎̿͑̄̐̂͛̀͐͆̀͒̏͊̅́́̈́̚̚̕̚̚̚͜͜͜͜͠͠͠͝͝͝ͅͅͅͅͅn̵̨̢̨̢̢̢̧̧̧̧̧̧̨̡̛̛͕̮̱̞̣͙̖̙͔͍̪͉͚̻̺̬̻̲̥̞̟͓͕̫̰̼̲̫͈̦̘̟̗͚̺̲̰͍̩̖̜͈̳̗͕̱͖̺͇̬͇̻̲̼͚̗͖̟̟͉̫̤̝̳̦̖̯̭͇̱̙͕̹̯̻͕͖͙̼̟͍̣̝̲̻͍͍̳͕̥͈̦͔̣̱̱͇͖͙͎̹̞͉͍͖͎̗̮̳̤͚̪̟̩̯̫̖̝̞̊̓̔̈́̈̈̀̂̎̑̔̂̒̐͒̈̂̈́̿́̔̀͂͛͌̈̉̾̓͐̃̉̔͌̅̔͐̌͊͛̅̀͊̍́̃̾̎̃̀̐̊̑̈́̀̈́̍̀̌̿̊͊̎́̏̉̆̂̽̓͊̈́͐̇͛̆͋̎̉̄̏͗̑̀́̑̕̚̚̕̚͘͜͝͠͝͠͝͠͠͠͝ͅͅͅͅ ̶̡̡̢̧̨̡̨̧̡̧̡̨̡̧̧̨̢̨̢̡̛̛̛̛̛̛̛̰̲͖̺͚͎̻̮̬͙͖̠̙̞͍̟͇̣͉̩͇̞̗͚̰͍͕͈̩̯̮̩̗̯̮̦̻̫̝̱͉̪̮̗̲͉͔͚̻̼͓̰̬̣̝͙̩̹͈̦͔̭̞̘͖̤̹͍̮̭̼̼̹͇̻̰͙͍͙̞͔̥̰̝͍͖̠̻͎̣̣͔̳̜̟͚̟͔̥̪͓̦̤̦̠̥̭̗̪͉̳̮̦͙͇̪̭̪̲̹̲͚̪̥̘̥͈͉̭̫̥̳̪̩̲͚̦͚̳͖̱̗̱̮͇̦̥̝̱̼̲̘͕͔̬͓̰̙̬̗̻̝͎͍͙̗̼̺̙̮͉͙̯͇̮̳̘̭̞̝̜̣̬͉͚̝͚̳̩̝̬̩̘̫͈͎̗͍̩̦͉̳̜̤̹̟̤̈́͗́̿͆́̍̓͛̋̌͋̌̈͑̈̒̃̈́̎́̐͒̓̈́͂͋̎̀̑̇̂̿̿͐̌́͋͒͆̏̌͂̎̿̒̊͌̏̓̽͋́̉̃͒͋̏̏̏́̈́͊̀̀̋͛͛̄̿̒́̄͌̽̒̉̊̌̄̄͆̒̓̄̆̎̇̂͛̽̋͋͒͌̃͒̿̊͆̍̐̄͋̏̄̀̄̒̈́̓̿͒͑͑̇̍̍͗̕̚̚̚̚̕͘̚͜͜͜͜͜͝͠͝͝͠͠ͅͅͅͅḧ̸̨̨̡̛̛̛̛̥̠͈͓̙̲̜̟͚̼̘̦̤̻͉͔̻̫̩̬̞̤̳̙̱̻͈͓͇͔̖̻͈̪́̿͌͑̃̌̓̔̾̌̐̔͂́̅̂́̾̾̏̊͋̈́̔͛̏͗̒͆̄̆͗̈́͋̋́̐͋̈́̓̅͛͆̔̈́͐̈͊̓̏̈͐̄̍̒́̒́̏̍̃͆͗̾̐͂̀̊͒̔͌̀̈́͆̊̎̍̊̇̎̅̓͗̇͐̊̽͐̂̑͐̈́̇̋̒̈́̃̃̂̈̓͋̊͊̄͐̏́͆͛̎̌̋̓̓̑̆̂̃̏̆̈́̓̊̏̓͂̔̊̄̈́͒͆̔̒͌̐̃̆̈́͆́̈́̏͐̈́͒̉̔́͗̐͗̋̄̇͆̈̀̈́̍̈́̽̏̍̈́͌̾͊̉̔̐̀́͆̍̅̈́͑̊́̋͐̀̉͌͗̐̃͂͑̐̍͂̾̋̄̈́̈͊̇̃͆̿̋͗̾͐̄̈́̎̆́̋͗̊̀̎̾̀͗͛̄̒͋̈́̈́͗́̅̈̋̾̃͑̂͛̑́̆͘̚̚͘͘̕̕̚̚̕̚͘͘̚̕̚̚͘̚̕̚͘͘̕̕̚̕͘͘̚͜͜͝͝͝͝͝͝͝͠͝͝͝͝͝͠͠͝͝͝͝͝͝͝ͅà̴̢̢̧̡̧̡̨̡̨̨̧̡͉͉͍͕̞͕̣̺̣̤͎̥̬̱̬͇͍͓̺̬̜͕̳͉̱̝͔̻͔̭̯̙̞̦̭̜̠̭̹͔̦̺̘̱͔̙̰̠͚̳̘̦̟̙̳̻̠̗͈̗̮͕̮͔͎͇͓̲̖̬̞̤̞͇̥̪̩̮͖͍̻͓̺̪͎͓̺̫̜͉̞̪̙̤̭͙̬̬̮̯͚̘̗̣̲̝̞̞̗̖̘̫̝͖̮͉̙͇̝͉̞̩͉͕͎̤̠̠̩̝̘͖͚̰͕̳̝̜̦̙̯͎̹̤͖̪͈̱̦̠̗̺̠͙̞̗͎̭̠̩̬̣̖̝͎̜̻̬̭̼̹̬̼͎̳͍̪̣̮͉̯͓̥̜̗͉͖͎̦̹͈̩͎̞̱̞̩̜͖̭̟͌̊̐͌͗̍͋͗̈̓̂̎͐͋̾͒̒̅̒̆͐͐̇́̃̉̽̉̊̄̓̑͐̔̈́̓̽́̈́͛͋̇̋̇̃̀̀̉̾̑̈̓̆̒̽͂̾̐̉̔̔̿̿̊̾̋͌̍͂͛̓̏̋͑̋̃̒̊́͑͋̽́̒͌̅́̓̆̾͗͋̈̑͂̋͂͂̓͐̇̓̌̾̈́͗͒͗̀̍͆̆̑̑̓̈́̀̋́̌́͋̄͗̑̾͘̚̚͘̚͘̚͘̚̚͘͜͜͜͜͝͠͝͠͝͝͠ͅͅͅͅͅͅt̸̢̡̨̡̢̨̨̢̨̢̧̢̢̧̡̡̢͇̫͎̜͓̥̯͈̙̖̙̙̼̙̗̝͖̞̹̖̪̗̞͖̤̼̮̮͙̞̭̮͎̥̗̹͕̮̹͚̟͈̼̻̻̫̣̪̩̞̘̣͈͇̞͓̜̜̤̘͕̬̙̠̪̥̗͔̤͓͇̥̲̼̤̬̯͙̭̻̝̘͙̰̭̼͈͉͓͚͙̻̩̦͔̮͉̼̺̪̝̰̤͓̣͇̠̦͇͎̮͕̹͈̺̖̬̺̗̤̘̟̟̫̮̭̣̞̱͖̲̠̗̯̱̤̯̬̻̞̳͇̲̼͚͖̭͙̖̬̪͓͈͇̟̯̖͈̠̣̜̖̦͈͈̙̱̼̻͇̀̾͛̋͑̊͜͜͜ͅͅͅͅͅͅâ̷̧̡̢̧̛̛̛̛̞̥͕̺͓̞̺͉͉̩̭̟̙͔͈̰̭̣̱͓̭̰̥̮̯͈̗̪͔͌̈̀͗̈́̀̃͒̈́̓̓̌̈́̔̉͒̂̿̂͛͊̎̇̈̀̄̎͒̀̅̿̀̌͊͐͂͗͂͑̐̋̉̈́̔̐̆̇̆̋͒̅̄̾͒͛̍͛͛͂̃̌̽͒̑̊̔́̈́̈́̀͋́̔́́̒̔̉͂̽̂̿͒̌̾͆̋̂̍̽̉̐̓̈́̄͑̓͆̾̓̃͆̀͛̌͊̈́͌̍̊̌́̈́̆̉͐̿̐̅̔̾̌̒͒̌̌́͗̀́͋̄̈́̌́̑̐̓̔̊́̏̏̈́̽̌̀̉̾̉̋̄̒́́̈̀̎͛̄̆̔̾̔̋̈́͆̃̌̍̐̄͐͑̄̑̊̓͂́̌̀̊̆̊͒̎̂̐̆͑̾̾̓̿̅̂͐͊́͆̑͑̎̂̀̾͐́̀̈́̾͗̄͂́͑̾̐̊͌͂́͆̂̽̍̄́̈́̍̀̒̓͊̐͘̚̚̚͘͘̚̕̚̚͘̚̕͘̕̚̕͘͘̚̕̚͘̚͝͝͝͝͠͝͠͝͝͠͠͠͠͠͝͝͝ͅͅn̵̡̨̡̡̧̛̛̛̛̛͕͖̣̥̹̻̬̰͓͍̲̼̗̖̰͙̤̼̖̮͕͉̫̭̙̺̝̟͈͈̹̼̱̪̞̜̺̱̝̤͔̻͈̲̯̩̤̟̦̯̘͙͙̟͔̰̜̹̰̯͇̘̹̼̠̤̤̲̱̼͔̘͖͕̘̝̞̺̗̠̘̹̞͔̪̘̭̗̞̣̖̟̣͎̮̼͊̃̌́̊̏̈́̽̒̅̿̿̃̏̈̇̌̑͛̈̋̑̈́̒͒̉̈́͌̈́̾̑͗̎̔̒͊̑͐̈̆̂͊̆̓̋̀̃͐̇̍̅̀͛̀͌͊͐̉̀͑͒̏̉̅͂̈͒̂͋͌̅̐̂̀̀̏̔̒́̋̄͐̃͒̉̉͒̑̾̂̽̒́͗̌̌͐͒͑̌̏̽̊̊̍͑̆̾̂͒̍́̿̇̓̆̓̎̽̆͊̑̋̅͊̊̉̎̋̋̂͗̈̒̆͊̽̀̐̅̾̆̈̈́̊͂̿͂̔̽̂͗̃͋̒̋͗͑̄̈͊̓̋̂̐̑̂́̄͊̈́͒͋͒̉̔͑́͆̚̕̚̕̕̚͘̕͘̕̚͘̚̕͘̚̚͜͜͝͝͠͝͝͝͝͝͠͠͝ͅͅͅḑ̵̨̨̧̧̨̧̨̧̨̢̨̢̨̨̡̡̨̧̧̡̢̧̧̧̡̨̧̧̛̛̛̲̠̘̘͈̬̘̖̟͈̼̻̤̭͙͚̫͈͕͎̞͎̦̘̥͕̻̱̖̗̥̗̟̘̩͓̼͖̺͓̣̣͍͚̹͓̦̞͎̮̭̰̬̥̝̥͍̬̝̟̝̯̗̥̪̮͕̬̭͓̤̭͔̦̦͈̥̠͎̘̯̯̘͍̭̠̺̟̹̺̞̜̳̞̣͉̖͙̱͖͔̹̹̺̣̬͓̱̰̩̻͙̙̬̪̞̯̤͖͙̪̖̦͚̣̣̤̟̞̤̙͙̦̱̫͈̖̩̹͍̭͙͓̠͇̦̫̺̯̫̫̱̼̤̣̮̯̯̝̣̠̮͖͈̘̫̻̗̩̝̘͓̱͎͎̦̮̻̼͔͚͉̰̣͕̹̳̣̝͉̖͓̹̣̱͈̳̣̼̥̼̬͌̔͊̈́̓̎̀̃͌̐̏͋̒͐͗̿̓́̏̀̀̌̾͊̊̇͑̔͑̓͗̽͂̽̇̂̒̈̈͋̐̓̇̅̔͂̍̾̏͒̽͌̂̓͌̑͐̍̄͛͌̿̊̄͑̑̆̎̑̇̄͐̽̌̈́͐̾̌͆̉͊̽̀̀̈́̑̈́̐̒̄̾̄̀̅͛̀̆̈̐́͊̈́͊̏̇̓͑̈́͂͂̆͌̽́̓̃̃̓͒̃͂̀̈͋̉̒͗͑̓͋͐̉̿̎̒̚̕͘͘̚̚̕͘̕͜͜͜͜͜͜͜͝͝͝͝͠͠͝͝͝ͅͅͅͅı̵̧̨̧̧̧̢̨̨̨̧̡̨̨̧̢̨̢̡̨̡̧̨̨̨̧̛̛̛̛̰̞̮̺̞̹̭̲̞̖̪̰͇̳̟̗͈͖͓͓̙̘̯͉̟̞͉̭̤̹̱͉̠̠̘͇͚̝̤͉̻̬̗̗̬͚̼̫̭͚̤̱̯̱̼͎͙̥͓̦̳̞̼͔͚̬̩̙͖̼̰̟͙̩̘͔̙͍̜̣̣̻͉̮͇̲̻̘̫̪͔̗̭̞͉͖̱̰͕̫͉̣͈̱̝̜̙̭̠͔̰̥͉̲͎͎͓̹̻͙̠̠͉̜̻̺͇̣͉͇͙͓̤̻͔̜̟͙̲̹̝̩̞̰̥̮̘̘̱̙̜͓͓͕͙̳̜̮̟̹̠͕̠͓̲̮̤͕̲̦̩͍̩̻̰̭̳͓̖̹̗̬̜̣̗̞̥̫̠͕̟͉̥̫͔̯͇͍̰͚͓͇̮̑̈́͌͌͐̅̌̄̍̏͋̏̽̃͑̈̄̈́́̑̈́̉̑̈́̈̀̊̿͐͆͋͗̀̈́̃͌́̿̀̇͗͆̒͑̈͗̋̈́̀̑̉͌̒͐̈́̉̄̇̓̿͌̍̂̍̀̇͛̾͑̍̇̌̈́̐̈̈̒̉̈̓̽͋̑̏̈́̄̎̔̂̍͊͌̐͛̓͊͒̍͌́̈́͂̔̿͊̈͘̕͘̚͘̚̚̕̕͜͜͜͜͜͜͜͝͝͝͝͝͠͝͝͝͠͝ͅͅͅ",color=(220,20,60),center=(320,220),fontsize=20)
        elif mm1 == 3:
            screen.draw.text("ḣ̴̢̡̡̡̨̧̨̢̡̡̨̧̡̡̧̡̟̻͎̫̤͎͈̹͚̝͚̙̱̫͈͈̩̤̤̝͖͖͍͓̩͈̭̰̺͚̗̤̙̱̻͇̤̬͎͚͉̫͎̦͓̮͍̭͚͕̫̺͖̤̘̬͍̩̘̻̰̙̮̥̤̮̞͍̺̱̦̞̤̩̺̗̻̹͕̳͚̘̤̣̻͔̮̻͚̬̤̟̣̳͉̪̬͔̯̻̹͔̱̞̫̣̦͇̲͚͖̹̞̖̠̲͕̯̳͍̖͓͉͈͉̺͈̟͚̼̻͎͖̱̭̳̯͕̦̬͍͖͓͉̥̪̯̬̼̦̼̝̟̯̟̘̣̣͔͎͎͕̝͎̝̰̲̝̥̼͕̜̜̯̯̤͕̙̥̲̪͍̪̦̼̟͈̹̲̘̰̀̑̇̇͐̒̏̿̇̾͋͊̿̈́̓̏̒͋̆̈́͑̐̓͂̈́̇̇͂̊̂͋͗̓͗̋͊̈́̾̌̾͂̆̍́̆̊̑͋͐͒̊̊́̾́̐̓̆̃͋̽̔̾̅́̈́̔͐̒̿̒͑͋̓̅͑͛̒́̓̈͂͂͂͑͆̆̕̕̚͘̚͜͜͜͜͝͝͝͝͠͝͝͠ͅͅe̷̛̛̛̛̛̛̛̛̛̛̟̰̮͙̩̰̫̬̭̲̦͔͙̹͍̹̗͍̣͔̘͖͈̻̻̘̟̣̙͉̮̦̟͙̯͇̼̦͚̦̟͆́̑̏͒͆̒̔̂͊͊́̀̌͋̾͌̿͐͌̐̈̊͒̓̓̃͊̃͊͗̂̌͊́̄̏̔͂́̌͌̇̔͋̄̍̄̌̈́͋̏̎̾̊̀̈́̆̍̉͗͊͗͊͂̐̀́́̏̈́̑̀̔̆̽̈́̐̓͛̾̍̆̀̽͛̇̈̇̌͑̏̌̀͌̐͋̅͋̄́̎̈̎͗̅̀̈́͆́̀̈́̋̃̀͒͛̂͋͒̓̌͛̏̀̅̿̇̆̃́̈́̄̅̑̈̊͒̆̈́͗͊̽̏̈́͌͑͛̀̆̋͆͑̈́̐̅̈̎́͒͋͗͂̽̀̓̾̀̽͊̃̃͋̆͆̈́̆͋̆̅͂̈́͊̋̅̈́̔͂́̑̓͑͗̈̈́̾̅͆̊̅͒͗͆͌̏͒͂̿̅̇͛̐̈́͊̊̔̄́̈́͊̉̀͂̚͘͘̚̕̕̕̚̚͘̕̚͘̕͜͝͝͝͝͝͝͝͠͝͠͝͝͠͠͝ͅͅr̶̢̨̡̨̡̢̧̧̡̨̨̨̧̧̢̨̡̨̛̛̛̖̻͈̬̱͚̜̱͎͕̱̮̟̜̭̣̰͙̙͕̠̜̭͙̥͎̥̣̰̗̠̞̝̮̰̭̣̪̜̪͎͖͕̜̖̦̤̘̮͚͈̬͕̦̞̦͓̘͉͍̺̗̤͈̦̼͕̝͔͇̮̳͈̼̺̪̲͙͎̫̖̪͚͓͇͔̲͚̠̗̘̲͇̜̘͙̮͚͙͕̤̹͓̻͚̰̭̩̥̺̘̦̣̮̟̳̲͚̣̗̘͙̯͇̣̜̜̰̻̣̟̜̻̖̜͔͙̖̹͇̼͙̳̫̫̯̺̲̞̮̝̯̮̼̖̞̱̱̞̗̱̮̼̥̬̬̞̯̙̩̣̬͖͎̝͙͍͎̗̻̘̹̗̬̪̗̪̤̥̘͚̰̮͓̮̗̝͔̩͕̮͇̘͓͚̞̪̬̱̭̫̫͉̭͈̥̞͓̱͙͚̞͉͍̗̤̯͇̺̞̘͓͙͇͖̜̞̺͓̙̼̩̝͗̓̿̃͌́́̊́͆͐̏̀͌̋͌͑͛̂̀̿̓̉̎̌̔̃̄̈́̋̊̇͊̆̊̒̎̍̊̽͒͊̄̊̓̈́͆͂̇̈́̑̀̇̏̆͆̉̕̚̚̕͜͜͜͜͜͜͜͝͝͠͝͠͝͝͝ͅͅͅͅͅͅͅ ̶̨̡̡̡̢̡̺̜̙̫̥͙̯̖̬̬̘̤͖̗̼̣̭̯̼̫͚͓͎͎̩̖̖̖͖͎̯̘̠̫̰͖͙̦̯̪̗̺̹̠͙͓͕͙͉̫̼͖̌͊̀̋̔̓̔́̈́̄̾͊̈́̐̃̑͆̓̋̈͌̽̎̒̇͗͑͂̒̒̈̏̓͊́̓̒̐̅̒̄̃̄̾͋̒͐̀́͊̆̂͋͊̑̍̓̎͌̀́̊̆̑́̉̃̂̄̐͂̓̐̎͆͊̓̒̔̐̒̆̍͑̿͂͆̈̈̏̓̓̆̍̐̊͒̑͑͗̈̅̔̀͊͒͋́̈́̂́́͘̕͘̕̚̚͜͝͠͠͠͝͝͝͠͝͠ş̸̧̡̢̨̨̡̛̭̣̖͍̠̘̯̳̯͎̺͕͉̭̳͇̫͕̩̮̙̙̱̫̳̭̖͉̥̘̳̲̱̦̜̘̟̗͖̟͇̺͖̗̔̓̈́̈̓̇̄͂̆̾̿̃̈́̀͂̍̾̅̍͒́̓̈́̀̍͌͆̂̈͌̏̍̒̃̿͒̇̔̈́̍͑̈̐͆̿̊̍̏̀̆̿̽͑́̿͆̾̌̅̾̐̄̄̒̎̒̑̾̾͂͐̒̊͗̓̑͒̐̑̊̐́͑̒͑̍̓̔̾͛̀̉́̊̀̃̈́̽̋̅͗̔͊̀͗́̆̌͐͐̎̉̽͗͗̈́̅̈́̃͂̌̈́̑̔̇̊̑̍͑́̋͌̇̾̍̉̔̋͂̊͂̈́͛̋̆̌̂̌̽͐̽̈́̈́̂̓̈̋̾͋̇̽̈́̿͌̈̄̉͌̇͂̽̈̅͗͑̉̒͐͛̀̎͗̅̉̋̉͌̐̈̾̈̊̑̆͂̾̈́͌̾̕̚̚͘̕̕̕͘̕̕̚͘̚̚͘̚͘̕͝͝͝͠͠͝͝͝͠͝͝͝͝͝͠͝ę̷̡̡̢̨̡̧̡̡̧̢̢̨̡̧̡̨̡̧̢̛̛̛̠̩͚̳̥͇͙̦̞̭͔̼̥̦̲̫̘̠̗̤̲̞̯͉̗̞̘̺̣̝̥̣͕̱͔͖̜͓̥̭̮̪̲̯̪͙̥͇͚̥̗̭̥̰̘̲̮̫̩͙̟̝͉̱̻͓̗͓̰͕̺͉̟̞̜̳̺͖̠̜͔̣̘̟̜̰̘͕͙̝̻̠̩͙̺̣͉̬̳̫̲͎̲̰̝̞̫̯͖̤̫̣̙̳̻̮̰͕̼̫̳̗͚͇͉̜̪̘̗͔̙̦̭͔̞̜͔̫͓̟̗̘̪̣͙̫̬̮̼̝̠̪͈̩̟̻̟̺̝͖̳̯̹̻͓̰̥̰̻͇̺̜̗̠̯̝͑̃͗̿͛͗̈́͛̌̄͒́͂͋͒͌̊̋̈̋̆̾̍̑͆̇̏̒̑̊͛̅̒̿̽̈́̏̔͊́̓̈͒̑̽́͋̊̒̐̓̿̅̔̒̈́͒́̓̈̀̍̔̀͊̅̃͋́̐̽̀̽́̿͊͑̍͌̾̓̉̈̍͂̽̍̐̇̾͐͆͋̎̋͂̿͐̕̚͘̕̕͜͜͜͜͜͝͠͝͝͠͝͠͠͠͝͠͠͝͝ͅͅͅͅͅͅy̷̨̨̡̡̧̡̢̢̨̡̨̨̨̢̨̱̦̜̱̬͖̰͙̰̜͔̣̖̱̤͕̦̥͙̥̘̦̘͉̰̺͉͖̱̱̻͈̦͉̺̜̟̞̗̮͙̦̫̞̘̪̤̙͉̹͖̜͇̜̞̘̙͚̖͖͙̬̣̟̦͇͙̜̝͕̰̪͉͙͖̲̪̰̺̯̬̻͈̺͖͔̜̖̣̥̰̟̬̤̳̲͚͇̱̫͇͈͙̺͎̝̖̫̲͉̰͚̫̘͚̜͈͖̦̹͉̻͍͂͌͌͊̈́͗̓͑̊͊́͜ͅͅͅͅ ̸̨̡̡̨̨̧̡̡̨̢̨̨̢̛̛̛̛̛̳̹͍̻͎̫͕̰̬̪̠̜̲̻͙̠͚̪̩͔̙̮͉͈̦̺̻͚͖͓̮͈̱̼̣͓̗̭͚̫͉̝͈̪̘̜̜̘̼̻̞̭̗̗̰̩͔̪̲̤̲͕̗͍͇͔̣̬͎͍̠̬̮̙̝̮̥͈͍̩̼̦̹͙͈̙̱͍̩̱̥̪͍͉̥͔̬͉̪͙̤͙̣̫͖̻̤̮̣̼̜̩͙̤͔͖̤̘̘̻̩̰͍͕̙̝͕͓̠̱͖̣̰͙̖̪̫̙͇̿̍̇̅̾̿̉͋̏̂́̑͐̓͐͒͛͊̅͑̀̿̐̊͊̅̇͆̔͛̎́̾̇̑̃̾̈́̃̀͊̋͌̉͂̈͋̋̓̀̓̾́̀̏̑̋̃̀͂̍͑̾̌̉̄̆̆̏̈́̀̀̓̃̏͂͊͋̂̈́̽̔̏́̋͂̈́̇̿̀͗͐̇̽̒̀̿͗́̂͂͊̍̊̅̾̑̍̇́͋͆̄̒̊̓̓̓̌̆̐́͗͛̉̎̽̉̎̾̃̀̌͛̓̏͆̿̓̈͆̉͋̓̕̕̕̚̚̚͘̚͜͜͜͜͜͠͠͝͠͝͠͠ͅͅͅͅį̵̢̡̛̛͇̣̪̺̭̲̙̖̱̥̰̦̳̮̞̱̞̭͈̮͚̳̲̰̰̫̼̜̞̲̣̖̼͈̦͖͚̙̝̬̱̘̠̮͋̑́̌̀̇̽̐̏̍̈́̽̔̓͆̈́̎̾̾͑̈̈́̒̈́͐́̔̇̍̊͊́̾̍̒̓͊̊̔͊̾̓̓͑̉͑̐̔̊̿̑̈̇͌͌̓̌̆̎̾̐̋̐̍̈́̊̏̿̀̂̐̎̓́͋̆̑́̇͊̇̊̃̈́̐̿͗̀͑̇̿́͂̀͒̓͘̚͘͘͘͘͘̕̕͜͜͝͝͠͠͝͠͠͝͠͝ͅͅç̵̨̨̨̨̧̨̨̡̨̨̛̛̛̛̛͔̦̮̻̞̮̱̦̰̙̝̤̼̞̘̞̲̖͎̰̥̠̹̜̩̫͖͚̙͕͉͉̘̺̮̺̜̖̝̻͖͎̼̺̩̦̜͉̹͕̫̹̹̟̰̪̦̺͉̤͎̔̾͆̽̍̇̄̈͋͆̆̃̿͊̔̈́̎̍̈́̅̄̂̆̈́͐̓̽̾̐̒̄̔̂̓̒͛̎̈́͐͐̀̿̈́̎̔̒̈́̌̈́̈̄̆̌́̈͌̾͗́̀̿͗̑̒̾̓̓͊̈̑͒̈̽̈́̎̈́̍̈́́͛̏̌̐̿̄̽̀̽̈́̃̀̆͋̊̿̽̀͒̈́̀͑́́̓̆̃̋̈́͛̓͆̔̾̔̈́͒̐̇͆̽̃̀̑͗̽̂̈́̃̄̎͛̌͐̃͒̈́̀͛̾̂̌̈́́̍̔̄͊̂͊̊͂̉̍̏̈́͐̀̑̅̐̽̍͑̂̾̉̂͑̀̎͆̓̽͌̾͋͆͗̈́̆́̎̔̀̆̈́̄̊̍̄̄̌̒͌̽̀̈́̕̕̕̕͘̚̚͜͜͜͝͝͝͝͠͠͠͠͠͝͝͠͝͠͝͝͝͝ͅį̶̢̢̨̨̡̡̢̢̡̨̢̡̧̨̨̧̢̢̧̨̨̢̡̨̨̛̛̛̛̛̛̛̛̥͚͎̻̯̼̻̪͕̮̬̹̰͓͔̖̟͍̳͍̺̙̯̥̜̤͖̠̻̤̮͉͚̪͉̬̠̟͉̼̯͙̟̯̬̙̳̲̟̣̼̩̤̤̹̙̟̦̻͎̟̣͎͚̬͙̜͚̪̫͙̦̭̦̩͙͈͈̲̬̰̭͍̩̣̥̜̲̹̩̱̤̪̜̣̦̜̮̲̭͕͇̪͚͚̲͔͈̙͕̲̣̪̲̩̰͍̦̬̯̠̟̰͚̼̟̗͓̘̞̪̹̗̪̘͚̺̗̩̩̪̻͎̺̬̲̤̬̰̲̱͉͈͇͚͙͍̝͈̼̦̦͉̠̗̬̜̠̞̳̺̙̣̯̩͎̝͙͚̦̻̘͙͔̬̲̩̪͖͈͕̮͔̜͚̬̞̥̲̩̙͙͙͙̮̹̬̞̳̗̪̟͓̟̼͖͙̘̺̰̪̥͕̝͍͓̪͉̟̟̦͇̙̥̜͈̙͙͉͖̤͍̻̹̩̪̜̎̍̉̿̉̇̃͌̓̒̈́̇̽͌͌͂̇̔͆̿̽̋̄̄̉̃̾̇͛͒̒͋̉̈́́̈́͒̀̔̂͆̽̈́̂̽͆̄͛̔́̍́̋͌͐̔͒͆̅͆̋̈͂͛̌̈́͛͛́́͋̀̈́̑̈̿͊̈́͛́͂͋̈́̂̓̽͆̀͂̎̉̉̓̈̆͑͊̄͛̾͑͊̾͆̆́̀̋̓͂̌̄̊̔̐̄͛̑̆̾̏́̒͂̉̊̊̏̐͑̎̀̊͌̆͐̐̄̄̍́͌̽͛̌̈́̍̏̓̅͊̓̐͌̔̓̋̀͋̌̈̍̐̇̉̊̽́͂͗̍̓͑̀͌̍̈́̏̉̾͂̋͋̿̾̊͛̃̀͑̄͐̉̃͌̈́͆̒͌̇̒̐̕̕̚͘͘̚̕͘͘͘̕̚̕̚͘͘͜͝͝͝͠͝͠͝͝͝͝͝͝ͅͅͅͅn̵̢̨̢̨̨̧̨̨̧̢̢̧̢̨̛̛̛̛͉͔̫̥̖̱̤̟͙̬̝͙̤̦̟͉̦̤͚̭͕̥̼͚͈̫͇̰̪̜̩̗̘̮̤̩͚̪͎̦͓̩͔͕̩̰͕̗̝͙̻̦̖͕͙̱͇̹̱͚̳͖̻̲̫̜̝̼̩͇̘̱͍̻͙̲͎̙̜͎̹̟̭̤̬̲͖̪̯̤̭̲͈̘̗̘̪̤̼̩̟̩͙̹̞̱̺͔͙̼͔͖̳̙̼̝͇̩̟̱̝̜̻͕̟̜̻͍̟͉̼̝͕̹̝͉̪̙͈̘̺̆̆̇̄͗́̎̈́̍͌̌͌͛̾̾͌̓̈́̉̇͊̓͐̀̅͆̑̍̈́̔̌̾̉̈̆̑̍̈́̋̄̎̐̾̀̎̑̍͊̆́̓́̽̈̃͒̉̈́̽̀̉̾͂̊̇͆̔̀͂̈́̆̃̏̐̎̌̑̊̓̊̔̿͋͊́̑͛͗͋̅̒̂̽́̈̓̃̇̃̎̐̍͒̋̐͂̈͛̾̿̔̐͂̍̐͗͑̑̉͒̽͗̒̋̋̾̍̎̌̇͑̅̀̀͑̈́̃̃͒̉̄͂͛̿̌̿̄͒̈̂̇͆͒̓̾̀̿̓̾̍̿̋́̍̌̄̽̈́̄̎̈̇́̾̀̂̑͛͋̾͗͒́̾̊̓̌̍́͂̌̇̿̌̾͑̀́͑̋̌͗̂̒͑͊̅͐́̇͆̃͛̑̏̒͋͛̕̚͘̕͘̕̚͘̚̚̕̕̕͘̚̕̚̕̚͜͜͝͝͠͝͝͝͝͝͝͝͠ͅ ̶̡̧̢̨̨̡̢̡̡̡̢̢̢̡̛̛̛̛̫̩̹̮͖̘̤̜̩̥̝͔͙̘̪̗̖͈̘̝̩͙̹̦̘̺̻͙̝͉̞͖͈̱͖̮̥̝͕̗̞̘̦̣͈̤̪̗͕͓̰̤̙͍͙̬̟̮͙̜͓͙̩͙͈͎̯͖̖̤̤̳̩̼̗̮͍̪̭̻͚͇̠̰̋͛̿̓̾̓̇͐̈́̈́͋̿̈́͑̓̀̏̈́̀͌̀̉̂̀̓̀̇͂̄̿̐̐͊̔̀͗̎̓͌͆͑̌̃̂̈́̏̋̌̒̅͒́̊̑͊̈́̐̂̃̐͗̀̆̐̃͌̉͆͆́̾̈́̎̊̋̂͐̓͋̂̽͋͋̽̔̐̿̋̓̆́͑͗͗͐̋͌̆͗̃̇̉̇́̓̓̎́̓͒̍̊͋͐́͑̿̎̌͒̉̈́̊̒́́̓͂́̀̽̆̒̆̔̊̿̄͑̓͌̊͊̑̅̀̀͌͌͛͑̉̓̌̾̅͂̅́̾̊̇͒̀̀̆̍̽̒͒̓̈̈́̒̒́͆̌́͂̉̄̿͌̀͒̈́́̓̈͛̈̓̀̎̌̅̄̾̑̏̌̂͌͗̌̏̽͗͌͒́̃̄̈́̊̎͗̾͋̀͋̈́̿͆̓́̐̆͊̃̆̃̑͐̋̑̓̏͑̚̕͘̕͘̕̚͘̚͘̚̚̕̚͘̚̚̚͠͠͝͝͠͠͝͝͝͝͠͝͝͝͝͝͠ͅͅç̵̡̡̧̨̡̢̧̧̨̧̧̨̡̢̨̢̨̨̨̨̡̳̜͖̬̬̮̯̜̤̮͖̹̣̻̟̫̙̙͎̦̮̖̫̬̱̞̦̼̰̞̻̤̯͓͚̟͈̤͚͖̳͖͍̼̖̞̰͉͙͉̟̭̲͎͚͉̞͚̜͇̖̮̰͓͔͙̗͈͇͉̪̩͎̩̼̭̺̬̦̦̰̯̬̣͖͈̘̗̥͍͈̖͕̤̦̠͖̺̮͚͖̬̪̦͙̮̦̙̲̟̳̣͔̤̰͕̳͙̺̼̦̯͕̙͍͉͎̝̰̖̯̘͓̺̰͖̬̮̤͔͖̮̺̼̬͈͔͙̪̻̮̰͕̗̼͕̼͙͉̘͈̬̙͉̞̲̗̠̟͉̝̘̥̞̪͉̼͎͍̻̜̤̼̙͕̜̫͚̪͖̤̞͚̞̦̖̫̳̝̦̤̬͈͈̙̲̮̘͍͔̲̜͕̙̗̭̘͖̬̥̺͉̠̤̙̰̳̜͎̥͒̈́̅̒̅̐̓͒̊̌̆̍͛̒͊̔̇̓́̈̎̋̇̓̽̄̾͐͗̑͋͊͜͜͜͜͜͜͠͝͝͝͝͝͝ͅͅͅơ̵̢͚̼͎̝̬̜͇̗̲̜̆̃̏̆͗̐͌̈̄̉̓̓͗̀͗͌͋̈͛̀̔̎̏̆̇̋̈̈̆͛̎̓̉̂́͗̅͗̈́̔͋̒̔͂̋͑̅͒̆̋̓̈́̎͌̾̐́̆̈́̊̾̈͂͛̌̌͐͋̔̇̆̇͑̋͋̋͆́̑́̿͋́͌͛̈̎̈̒̀̊̈́̊͐͐͊͑̓̒̐̊̌̓͛͗͌̈́̉͛̉̌̅̈́̔̈́̈͂̔̆́̀̈́̇͊́̋͌̄̀̀̒͛̽͑͆̊̓̌͆͑͘͘̕̚̚̕̕̕̚̕̚͝͠͠͠k̵̢̡̢̧̨̧̨̢̢̢̡̢̡̧̮̮̘̰̯̝̤̖̲̬̤͖̘̜̮̺͖͕̩̭̙̤͉͓͉̫͖̼̼̠͖̠̝̗̲̦͍̳̲͓̲̖̦̠̗͕͎̟̳̖̪̤̹͓̭͍̦̼͎̞̠͖̰̜̫̗̦͇͎̩͎͉̜̖̖͔͇̱̳̩͖̬͕͎̺͇͕͍̦̰̬̬̜͙̮̣̱̬̻̱̣̬̩͇̳̗̒̌̄́͆̋̎̈̔͋͗̇̂̋͊̈́̃͒̈́̄͒̍̄̉̑̾̓̈́̍̓̾̔̐̋̈́̔̓̓̌͘͘͜͜͝ͅͅͅͅͅ ̵͎̬̲̳̠̤̤͕͎̯͚̪̖̲̱͚͆̇̌͐͊̔͊͘͘͝͠ͅg̴̢̧̡̧̡̧̨̡̨̡̡̨̨̡̡̢̢̨̧̨̧̨̨̡̢̡̢̛̛̛̥̲̙̼̰͖͚̼̟̦̟͕̘̘̤̬̬͇̭̦͈̫̥̠̣͈̮̣̹̭̬̯̜͈̝͚̻̺̘͕̘̱̟̭͉̪̠̠̱̮̝̺̟̘̰̗̥̜̤̩͕͍̜̲̼̠͔̜̞̣̞̬̻̗̬̖̙̦̲͕̭̙̪͚̣̟̙̼̻͖̗͍͚̣͖̠͉̙̪̯̦͍̼̣̜̳̫͎͍̲̜̙̺͉̼͇̘̱̺̞̣̙͚̬̗̯͕̫̝̱̰͖̺̪̳̬͔̤͎̜̦͚̣̱͍͓͔͎͚̪̣̞̗͍̟͙̙̭͈̪͕̪̞͔̱͙͙̗̫̤̗̬̙̦̩͉͉̘͚̗̘̜͚̻̯̲̱̻͈̼̮͔͇͔̙̣̙͉̮̮̦̺̼̗̙̣̬̰̣͖̬̭͎̳̥͔̣͙̯̱̮̺̮̟͓̯̦̹̖̙̳͚͇̺̥̲͕͇̙̞̺̣̦̦̳̱̻̹̣̖̖̙̗̗̣͛́̄̽̄͛͋̂̄́̈́̉̐̌͆̈́͒̾͒̏̈̓͋̆̎͗̀̓͛̿̋͆̐͌͒͊́̀̄̀͋͌͆̊̐̆͛̍̂̓́̂̈̎͛̉̃̎͌̑̒̐̐͊͒͑̄̏̑̾̍̀͛̇̒͗̏̀͑̋̽̽̾̊̓͌͂̉̏̒̂̈́́͌̊̅̇̓̀͊̒͘͘͘̚̕͘͘͘͜͜͜͜͜͜͜͠͠͝͝ͅͅͅe̸̢̢̨̡̢̡̺̼̟̙͔͔̲̝̲̬̲̙̳̖̲̗̻̭̫͉̖̞͙̾̾͂̉̃̍̇́́̽̉̓̌͊͂̊͂̂͑̈́̈́͌̾̋͊̎̅̄̈̂̑̂͌̅͋͑̌̂̾͐͐̂͒̀̽̏̄̾̓́̊̌͌̉͌͊͂̀̾̎͊̊͊͒͐͌͛̾̊̆̑͑̆̉̔̂͐́̈̚̕͘̚̕͝͠͝͝͝͝͝ç̸̧̡̨̡̢̢̢̨̡̡̧̡̧̢͖͇̦͇͔͈̜͕̥͍̘̟͎̼̤̯̟͈͈͙̤̹͙̤̻̟̥̲̻̤̯͇̳̠̝̤̱̳͓̣͔̜̪̥͓̜̲̠͖̼̠͖̣̪̰̰͖̲̟̞̲̗͈̲̮̳̯̬̪͙̪̥͖͚̼̥̻̟̫̺͍̩̣̟̥̻̰̟̩͚͍̳̘̤̹͍̼̲͕̱̣̰̳͍̹̫̼̮̮̮͖̠̘̙̭͚͈̖̰̬͍̫̩̘̘̟̬̺̫͙̮̖̣̼̖̘̬̗̬̣͔̠̮͍͚̘̰͇̦̈́͂́͑̓̄̅͌͆̂́̏̌̇́̀̈́̑͑̒̔̄̕̕̚̚͜͜͜͜͜͜͠ͅͅͅ",color=(139,0,0),center=(160,220),fontsize=20)
        elif mm1 == 4:
            screen.draw.text("b̵̢̡̨̨̡̡̡̢̧̧̢̧̡̡̛̛̛̫̬̳̩̮̳̻͇̤̭̣̙͈̼̤̟͍͖͙͔̞̩͈͇̘͓̰͓̜̙͖̱̪̜͓͓͔̬̱̺̣̭͈̠̻͕̺͙̣̺̟͕̝̳̘̟̖̦̤̮͖̱̳̬̲̺͓͍̠̹͎͓̬̣̬͍͚̻̼̗̘͎͈̜͍̖̯̫̥̖̠̮̳͖̯̫̦̘͚͎̜̝̼̠͇̭͔͓̭̱̯̟͖͈͚̖̹̮̰͇̻̭̘̳̣̩̺̦̻̘͕͙̜̳̩̖̝̩̦̩̗̯̰̦̰̺̼̼̥̫̦̬̮̤̟̜̞͔̺͓̪̙̜̲̥͔͉̼̤̙͚̩̦̳̮̣̭͈̲͓̙͓͓̭̝͓̫̝̋̆̽̂͐̆̐͌̀̇̿̈́͑͒̃́̿͊̑͒̄͋̅̋͊̂̓̑̈́̃̈́̉̎́͌͐̒͊̑̿̉̃͐̆̎̂͋̿͂̅́̆̊̿͛͒̃͒̀̿́̑̋̄͋͊̆͗̇̌̈́̋̅͌̄̈́̂̅̉̅̅͛̆̿̄̑̃̀̉̆̔́̔̎̆̊̅̔́̆̐̋̈́̇̀̍̍̅͑̈̿̈̎̏͂̾̽̈́̈́̓́̃͊̈́̒͗̂̋́͊́̃͛̾͛̀̿̇̊̾̒͋̒͐̃̋̋͋̐̽̑̿͗͛̀̍͗͛̐̽̄̐̓͂̓̋̌̇̌͂̑͂͌̓̑̉͌́̀̃̀̆̓̆̒̏̏̕̚̕̕̚̕̕̕͘͘̚̚̚͘̕͜͜͜͜͜͜͜͜͝͠͠͠͠͝͠͠͠͠͝͠͝͝͝͠͝ͅͅͅà̴̛̛̤̰̯̐̈́̅̔̌̿̉͛̅̏̾̿̀̅̿͛̌͋̄̓̈́͌̿̈́͒̆̓͑̎͒̽̎̇́̈̍̽̓̀̇̐͐̔̓̿̐͒̍͊̈̂̈̈́͋̈́̈́͋̔̇̄̍̈͋̿̉͐̀̒̊̍͐̀̊̏͘͘̚͘̕̚̚̚̕͘̕̚͠͝͠͠͝͝͝͝͝͝ş̸̨̧̡̨̡̢̨̢̛̛̛̛͕̪̹̝̪̩̟͕̳͇͇͈̫̜̭͎͈͕̠͎̤̫͙̠͙̪̩͓̣̤̗̳̦̖̘̳̻͍̙̠̤̘̪̩̩̩͈̻̝͉̳̺̟̤͉̠̽̀́̎͆̒̒̎͛̂̓̔̈́̔̾̂̈́̉̌͗̊̈́̈̊̇̎̾̄̂̄͑̄̏͋̓̽͆̾̽̍̎̓̔̈́̎́̀̉̀̃̇̈͌̏̋͋͊̀̒̓̄̃̽̊̿̉̽̎͌͌̔̅̀̀̾̐̽̑̿̀̇͗̏̂̍̀̐̐̐̽̉̏͒̈́̾̇͊͛̾̉̐̔̿̈́͑͐̊́̃̌̂̈́͊̔̍͌̏̊̆͊͌̋͋͛͒͊̌̈́́̀͊̈́̂̏̔̿̂̋̍̈́̉̀́̀͐̿́͐̿͗͌̾̔̊̃͗͌͂͗̋́̆̌̑͛͌̊̇̄̈̂̇̿̂̿͊̅̄̈̍͆͊́̔̀̽̓̔̈́̓̈̒̈͊̄̃͑̾́̃̀̃͐̓̀̌͊͌̐͂̐͌̄̄̋̓̿͆̎̒́̓͑̓̉́̿̀̏͌͌͊͂͋͛͋̊̃̐͗̎̈́̄̅̈́́̂̑̄̎̿͒͘̚̕͘̚͘̕̚̚̚̚͘͘̕̕̚̕̕̚̕̕͜͝͝͝͠͝͠͝͠͝͝͠͝͠͝͝͠͝͝ͅą̶̨̡̡̡̢̢̡̡̢͓̙͓̹̣̻̬̙̬̩̞͉̠̺͈̥͉̠̞͍̻͙͇̫̼̪͕͈̠̥̠̞͙̼͍͙͓͖͔̩̳͚̤͇̹͕̹͎̬̻̝͙̪̠͖̟̠̳̳͎̲͓̗͚̮̣̬͓͎̹̱̩̰̣̻̜͚̠̳̙͇̜̟͎̝͚̼̞̞͍̜̱̰̰͖̞̹̮͕̮̘̝̲͚͇̩͓̤̟͍̟͓̹̤͉̪̻͉̟̱̤̤͉̬̟͖̳̳̲̘̠͙̯͉͚͖͙̥̭̥̬͉̈͂͊͐͋̅̏̊͗̋́̅̈́̚̚͘͜͜ͅr̴̢̢̧̛̛̛̛̛̛̛̛̛̛͔̻̱̥͈̮̠̲̻̖̭͉̯̣̖̗̦̘͓̮̞̹̭̗̬̪̫̣̜͕̮̹͈͓̟͓̰̝̼̯͔͎̗͎͕̩͔͉̫̮͈̖̻̳̤̻̼̰̺̾̊̈͊̀̋̆̊̇̈̾̾̈́͒̊̒̈̽̔̌̈͒́͊͆̈̂̋̈̀͊̔̓̐̓́̔͋̂̅̅̐̈́̒̔̔̄͗͋͆̄̃̓̆̿̓̈́́͌̒̀̀̿͊̈́̀́̓̈́͆̈́̓̔͐̌̈́́͗̌̈͂̀͛̉̎̎̔͋͂̐͑́͛̏͂̾̂̃͐̅̒̔̅̃͆̾̆̈́̂͊̃̒̂͒̍̔͊̏̄͊̈́́̍͑͗̏̔͊̇̏͊͒̉̽̉͒͆̃́̈̈̿͆͆͆̌̒̀͛̈́̈́̐̑̿͒̀̒̾̀̉̓̐̄͗͒̅͂͊̿̀͂̈̍̉̌̋̐̄͆͆͛̈́̿͒̆͗͂͂̇̇̉͗̈̀́̒͊̃́̈́̍͐͌̐̈̅͑̓͆̒̎̏̉͛̃̇͌̉̋͂̆̊̒͊̉͐̈̂̑̿̿͊͗̍̂̽͗́͂̈́̊͌͌͐̾͐̒̿̈́͋͒͗̋͆̾̒̈́͆̿̄͊̕̕͘̕̚͘̕̕͘͘͘͘͘̚̚͜͝͝͝͝͝͝͝͝͠ͅͅͅı̸̧̧̨̧̧̨̡̧̧̨̡̢̡̨̧̧̨̧̢̨̧̢̢̡̛̹̣̯̺͈͚̻̫̱̦͉͎̞̬̥͚͍̫̫͖͈͕̮̹̱̭͎͕̼͉̱͍͍͔͇̻͉̜̣̥̦̤̦͇̞̼͙̬̳̫̺͖̯̹͚͎̦̺̮͎̝͓͇̝̗͉͉̭͚̻͕̞̩͔̻̘̬̥̱̙̥̗̫͇̞̹̖͉̯̭̞̤͈̟̪̘͉̞̼͎̞͎̝̹̥̞̳̗̬̟͚̝̜̺̤͈͓̖̫̥͙̻͍̼̰͙͕̺͇̬̗̙̣̥̦̱̩͈̟̝̖͈͙͎̥̪̼̳̰̩̲͇͈̪͓̫͇͎̲̗͖̫͓̣̪̝̠̰̼̼͕̣̪̝̬͍̘̦̟͉̦͈̥̻̗̹̬͈͚̺͉͔̹̤͈͕̫̱͈̘̟̱̗̱͑͆̓̃̒͊́̑͑̂̎̽͒̄͛̀̈́́̏̆̀̔̍̔̃͒́̓͆̈́̓̔͘̚̕̕̕̕͜͜͜͜͜͝͝͝͝ͅͅͅs̸̢̢̨̨̡̡̧̢̧̨̛̛̛̛̛̛̛̛̜̺̺͈̠̳̰͕̱̗͉͎͇͓͉͔͖̜̣͎̹̟͉̞̩̣̞̠̜̙͓̰̼͔̜̳̗̤̘͇̺̯͕̹̮̖̲̬̜̼̙͔̬͙̝͔͎͉̻͇͉̲̲͇͓̖̩͎̼͈͖͇̦̻̟̣̯͎̦̣̞̥̤̪̺̤̜̳͍̣͇̬͚̳̜͈̫͖̪̺̥͖̘̬͖̠̱͖̞͔̼͕͉͍̣̤̣̞̣̮̠͎̖̫̹̤̬̲͚͆̏͋̅̾̈́͋̓̎̒̑̓͛̓̑̾͛͑̈́̄͒̒͒̓͂͌̏͐̃͐̍̿̐̓͋̒̿͆̔͒̅͛̅́̈̾͒̅̈́̄̂̊̅̆̐̇͊́̀̍͆̉̏̈́̆̊̔́̊̑͗́̾̐͑̏̋͊͒̋͂́́͗͗̊̄̽͋͋͐͑͋̍̐͗̾̂̍̿̇̌̅́̀̃̐̎͂̾̈́̈́̇̓̎̄́̎̿̾̈́̀̎͛͋͋͒̽̀̒́̽͂̇͂͗̎̑̆̒̒̔̾͑̊̏̾̓̄́̈́́͗̈̓̾͑̓͑̎̏͑̀̎͑̑̀̒̊̍̌͐͊́̔͆̽̃̌̐͐͊̈́͗̈́̓́̇͑̐͆̄̄̓͒̈́̍̏͋̒̿̾͛̀̿͌́̈́͑̏͛̂̎̇͊̂̐͆̐̈́̓͗̂͛̑̅͑̎̆͋̏̒̓́̆̅͌̈́̽̊̑͂́̊̅͊̈̀̑̃̈́͘͘͘̚̚͘̚̚͘̚͘̕̕̕̕̚͜͜͜͜͝͝͠͝͠͝͝͝͠͝͝͝͠͝͠͝͠͝ͅͅͅı̴̡̢̡̧̡̢̡̨̨̧̡̧̧̡̧̡̨̨̧̢̢̧̨̡̨̛̜͚̣̣̠͎̳̬̤̯͕̤̦̪̮̥͉̩̻̲͍̻̘̩̖̖͈͈͓͍̰͎͖̞̹̲͖͙̥͍̖͖͖̙̱̣̘͔̘̗̜͖̦̥͔̖͈̼̣͍̟̩̞̜͔͔̝͍̺̤̻̻͚̪͎̼̝̟̖͖̠̞̤̘͕̮̟̠̰͎̖͉͔͓̦̮̗̼̪̹̬͖͇̹̺͈̥̰̬̠͚͇̹͓̰̼̪̫͔̘̗̦̠̭͔̪̼͍̩̬̱̬͇̘̬̹̝͓͙̥̦̝̳̹̮͚̣͈̗̪͇̟̺̲̜͙͙͇̬͎̺̫͎͕̱͎͚͖͉͈͔̠̟̼̳͔͚̭̤͍̥̰̼̗̺̖̲̮̜̮͕͚̘̘̗̲̼̣̞͙͉̭̠̲̱̜͍̻̯̦̮̞̱̬͇͖͇͔̣͚͓̦̖͕͓̙̹̗͙͓͌̅̎͊̈̒͊͋̔͗͗̓̈́̾͒͘̚͜͜͜͜͜ͅͅͅͅͅͅz̴̨̨̨̧̨̢̡̡̛̛̛̛̠͓̝̱̪̘̜͉̪̣͈͉͙̣̥̫̥̟̜̳̙͈̬̤̠͙̮̼̬̟̮̫̩͚̖͈̪̻̹͖̰͉̣̲̥͉̫̥̮̻̫͇̥̥̣̹̞̦̟̤̬̪̪̬͈̥̺͚͚̗͍͔̖̦̲͕͉̪̰̦̻͖̟͂̃͋̈́͑̊́͑̄͒͌̿̍͑̐̌̅́̒̉̈̊͒͑͐̉͋̄̐͐͐̊̐̓̒̓͋͆̀͛͐̓̏͋͛̆̍̀̔̆͒́̒̌̀̃͗̂̀͋͌͐̎͛̉͑̓̊͛̽̓̔̽̈̐͛͂̈̉̒̍̿̍̌͋̈́̌̈́̄̀̀̚̕̚͘͘͘̚̚̚̕̚͜͜͜͝͝͠͠͠͠͠͝͝͠͝͝͝͝͝ ̵̧̢̗̖̟̩̲̹̬̭̮̩̥̒̐̐̔͛̀̽̋̑͛̿̃̍͑̌́̊̊̈͂̊̅̈́̓͒̐͒͋̂̎̓͆͆̾̃̈́̈͒̎͆̀͆̈̊͌͑̈́̓̓͑̇̈́̆̎̀̔̊̃͋͐̔̓̋͂̎̎̄̿̆̄̂͗̅̐͊́͊̚̚̚̕̚̕͝͠͝͝ở̷̢̢̧̛̛̛͙̯̹̘̞̳̜͉̥͔͈͇͔͎̻̙̲̜̀̂͑͗̔̏́̋͆̽͆̌̀͗̑̓́̀̊̒̅̀̈́̋͛̌̌̆́͛͊͂͑͆̿͐̋̋̄̃͐͂̽̒̂̄̈́̒͒͗̀͌̉͌̂͊̓̃̚͘̚̚͜͝͝͠ͅl̵̡̧̨̧̡̧̢̨̡̢̧̢̧̡̨̛̜̪̻͎̣̜͎̙̖̗͔͈̟͓̰͔͖͍̟͇̭̱̝̲̘̹̞̺͎̖͇̼͙͍̟̣͍̦͎͇̞̥͍̭̥͓̳͎̹̲̹̭͓̝͚͉̖̥̭̹̱̟̩͖͇̱͔͎͉͍̭̘͙͇̳̥̲͙͎̩̰̺̘̫̣̜̣̲̫̫̻̪̻̮͕̮̳͙̲̺̟̘̖̪̬͎̗̗̼̟̮̟͈̤͓͓̟̩̫̺͔̱̞̭͚̭̥̟͕̮͙̙͈̱̟͐͋͊̋͂̽̀̃̍̿̉̐͛̌͂̾̅̔̔̇͊͐̎̈́̎̆̽͗̾͒͛̄̈́̂̾̏͋̌̾̉̒͌͐̆́͜͜͜͜͜͜͠͠͝͝ͅͅͅͅư̴̧̢̢̨̢̢̛̛̛͇͍̮͙̼̪̻̰̣̙͈͔͕̳̯̭͔͈̥̜̩̝̼̺̟͇̫͓̞̞͎̦̩͍͈̲̮̦̼͈̟̪̼͒̏̾͊̀̉͌̽͌̃̾̇̓̄̈́̌̊̍̈́͛͑̑̌͛̇̿̏̀̆͗̉̈̎̀͐̅̈́̏̍̃̿̈́̈́̇̏͆̌̉̒̇̄̐̏̂̆̑̎̒̄͛͐͌̓̑̔̓̓̋̎̆̊̃̉̿͑͗̆̀̄̑̔͌̉͋̿̐̈́͗̉̓͋͆̒̽̍̍̑͊̈́͂̇̓̽̓̏̍̋̒̎͋̊͋̂̇̈͑́̈͛̇̄͋̀̊̌̈́̌͋̾̇͌̈́̅́̐͌̐̈́̀̓͌̂̋̽̑́͂̌̑̌́̆̏͛̆͆͋̽̑̓̌̏̓͗̕͘͘̚̚͘͝͝͝͝͝͝͠͠͠͝͝ç̵̢̢̨̧̡̢̢̧̡̛̛̥̤͉̠̥̞̩̝̗̳͎̲̝̝͔̭̥̹̬̤͚̯͇͉̻̱̤͈͔̥̬̯̹̳̗̟̜̗͈̦̭̥̳̭͎͍͙̫̖͇̮͙̲͖̜͓̻̹̮͇̥͇̳͙̠͈̟̝̩̫͕̝͚̺̞͎͈̥͕̦̦̜̫͖̣͕̘͈̪̗̟̦̖̖̼͚̫̟͍̻͂̈́͆̃̽̑́̀͐̏̀͑̏̾͛̔͆͑̈́́̍́̇̃̎̇͗͐̂̇͌̍͊̓̐͐̏̉̈́́̉͋̌͒͒̈́̇̆̈́͂͛͌̊̀͐̑̉͋͊͗̀̒̂́͐̽́̋̊̾̑̋̋͆̈́̽̆̆̓̌̈͋̈͛̇́̂̄̄̽̃͒̆̓̊̓̈̐͌̕̚͘͘͘̚͜͜͜͠͝͝͝͝͠͝ͅa̷̧̨̡̧̧̧̧̨̡̧̨̢̡̨̛̛̹̤͉͕͇͕̬͎̩̫̝̠̩̹͖̳͚͓̤̗͕̙̪̼͈̗̻̖̥̣̯̹͈̟͔̦̰͉͉̫̱̦͉͉̱̖͓͓̟̫̯͔̟̤͚̮͓̖͉͕̻̞̩̞̦̲̼͕͈̝̲̩̬̟͇̣̩̦̯̩̤͈̮̙͇̖͚̘̤͍̟͚̯͓̬̖̖̼̝̮̣̖͖̲̫͉̙̩͍̬̞̻͈̮̹̩̮͚̰͙̼̥̺̺̜͕̯͇͍̦͈̯̟̝̯̬̜͍̩̟̩͖͍͔̻͇͚̤͚͔̖̺͔͈̖͚̘̝͎̱͈̠͇͙̖̙̲̪̮̱̬̖̘̠̪͚̺͔̭͚̬̞̦̝͕̗̼͓͔͇̯͈͕̭̪̞̞̹̞͓̘̼̠̮͉͕̩͖̫͖̯͔̦̰̼̖͔̭͊̔͌̔̑̈́͌͗̂͂̂́͛̍̍̑͋̾̌̀̀̈́̓́̓̃̀̃̿̿̂͆̀̒̈́̏͋̒̍̓̈̉̊͛̒͑̈́̅̿͑̋̈͆͐͌̃̉̋͑̎̅̏̍̒̑̽̏̑̓̉̽̂̓͌͒̏͗̅̍̎̒͌̿͛̎̿̃͛̈́̀̉̑̓̓̉̇͒͗͆͂̂͒̃̅̅̏́͗̌̇̿͌̑̓̿͐̐͂́̓͌͆̃̈́̂̄͑͊̍͋̽̈́̿̃͆̽̈́̍̀̔̿̌͘̚̕̚̚̕̚̕͘̕͘͘͘͜͜͜͜͝͝͝͠͝͝͠͠͝͠͝͝͠ͅͅͅͅͅk̸̨̧̛͚̭̯̜͛̃̎̉̎̂̓̃̾͂̿͂́͆̍̇̉̌̾͛̀͗̂̃̿̋́̾̽͌͗͒̆̑̈́͛͘̕͝͠͠͝ṡ̷̨̧̨̡̢̡̡̛̛͔̣̲͇̮͓̭̥͇̜̥͓͔͙̯̮͇͓̯̹͖̙͉̭̮̺̘̩͇̺̱͇̠̙̯͙̩͇͕̪̖̤̣̙̭͙̫͇̪̺̺̭͎̞̹̳̼̳͍͚̘̙̖͚͉̮̫̝̠̱̘̮̥͎͓̮̣̪̼́̍̉̀̀̐̑̀̈͛͗͗́̒̍̀͋̓̀̋̌͂̒̀̽̌̃͌̅͊̄̀̂̂̅̆̽̀̈͒̀͒̏̈́̑̍̑͆͋̃̐̏̒̅͒͒̓̈̅͋͒̔̆͑̈́̔̓͒̈̈́̆̓͊͊͋͑͌́͌̐̍̉̂̃̎̑̄̎̅̄̆͒̽̅͌̔̑̐͐̏͐̐́̑́͒͆̕̕̕͘͘̕̚̕͠͝͝͝͠͠͝͠͠͠͝͝͝ͅı̷̢̢͚̝̣͈̬̱͈̬̻͉̰̠̤̟̦̭̬̺̫̞̝͔̞̜͖͔̗̩͙̭̄̾̈̄̽̓̆͗̃͂̾̋̍̈̄̅͌̌́̿́͂̚͜͠͠ͅn̸̡̨̢̧̧̛̞̖͎͉̤̮̩͕̺̹͈̹̣̗̪̮͚͉̜͉̫̥̬̦̹͙̝̖̻͈̗̗̺̲͙̭̖̣̜̱̮̱͍̠͙̱̟̪̜̠̘̓͐̇̾̽̈̊́̔́̈́̓̊̐̔̽́̉͆͆̒̃́͐̔̎̆̽͆͂̋́̌̂̓̒͐̔̈́̀̐̂̊̍̌̾̉̀̆̓̃̿̌̎͊̓͂̓͂̑̓̂́̅̾̇̾̽̀̅̽̈̍̏̏̾̏̌͊̀̈́̈́̀̀̀͊͑͋͛̿̈́̇͆̓̿͗̂̇͛̄́́͛͗̋̀͗͊͌̑̈́̂̓̈̂͊̏̉̾̐̅͆͐̌͆͂̓́̄͂̊̾̉̈́͂̈́̐̉́̓͌́̓̐̌͛̒̒̌̒͋́̌̾́̏́͊̄̌̄̑̽̈́͒̑̉̓̓̂̐̾̾̈́̂̈́̾͗͐́̄͆́̂̓͂̿̋̍̿̇̏͐͊̂̾̆̈́̀̇͂̏̀́̍̔̒̉͌̓̀̑͗̓̽͒̀́͐͋̑̿͂̾͌͂́͗̐̎̌͑̿̽͐́̆̅̅̒̋̍͛͐͗̓̄̒̉̚̚̚͘̚̚̚͘̚͘͘͘͘̚̕͘̕̚̕̕̚͜͜͜͝͠͝͝͠͠͠͝͝͝͠͝͝͝͝͠",color=(138,43,226),center=(240,300),fontsize=20)
        elif mm1 == 5:
            screen.draw.text("ợ̶̧̧̢̡̧̧̧̡̨̡̛̣̲͇͉̦͇͕̫̦̮̻̞̠̻̫̜̘̰͖̱̯͈̟̘̰͈͔͉̖̥̖̲̟̘̼̪̩̞͕̠̲̪̱̣̠̰̤̝͚̮͚͔͙̝̪̹̹͚̪̣̳̥͔̬̦̭͉̻͎̝̥̘͇̮͉̟̲̘̠̟͓̜̠̞̱̠̥̫̫̩͚̘̝̩̻̠̺͚̔̍̽͒̽̈̑͗̇̓͑͑͛̋̀́̽̏̈̓̆̒̈͋͌̂͌͆̔͆̔̈́͂̏̊͗̐͋͆̄͐̀̒̉̀̒̌̍̀̄̑̃͌͋͌̅̏͒͋͊͆͐̒̉̿̽̄͆̆̓̃̅̂͆̒̇̽̃͂̾̆̃̈́̀̉̀̅͗̉̌̇̓̎͋̾͊̓̌͛̐͌͗̌̅̍̚̕̕̚̕͘̕̕͘͜͜͜͜͜͜͜͝͠͝ͅͅͅͅͅ ̸̨̢̨̡̡̧̡̡̨̨̧̢̢̢̧̧̢̡̧̧̧̡̡̢̨̧̛̛̛̛͍͚̲̖̳͉̮̩͖̩̰̞͙̯̘̱͓̮̩̱̘̱̟̯̖̮̙̟͖̦̹̤͕̠̞̮̖̩̳͕̦̣̳͕̟͔͖̲̻̙̮̖̩̹͕̖͎̗̗͕̮̹̯̗̘̻͈̬͔͙͉̙̱̻̗̮͙̘̟͚̙̟̣̝̞͈͍͖̰̦̘̮͎͖͎̺̮͙̬͇̜̜̰͉̘͍̻͚̗̥̖̬̰̤̼͖͚̬͉̜̟͉̫̮̼̦̭̫̥͖͎̩̜̩̭̫̳͉̮̗̮̼͖͔̘̬̳͎̰̘̖̣̦͓̞̲̼̻͙̖͖̗̠͈̪̞̼̫͖̟̦̱̮͙̬͙̟̪̪̩͙̩̣̗̗̺̞̞̺̲̠̺̞͕͈̠̼̜̾́͊̌̔͐͌̈̍̈́͐͋͑͒́̀͋̀̽͛͆͆̅̓̃̀̏͐͂͆̃̌̓̚̕͘̚͘͜͜͜͜͜͜͠͝͝͝ͅͅͅͅͅͅͅs̵̢̡̡̢̧̡̡̨̡̧̢̡̢̢̢̨̧̧̢̧̢̛̠̫̜̮̪͓̻̲̺̤̪̟͎̭̖̼̪̩̱̪̙̞͖̯͖̱̙̗̞̠̠͖̠͙̝̪̤̞̪̮̣͖̝̝͉͈̤͚̠̝̗̰̳̜̦̼̟̼͉͇̹̱͎̱̦̦͚̬̘͕̼̲̠͇̻͓̲͉̳̯̘̱̝̲͍̜̩͙͉͉̹͖̻͎͕͚̰̯̼̺̠̦̘̱͍̥̼̱͖̱̪͍̼̟̮̹̫̤̠͔̘̣͓̦͖̹͉͈̫͔̥͙̪̬̬̲̻̦͍̺̺̪͈̲̟̝̈́̂̑̆͐̂̆͊̏̀͆͐̓̅̔͌̍͗̓̓̓̍͊͆͂̓̈́̈́̌͐̀̋̉͌̒̄͛̆̊͑̔͑̋͊̿͛͐̊̈́͛̈́̄͒̒́̑̐̈͗͑̿̂͊̅̔̀̃̿͂̾̓̐̍̒̎͂̓͂̒̀̂͌̒̔̂̊͗̃͆͑̋͐͗̉̿͋̀͛͐̽́͑̾̊̄̀͊̄͆́̒͆̇̽́̏́̈̉̆̈́̌́̇̈́̇́̒̽͛͐̈́́̌̋̀̐̏̊̽͆̐̄̑͛̍̾̆̂͑̉́̃̀̌́̋͊͂̒̊̈̀̈́̄̿̓̍́̓̒́̑̂͆̅̀̀̎̑̓͂͌̈́̉͂̈́̾͂͊́̑͒̊̂̍̌͋̄̊̄̇͛̇̕͘͘̕̕̕̕̚̕̚̚̚̚͘͜͜͜͜͜͝͝͝͠͝͝͠͠͝ͅͅͅͅͅͅͅͅͅͅͅͅë̷̡̡̡̨̧̡̨̡̨̡̡̧̛̛̛̛̛͔̝̟̗̥̺͍̫͉͙̤̥̮͕̥͓̖͈̫̖͔̟̱̫̮̮̣͓͙̜̟̭͕̟̲̬̮͖͓͉̱̤̙̰̞̣̝͍͈͈͖̘͓̼̘͍͉̪̤̖̻̻̣̫͙̮̬̰͍̤͍͇̟͇͓̬̳͙͎̬͓̩̝̭̰̮̳͚̮̙̮̣͕̼̼̤͉͔͍̣́́́͌̃̇̉͊̂́̅̇̒͛̇̌̈́̏͗́͛̔͌͋̀̈̐́͛̐̋̌̈̀̈̿͆̀͋̒̓̌̉͗͒̈́́̍̋͒̏̈̿̐̈́̐̆̆̈́̈̿̈́͂͊̌̈́̽̒͆̾̿̎̓̉̍̾̓͗̂̈́́͌̈́̀̂̌̀̀̽͒́̈́̽̽̐̂̾̋̃̀́̉̎̀̔̋̔̑͑̍̇̅̾̐̅͊̂̉̈́͗̌̈̃̔͛̒͋̆̀̄̉̊̈̐͋̐̂̓̓̽͒̈́̿́́̒͋̓̊̃̂́̄͒̈́͆̔̍͒̑̊̔̏́̈̓̉͌̏̀̔̑͛͊̈̈́̓̾̅̂͌̆̒̇̇̈́̃̄͑̄̇͋͛̓́̉̌̉̉̐̏̀̎͗̾̋̉͘̚̚͘͘̕͘͘͘͘͘̚̚͘̚̚̚͘̕͜͜͜͜͝͝͝͠͠͠͠͝͝͝͝͝͝͠͝ͅͅͅn̸̨̨̧̢̧̧̢̢̢̨̨̨̢̢̡̨̡̢̢̡̨̡̨̡̢̨̨̛̛̛̛̛̛̛̛̛̛͈̻̥̪͇̹͖͍̭̼̩̙̝̭͖͈̥͉̜̪̙̪̦̫̭̺͇̞͙̝̮̼̮̮͚̩̝̖̖̺̩͖̫̳͚͇͈̖̦̺̻͇̙͉̳͖͈̬͖̟̙̟͖͔͓̖̱̼̯̱͓͈̖͚͉̞̫͇͇͖͓͈͚͇̣̥̦͎͕͖̝̜̘͎̼̦̪̤̟͙̬͎͚̼̻̜̰̫͉̙̩̟̺͚̩̹͈̻̺̟̣̱̟̗̭͇̬̭̫̦͍̣͙̤̯̭͖̹̥̩͍̲̖̟͍̯͇̘̭̯͙̞̗̝͙̩͇̜͇̭̘̣̠͇̰̻̼̳̫̯̠̭̬͙͕͚̖̖͎̹͓̞̠̭̪̯͍̫̘̝̬̜͙͉͖̦̘͚̫̤̣͙̬̫̳͚̹͕̤͈̻̭̳̰͚̤̹̖̰͙̗̜̭͙̠̗̤̟̬̩̠͉̠͙̤̮̙͔̝̯̪͎̪͖͎͇̻̱̮̲̪͍̘̈͂̅͆̈͊͗̊͆͑̆͆̏͂͌͊͌͆͐̈́̽̅̒͋̽̈́̌̉̊̓̇͑̍̂̈́͑̓̄̂͋̅̿͑͛͐̎́̌̊͑̆͑̂̉͋̒̽̿̎͊̓̈́͌̃̇͋́́͋͒́̊͑̊̀̈́̇̊̽̅̀́̿̓̾̈́̔̆͌̒́̈̀͒̓̈́̾̈́̇̈̇͊̑́͗̈͐̿̑̽̓̍̈̄̈́̅̾̅̂̀̉͊̊̅̈̉́̈́̈͛̉̄͂̿͒̔̏̍̏̎̆͑̽͊̅̅̎͐́̓́͛̍́̂̀̎̿̔́́̏̈́̂͑͗͆̑̈́̋̉̎̿́́̎͋̿̆̔͊̂̿̈́͊́̀̅̊̏̀̀̑̀͗̈̽̐̍̈́͂̆̽̓͂̈́͐͌̅̏͑̃͘̕͘̕͘̕͘͘͘̕͘͘̚͘͘͘̚͘͘̕̕̕͜͜͜͜͜͜͜͜͜͝͝͝͠͠͠͝͠͝͠͝͝͝͝͝͝͝͝͠͝ͅͅͅͅͅi̴̢̢̨̧̢̨̢̡̨̧̡̨̧̡̢̧̡̢̧̧̡̢̢̡̡̢̛̛̼̱̖̙͖̼̖͉̥͇̞̥̱̩̘̞̪̞̣͓͉̤͍̫̺̳̻̗̗͈̲͈̪͈̟͇͍͚̺͚͇̖̬͔͎͎͔̭̬̬̥̩̘̺͙͇̦̲͙͚͈̠̙͈̱̜̪̪͓̯͍̺̥̥̲̦͇̮̗̗̠̱̤̲̻̯͚͖̻̻͉̱̞͔͖̲̩̺̣̣͙̥̰̲̼̺͕̜̥̘̭̳͓̪͉͔͚̲̖͕͖̜̗̯̪̥͍̫̜̥͓̦̥̗̦̘͓̙̗̥̞͕̖̺̝͍͍̥͖͚͙͔̤̺̻̠̻͉̺̗̯͙̼̭̟̬̘̫̠̦̲̯̼̠̭̩̞̪̩͈̲̲̼̞͖͔̱̜̣͈̲̰̮̫̘͍͙̮͎̹̫͓͕͚̬̱̙͙̝͔̩̯̖̼͎͇̳͚͔̠̞̭̥͙̫̪̗͛̓́͑̐̐̈́̊̋̓̑̋͂̅̍͋̐̔̀͌͌̾̍̀͒͊̈́̀̍̿̎̈͛̈͗́̔̑̈́̓̉͂͂̾͋̆̈́̓̇̐̏͂̈́̆͌̽́̑́̏̒͗͒̌͒̅̈̈́͂͋̅͋͒͌͊̌͋̓͌̀͊̓͆̒̊̈́͒̎̀͌̍̐͌́̎̏́͒̾̾̈́̕͘̚̕͘̕̕̕͜͜͜͜͜͜͜͝͝͝͠͝͝ͅͅͅͅͅ ̶̡̢̡̨̢̡̧̢̨̧̢̡̢̨̢̨̧̧̧̡̢̢̨̡̧̧̛̛̛̛̰͎̖̥̗̹͔͔̞̯͚͍͙̹̮͙̘͍̜̫̳̠̪̠͓̹̮̫̥̯̣̹̹̗̺̮̦̩̻͔̱̠̘͍͖̲̻̺̮̰̺̺̻̱͎̞̘͕̹̮͇̗̣̯̦̮̱̳͙̰̰̱̩̼͚͓̣̜͚͇̺̖̫̻̮̲͉̟͉̳̭͈̖̟̙̫͕̜͕͔͇͇̥͙͉̠͇̞̖̩̬͓̱͇͙̘͎̞̥̙͇̜̱̼̪̮̝̫̬͖̳̖̭̱̜͕͔͉̞̞͓͎͉̣̖̼̭̩̫̬̰̘̞̭̹̮̬̘̣̹̳̝̲̮̼̖͍͈͓͕̻̰̪̟̻̳̣̙̳̟̲͇̯̹̳̦̰͇̞̜̮̻̟̬͕̻̫̹̺͓̲͔͚̤͈̬͚̘̳̤͙̳̼̯̮̱͖̩̫͙͚̝̟͖͔̯͔̪͔̫͈̗̙͍̱͙̱̮͈̰̼͚̜͚̝̠̲̎́͐̊̏̔́̈͑͑̆̅̋͌̐͂̂̊͋́̍́͆͗̿́̔̈͐͛̓͑̍͐̇̏͋̽͒͆̈́͑̀͋͂̌̾̿͒͑̉̒͑̌̈́́̆͐̋̊͊͂̇̍͐̅͛͆̍̈́͒̓̿͋̉̆̃̓̌̋̈́͒͒̋̂͋̑͌͒̃͐̈́̊̇͂̍̍̈́̋̔͌̄̎͊̄̓͛̊͋̎́͒̈́̅̽̓̐͊̑̈́̄̏̑̓͋̆̓̂̎̎̑̏̓̒͗̎̇͒͂́͒̑͌͌͆͑̂̉̑̉̒̽̓́͊̉̎͊̀̑̊̿͆͌̍̋̃̌͑͐̃̄͐͛͒̍̌̄͒͗͌̃̽̀̃̃̀̀̽̾̏͌̈̓̋͂͗͛͑̎̋̑́͆͐̑̅͂̽̂̅͋̑͆̐̾͂̋́̀̾̌̈́̕̕͘̕̕͘͘̕̕̚̚̚͘͜͜͜͜͜͜͜͜͜͜͝͠͠͝͝͝͝͝͝͝͠͝͝ͅͅͅͅͅͅͅͅb̸̧̡̛̛̛̛̛̝͙͇̬̪̝̦̲͈̱͔͓̈̓̊͆͑̐͂̑̉͛͗͆̃̀̊̽̋̅̿͐͊̋͒̅̈́͑̇́͛̈́͊́͋̈̓̎́̌̄͗̉̍͗̾͛̂͊̃̑̉͊̔̃́̉̈̐͑͑̈́͗̏͗̆͐̓̽̎̔͊̀̓̏̓͒́̔̑͒̍͛̑̅̒̽͐̌͊̓̓̓̀͛͛͌̀͂̆͐͛͑͑̍̌̊̽͑́̓͒̄̽̇̈̈́͌͊͋͂̀̅̅̄̒̄͂̿͗͊́̌̎͗͊̔͊̈̐̊̌̄͗̀̈́̇͂̀̃͌̋̓͒̓͑̉̀̈̔̓̀̈́̄̎̍͆͋͗̂́̄̇̀̈́̂̃̇̑̒̀̀̽̈́̇͑̀̀͐̀̔̔͐͌̄̂̿̑̌͐̏̇͗̿̀͐̂̍̂̄̋̏͑̋̆͑̍́̽̑̈́̒͋̀̋͋͗̅͗͋̑̂́̌̆̈͌̕̕̕̚̕̕͘̚͘̕̕̚͘̚̚͝͝͝͠͝͠͝͠͝͠͠͠͝͠͠͠͝͠͝͝͠͝͝͝ȩ̵̡̡̡̡̨̢̨̧̨̢̧̧̧̡̢̧̛̛̛̛̛̛̛̛̛̛̛̫̖͔̝̞̲͔̠̹̫̣̗̰̞̙̩̙͕̯̻͈͉͕͕̭̬͕̤̟̮̪̝͈̠̩̙̤̮̪̟̠̼̮̘͇͈͚̫̮̙̪͓͓͍̹̯̦̯̼͕̞͔͔̲̗͇̮̗̟̝͕̼̠̩̠͔͉͚̫̻͉͇̪̞͕͔̩̠̰͙̯̠͎͈̮͙̹̩͙͈̘̱͚̜͕̝͈̗͕̙̜̥̼̺͇͉̫͉̱̼̻͍͚̣̗̤̮̠͕͈̣͙̹̣̯̬͓̦̗͕̩͕̦̹͔̖̘͈͕̼̱͕̖̫͚͚̪̹͚͙̯͙̞̟̘͙̺͔̦̥̼͈̩̙̮̞͎̟̭̮̞̥̰̻̠̦̝̳̻̠̳̙̣̹͍̣̩̪̬̯͈͙̯̼͖͚̙͎̠̱̲̽̐͑̈́̎̇͛͒̈́͆̅͐̉̓́͒̒͌̌̇̃̓̇̓̌́̏̊̋̍̄̃̉̓̇͐́͗̊̅̃͒̓͂͆̄̄͌̽̅̋͛̎̋̌̍̊̂̓̉͒̑̌̔͋̄̾͆̉̃̎̌̈́̎̎̉͒̋͋̈́̽͊͌̀̐̉̒̉̃͑̾̃̀̏́̇̀͆͆̿̈́̑͛̉̎̃͗͌̀̒̎̽̌̉̆̀̓̔͗̉̋̄̀͗̎̐̀̋͋̌͑͆̈́̎̎̂̂͛̽̌͆͛̃́͌̀̋͑̊́́̈̈́̀̽͂̈́̊͒̓͂͑̇͋̅̋̈̋̄̓̑̾̐̉̊̅͘̚̕̚͘̕̕͘͘̕͘̚̚͘̚͜͜͜͜͝͝͝͝͝͠͝͝͝͝͠͠͠͠͝ͅͅͅͅͅͅͅǩ̷̢̨̢̦̜̟̬͕̪̳̙̰̲͔̣̦̘͔̹͎̦̙̜͓͖̞̭̦͖̱̱̖̳͔̱̠̯͌͂͒̀̀̔͂̉͒͌́̍͂̽̍̃̚ļ̶̡̧̡̛̛̛͇̱̙̞̗̜̺͈̥̪͎͎̤͈̖͕̲̤̬̺͖͈͚͇̥̜̪̤͚̪̞͙̼̠̘̭̠̙̺͉̻̺̹͍̙̘͈̥̜̰̰͓̱͔͕̬̤͇͓̪̪̋͑̈́̂͋̅̏͆́̔̉͛̀̌́͗͒̍̉͛̾́͑̋̏̉͛̎̈͌̌̏́̾̿͑̈́̀̌̅́̀̀̈́̾̒̃̐̎͌͐̿̿͊̄̐́͌̿͋͂̀̈͂̈́̈́̎͑̓̈́͒́̔͆̽̂͒̆́̅̓̓̏́̓͊̒̈́͋͒̾̀͐͒̽̏̉̿̋͗͌̇͊͆̐̒̀̓̏̀͒̅͌̓̿̈̀̎͆́͊͛̈́̓͂̏̄̓̇̓̊̈́̇̐̀̂̏̓̅̐̿͛̿̍̊͂̔̅̿̏̈́̈́̐̑̍̔̄̅̕̕͘̕̕͘̕̚͘̕̚͜͜͝͝͝͝͝͝͝͝͝͝͝͝͝͝͝͝ͅͅͅi̶̧̧̢̛̛̛̛̛̛̙͙̘̞̳̙̲̭͇̭̞̯͈̳̜̰̼̞̫̟̤͇̱͉͈̮̯͉͙̩̩̙̲̬̺̲̟̤̯̯̼̪̞͈̳͇̦̝͕̺̪͛͌̓̿̓͒̌̏̇̾͗͊̽̔̓̅̄̉̀̊̾̉̉̄̓̍̈́͒͋̍͆̒͌̓̑͒̒̅̈̓͆̃̀͊̉̆͑͑͗͗͋̋̌̌͆́͆̑̈͋̔̿̈́̀̋̓̓̉̉̌̈́͛͊̀̏̍͋̌̉̏̎̾̆̏̐̈́̆̓̄̓̅̌͊͌̀̀̊̐̍̅̈́̉̂̓͘͘͘͘̚̚͜͝͝͝͠͝͝͝͝͝͝͠ͅͅͅy̶̨̧̢̡̡̡̨̢̡̡̧̡̨̮̤͉̰̗̦̦̤̺͈̠̮̭̬̥̝̫͍̖̫͓̜̜̟̙͔͓͖͎͈̪̗̳̱͕̬͕̫̱͇̦͉̬̮͙͔̯̳͕̩̙̯͖̜̤͙̙͓̼̭͙̲̱̻̘͇̻̤͇̰͕͖̼͍̠͉̟͈̳͉͎͕͔̺͉͚̼͖̱͇̣̭̣͕̤̣̹̗̲̙͎͇͇̣̬̗̲̣̲̱̩̗̺͎͖̭̟̖̦͓̦͔̗͖̪̭͍̮̮͔͇̬̥͖̝̻͕̲͉̝̹̬͎̝̭̜͙̗̥͚͔̺̬̩̳̣͚͎͙̹̜̭̻͕̓̈́̉̓̈̏͜͜͜͝ͅͅͅͅͅͅͅͅͅǫ̷̢̧̨̧̧̨̨̨̨̨̧̢̢̨̡̹̰͎̻̳͕̗̙̟̹̰̯̻̮͕̝̲͈̯̠̯͉̪̺̗̪̣̰͓̺̬͖͈͓̪̟̜͓̝͍̩͖̗͍͎͓͓̫͖͍̭̬̫̺̻͖͔̣͎̱̺̝̣̝͚̹̥̘̠̲͖̮̰͓̳̦̣͙̞̳̫̱̮̦͈͎̩̜̹̞͔͎̫̯͉̫̩̠̳̙̣̰͚̗͎͕͇̥̰̙͚̜͎̩̺̜͈̭͈͚̭̭̣̳͇̲̹̫̖͓͚̫̠͕̯̫̝̜̮̻͔͇̙̠̲͈͖̟͍̝͕̖̜̙̤̹̞̝̠̦̖̞̮̝͇́̊̀̀̀̔͊̄̀̋̾͊͛̋̄̚̕͜͜͝͝ͅͅͅͅŗ̴̨̡̧̨̧̨̧̨̢̧̨̧̧̨̢̡̨̛̘̻̪̱̭̦̯̱̪͙̘̤̩͓̹̺̞̬̼̙̭̜͖͔̖͍͖͎̙̖̬̭̜̣̜̘̞̣͖̙͉̻͉͓͇̣̬̻͉͔̝̙͈̙̝̼̜͍̖̠̰̯͈͎̩̼̪̤͍̩̟̮̥̰͇͍̰͚̞̞̯̯̥͕͇̰̞̦̤͓̞̟̫̗̝̝͇̙͚͙͕̼̫͓̯͓̙͙̞̹̖̳͎̬̯̣̟̺͉͉̦͚͙̘͖̜̯̭̫̘̥͕̣̙̪͔͇͍͎̦̱͎̩͖̺̗̭̬̜͓̭͚̟̞̭̞̬̬̗̲̼͕̟͖̦̟̹͖̲̉̆̽͐̎͛́̃͂͗̈́͆̓̏̍̂̌̄̀̈́̀̓̇͂̀̉͗͐͛̓͑͆̃̋̎̍̉͋̃͗̾͜͜͜͝͝͝ͅͅͅͅͅͅͅ",color=(178,34,34),center=(120,310),fontsize=20)
        elif mm1 == 6:
            screen.draw.text("k̴̨̢̧̨̢̧̢̧̨̡̡̡̧̡̨̨̢̨̧̡̧̡̨̢̢̛̛̛̟̪̱͍̝͍̖̱̪̖̤̻̯͚̖̩̼̣̺̞̗̙̫̺̺̮̦̣͔̮̦̥͎͍͉̻̝̞̫̜̟̼̥̤͉͍͔̳̥̳͔̥͈͍̙̗̗̩͖̞͈̟̼͈̪̰̳̝̘̳̺̮̖̜͍̞̝̱͚̗̬͈̤̲͔͍͕̞̮̱̖̗̦͖͇͍̹̲̞̞͓̬̗̗̺͓̹̩̙̯̗̺̜̗̠̙͖̻͙̤̳͖̮̭̟̳̤͖̩̫͕̪͙̫̞̣̮̝̩͚̟̤̻͓̣̟̗̣̹̜̞̟̤͔̹̺̦̗͙̳͈͍̪̞̠̬̺̪̟͉̞̠̺̂̄̀̒͐̓͒͊͑̀̽̈́̀̔̌̌͐̓͋̾͊̃̽̋̿̔̂̀̓̒̋̓͛͛̎̋̇͐͌̈́͆̽̓͐̅̊̀́̔̃̔̀̀͑̊̉̅̍̾̋̇̎͌͂̂͑̽̄́̉̈́͊̆̀̓̈́̇͂̿̎͗͊͊̈́̍́̃̆̈̀̓̓̔́̿̈́̆̍͗̅͑̇́͋̉͛͐͊̽̓̈̿̀̽̋͋̅̈̉́̽̓̒̕͘̕̚̚̕̚͘͘̚͘͜͜͜͠͠͝ͅͅͅͅͅͅö̴̧̢̧̧̢̢̧̨̢̡̨̢̧̨̲̳͍͉̟͔̟̹̠̖͔͚̗̹̜͕͈͓͙̲̻̬̻͈̦̗̜͇̮̺͖͚̬̞̺̹͕̤͖̺̜̱̦̹͉̺͚̭͎̲̤̦̝̟͍̬̱̖̲̲͔͕̝̩̝͔̥̩̯͚̣̭̘̤̰͖̯̱̝̪̯̘̲̠̻̭̪̟̪͉̮͙̟̺̘̟͇͙̭͉̜̱̞̖͔̣̙͓̱̣͖͙̖̰̥̫̖̤̦̗̘̥̙̦̩̖̰̲̭͔͙̼̩̣͎͕̭̳̯̹̲͔̜̮̬͕̖̟͉̭̞͉̱̗̼͇̔͑̆͑̾̂̀̀̆̋̔̓͛̍̃̀͋͌͊͋̎̽͌̑͌̓̇̿͊̋͐̆͆͐̉͂̄̑̓̊͌͛̓͂̈́̈́̏͊́̑̿̄̎̿̈̓̒̃̌͑̑̇́̌́͌̕̕͘͜͜͜͜͠͝͠ͅͅͅͅṟ̶̡̧̡̡̧̡̧̢̢̧̡̢̧̡̢̡̨̢̢̨̛̛̛̛̛̛̬̪̦̱͇̩͉͚̹̥̱̱̮̬̞̻̼̲̰͇̪͍̥͎̲̣͙̖̱͔̯̗̲̤̣̗̖͔͚̠͔̠̖̞̜̼͕̪̭̤̖̖̬̺̲̯̤̘͎̮̪͎̜̙̳̩̭̫̤̣̱̗̬͇̲̮̮͈̭͙̙̥͔̦̗͔̠̱̭͉͎̼̰͙̞̹͍̺͎̘̦͓̘̙̰̰͉͚̤͚͓͉̫͍͇̲̤̺̠͉̭̲̥̞̪̥̰͓͈̠̦̳͍͇̼̭͖̫̻̜͕͙̟̖̭̗̣͎͈̟̪̦̰̙͖͇͉̩̫̣̰͍̠̫͇̟̥̱͖̩͕̦͔͉͔̰̠̩͇͇͉̿̌̓́̍̂̉̔̅͊̈́̍̅̾̎̈́͊͒̓̑̃̑͛̋̽̎̋̋̈́̂͋̀̓̒̀̈́̌̅̎͂͆͋̅̀͆̏́͗͌͋̔̈̅̊̊́̅̽͗̉̀̽͑̑͒̉͋̿͒͂͌̈́͂̊͒̂̿͌̑̎͗̓́̊͐͑̇͗̓̾̋͊̈̿̒̒̌̋̽͒̃̂̂́̂͐̓̐͑̍̄̃̿̐̇̔̐́̓̓͂̆͐͒̄̆̐͒̃̏͋̽̀̇̈́́̉̀̒͋͐̍̾̏͋̈́̄̑̽̄́́̀̓͐̓̇͐̅̀͛̉͆̐̆̑͑̏͂̃̂̅̐̽́̔̈́̕̕̕̕̚͘͘̚͜͜͜͜͜͝͝͝͝͝͝͝͝͝͝͝͠͝͝͝ͅͅͅͅͅk̸̢̨̧̡̡̢̨̡̡̛̛̛̞̦̯̰͉̩̜̼̖̙͎̙̫̣̭̳̱͍̟͔̥̬̮̻͔̦̠̪̮̼͖̝̳̣̭͍͕̭̼̯̲͎̮̜̠̝̥̤͇̰̫̞͚͓̺͙̯̠͉̳̬̣̻̦̦̣͍̈́̈́̓́͛͋̓͌͛͂̆͆͗̉̽̍̉̓̇͛̂́͌̔͛̊̌͐̂̄͋͒́́́̃͂̎̅̇̈́̋̀͒̈́̾̀͌̈̅̈́̎̓̇̓̈̽̌͛̈́͒͊̀̃͂͐͋̽̈́͗̽̓͗͒̾͛̏̔̉̀͒̐̀̊͑̒͂͋̀͗̈́͌̃͆̓̎̓̋̋̍̑͐͂̿̔̈́̍͋́̽̀̀̈̐̎̓͒͛͐̆̐̐̽̌̈́̄̑͗͂̋̽̌̐̽̆̕͘͘͘̚̕͘͜͜͝͠͝͝͝͝͝͝͠͝͝͝ͅm̵̢̳̲̞̪̠̠̠̹̰̱͌͆̄̊̋̔̉̀͒̾͛̀̎́͗͆͒͌̈̀͑͆̀̄͋̈́̊̈́̈̈́̌͌͑̿͒̅̊̓̌̊̿̀̈̆̿́͛̀͒͑̈́͗̑̊͗̅̈͌̈́̚͘͘̕̕͘͝͝͝͝ư̵̢̨̧̢̧̡̢̡̧̨̧̡̧̧̧̛̟̳̮͙͙͈̘̩̗̬̲̩̦̮̞̬͉̰̥̠̱̲̮͈̳̖̩͉͎͇̠͎̳͔̺̲̜̖̲͓̹̩͚̠̹̲̺̩̭͖̘̗̭̤̯̰͇̺̙̳̬̱̘̠̼̞͕̥͙̯̭͉̖̘̲̥̰̬̺̮̬̩̦̟̺̙̳̹͇̙͕̦̫̝̥̳̘̫͇̺̱͙̫̠̟͎̗͚̯̬̙͍̺͚̩͚̙̫̼͈̥̣̙̫͉̤̜̽͆͒̎̊̒̅̐̅͒̒̀͗͊̍́̒͆̔͌̄͛̀͊̀́̊̿́̎͛̀̄͗̄̍͐̈́͋́͊͘̚͘̚͘͘̕͜͜͜͜͜͝͠ͅş̵̢̢̡̧̨̧̨̧̨̡̢̨̧̨̡̛̛̛̛̬͔͚̟̜͚͙͇̦͔̞̗̹͍̹̟͚̳̯̝͔̳̫̗͈͙̙͚̞̣̖̦̫̤̞̝͚̮͈̗̤̠̝̘̹͈͕̘̘̞̣͕͚̯̲͍͍͇̟͇̥̪̮̞̻̯̺͓͖̻̰̦̝̟͕̪̦̩͖̦̯̜̱̪͈͈͍͕̮̗̬͎̝̩̖̥̙̗̙̟̪̬͎̝̗͔̲̼̖̥̥̹̫̬̠̟͕̙̭̣̫͎̝̖͚̙̺̖͚̟͓͈͔͙̹̼̝̼͈͓̘̳̯̤̫͇̮͚̰͉̥̝̙͊̾̈̐̈̌̑̓̾̀̉̀̄̃͆̈̅̉͂̃͌̒̈́͗̇̇̈̓͂͊̀̿̔͋̆̒̐̎͌͂͗̓̅͂͂͑̏͂̂̅̀̀̈̉͆̂̓̐̾̑̒͛̊̆̓̓̏͒̃̍̃̈́̈́̄͛͆̾́̊͆̈́̊̀͆͐̓̑̎̓̔̓̍͆͗̈́̓͆͂̌̆́́̒̊̆̍̌̏̀͋͒̅̾̈́̔͒̉̀̋͂̋̑̃̏͌̉̐̎̉́̿̓̎̃̈́̌̈̾̄̇͑͊̆̈̊͊̈́́͆͘̚̚͘̚̕̕̚̚͘̚̚͘͜͜͜͜͜͠͝͝͠͠͝͝͝͠͠͝͝ͅͅ ̴̡̨̨̨̨̧̨̢̨̡̢̨̨̡̡̨̢̡̡̧̧̧̨̡̛̛̛̛̙͖͖̖͉̙͈͓͍̼̰̪̪͓̞̖̣̫̱̬͚͓̣͍̹̦̪̙̯͇̼͔͓̣͙̻̹̤͙̯̼̦̦̱͖̣̦̤̫͍͉̯̜͓͚͕̘͍̰̮̬̜̞̙̟̙̪̟̱̫͙͕̳̠͖̭͖͇̦̯͇͖͎̦̗̼͈̬̦͚̩͙͉̣͔̞̯̹̟͕̖͈͍͖̺̖̖͍̭͍̯͈̯̰̹͙̻͇̞̫̞̼͙̺̣̰͚̱͈͓͇̗̦̘͙͎̭͓̰͓̦̞̘͎͓͙͈͚̙̻̝͓͔͖̬͓̼̘̖̝̗̪̜̺͙̥̻͉̠̟̩̰̭̝͍̥̬̮̙̗̹͉̬̯̪̩̦͇̗͉̟̼̳̤̖̘̘̦̥̦͓̥̦̠̦͖͚̘̩͚̖̟͉̩̤̻̯͚͔̱̻̞̯̳̫͈̻͙͚̭̰̥͎͙̠̱̱̘̰̦̖̘̦̘͔̼̔̉̃̀̀́̅̈́̑́̒̈́́͒̒͒̅͋͋̐̑̈́̏͒͆̄͐̓͌͊̄̆̃͂́̀͂̍̀́̅̌̚͜͜͜͜͜͜͜͜͝͝͝͝͠ͅͅͅͅͅg̷̢̡̢̢̡̨̨̡̨̧̡̨̨̢̬̭̘̣͓̥̟͇͈̹̜̯͈̝͎͈̪̯̭̥̙̜̦̖̜͉̙̲̺͔̲̫͙̞̯̣̩̠̙͙̯̝̣̦͙̩͙̯̘͔̠̺̪͓̥̳͔̬̮̜̭̖̪̠̠͎̮͍̭̹̼̣͚͉̩̗̼̝̯̠̘̤̟̘̭̳̭̙̩̼̗̰͙͓͔̥̭͔̹̣̺̘͈̗̩̱̼̭̘͕̝̺̤̗̝͎̪͍̬͚̫͉͎̘̰̬̰͈̦͇͇͍̪͖̤͕̭̖̘̫͕̫̥̤̬̩̝̺̭̳̩͕̣͉͉̞̤̹͚̫͚̺̜̻̫͕̠̫͔͈̝͎͉͈̮̻̲͚͔̯̤̗͍͇̺̳̘̫͍̲̗̠̜̪̟̲̞̭͕̜̜͓͙̣͓̼͚̩͍̤͈̣͓̙̰͈̜͇̬̮̏̾̊́̓͆̄̈́́̂̊̈̊̉͛̕̕̚͜͜͜͜͜͜͜͜͜͝ͅͅͅͅͅͅǫ̶̢̢̡̡̨̡̢̡̢̧̡̢̡̨̨̛̛̛̛̛̣̱̹͉̖̦͖̭͈̤̩̠̥̠̪͈̤̩̜̹͔̰͙̘͍͚̰̖̪͚͖͚̗̻̻̥̠̺̮͖̣͈͔͕̗̩̯̞̮̝̻̼̟̩̻̹̠̭̻͕̰̩͖̝̬͔͙̤̤̞̼͇̞̩̦̲͙͇͉̹͈̼̩̰̞̬͈͓͙̟͍͉͈̯̦͚̯̼͓̬̣̪̝̱͚̣̲͙̥͓̲̙̰̭̘̪̝̈̾̽͆͛͋̐̒͌͒͊̀̓̍̅͆̑͛͌̀̋͆̃̍̇̂͐̐̈́̀̈́̎̇̓̓̂̌̓̉̌̀͛̍́̒̍̌̑̍́̇̂̽̋̐̅̿̆̋̉̆͆͂̾͌͊͌́̐̑̆̐͆͐̈́̄͐̔͛̿͋̑̊̓̓̾̄̊̔̔̋͐̔̐̈́̀̽̂̆͒̐͛̃̈̾̈́̍̈́̚̚͘̚̕̚̕̕͝͠͠͝͝͠ͅͅͅř̷̢̢̡̡̨̧̨̨̨̛̛̛̛̛͈̤̼̠͉̪̙̦̫̦̬̤̺̬̹̳̺̖̩̼̺̱͉͎͍̫̯̝̲̜̝̝͚̪̣̠̫̰̥͍̱̹̰̲̻͓̟̲̱̼͕̪̤̼͍̹̝̟͚̝͕͖̱̯͎̣̙̦͛̏̓̃̊̐͂͊̏̋́̀̊͌̀̎̾͒͋͛͋̏͂͐̐̋̃̂̓̅̃͛̇̋͊̑͛̅̆̍́͗͊͌̇̏̾̉͗͑̆͗̎͗͐͐͋̆̽̌́̂̎͆̃̇̑̉͑̀͛̀͋́̋͑̇͛̂̍̑̽͊̌́̑̍̐͊̂́̓̿̑̇̇̍͛̇̃̓̔̾̔͒̆̍̾̀͆̍͗̄́̾̎͊̔̐̂̆̔͛̋́̈́͗̄́̏̒͊̂͒̎̒͌̔̈̌͊͛͗͒́̽̅͆̔̉̇̂̍͌̄̉̐͒̄̓̊̿̈̊͌̀̒̓̉̑̔́̃̊̑̉̄̔̄̏͆̕͘̚̕͘͘͘͘̕̕̚̚͘̕̚̚͠͠͝͝͠͠͠͝͝ͅͅư̷̧̛̛̠̩͔̳̲͎͉͔͚̝̭͈͓̯̰̼̦̝̦͎̫̞̝̺͙̯̙̈̎̋͑̇͌̈͌̏̉͗͌͑͛̈́̎̀͗̈́̿̆̈́̒̅̓̃́̏̐̄̆́̏̈́́̔̉̔͛̇̽̈́͌̓̿̔̒̑̀̾̌̈͐̊́͋̃̽̄̊̋͑̑͆̐̐͛̋̋́̽̔̏͑̈́̌͂́͘̕̚͘͝͠͠͠͝͝͠͝n̸̡̡̢̧̧̡̧̧̡̨̨̡̧̨̨̢̧̛̛̫̣͇̟̱̳̹̦̞̺͉̙̣͎͚̞̯͚̯̰͚͇͓̤̝̟͙͍̯̪̝͓̗͚̜̟̰̦͍̼͇̯̹̟̭͓͍͇͙̜̰̼͓̱̜͓̱̩̜̯͉̱̖͍͕̲͖̩̬͓͔͚̳̗͚̻̗͖̲̪̬͈͍̼̪̦͚̦͎̞̹̰̪̺͚̩̟̼̳̼̟̬̮͚͓̺͎̗̘̟̠̭͔̭̜͕̞̖̫̹͓̭̺̼͇̗͇̼̼͍̭̟̙̫͇̥̫̜̞̝͍͕̱͇̜̼̺͈͙̪̬̞̱̺̜̐͐̓̈̒̀̆̄͊̈́̿́̅̾̏͆̈́̾̓̏̅̾͛̆̈́̋͛̍̈́̆̏̓̈́̈́̓̍͂̾͊̈́̽̏̈́͐͗͂͒̍̆͆̑̐́̒́͑͑̄̿̓̒̓̾̇̈̌̌̃͌̈́̉̎͊̈́͐̅̊̐̑̏̀̾͆͛͐́͐̉̑̀̌͂̉̅́͌́̀̏̿̂̃̕̚͘͘͘͘͜͜͜͜͠͝͠͠ͅͅͅư̴̧̢̡̨̧̡̛̭͍̙̫̰̖̠̙̜̭͓͕̫̙͙̲̙̭̹̤̞̼̖̩̣̯̮̺̲̺̳͔̜̲̗͚̞̰̹͉̯̹͓̱̠̬͇̰̠̟͕͕̮̗͇̈̒͗͛̈́̽̍͒͛̈͛̈̆̈́̌̾̓̀͑͊̓̈̌̔͂͌̀̍͐̇̈́̄̈́͒̈́͆͌̋̒̊̆̔̈͂͐̓͗̀̓̾̾̃̏̾̾̿̈́̂̅̈́̈́̇͛̅̅̈̄͛͋̈́͋̅̇̈́́̾͗͒̅̿́̎͗̓̏̀́͋́̿̓̇̓̿̈̈́͂͗̄͗̆̒͒̿̌͌̃͌̈́͐͊͛̈́̈͛͒́̇̋̓̅̈̑̾̿̎̌̑̈́̀̓̄̈́̑̔̾̓̔͌̅͑̃̇͆͂̒̂̉̾́̊͐̌͆̚͘̕̚͘̕̕͘͜͜͠͝͝͝͝͝͝͠͝ͅͅŷ̴̡̡̧̨̨̡̡̧̲͔̯͈͔̯͓̮̥͈͎͕̤̪͉͖̹̻͈̱̪̤̲͇̜̺̝̪̯̜̬͕̦͔̭̻̖̲̪̭̙̜̬̲͍͚̣͙͕̞̮͇̹̞̰͚̘̞͙͍̘̘͇͚͍͉̖̗̰̜̫̯̙͎̹̣̝̣͎͍͉̤͕̊̊̊̂̇̋̔́͂̉͆̑͌͑͑͛͐͘ǫ̸̢̧̧̧̧̡̧̡̡̧̡̢̧̨̡̨̨̢̨̡̧̡̧̡̛̩͔͍̯̼̯̱͈̝̮̜̝̭̰̣͔͍͎͚̻͈̹̬͖͙̳̝͔̜͍͎̦̦̤͓͉̘̘͉̘͓͉̙̖̣̝̗̪͙̫̱̗̠̹̣̰͈̮̻̥͈̫̮͚͔̫̪̫̳̹̹̩̜͔͓͖̳̳̪͉͚̯̟͇̼̖͈͖̣̠̫̤̣͎̩͈̫̥͎̣̳͙̙͔͔̲̗͎͓͎̤͉̹̳̼̪͚͔̱̬̦͉͔̫͔̫̱̮̼̝̤̻̖̫̘͕̦̜̦̥͈̰̱̦̫͓̞̖̝͓̳͎̤̩̞̙̲̬̙̱̪͓̤͇̫͓̻̞͕̦͇̣̪̥̼͍̳̟͕͖̺͈̤̲̜̲̞̗̥̼̱̟̮͇̦̠̖̯̬̙̦͚̱̞̮͎̜͍̙̜͓̞̠̞̼̖̟̟̗̪̥̱͉̥͕̥̼̘̼̻̪͍̟̙̱̝̱͉̱̺̤̫̮̠̻̬̭̟͎̈̊̉̈̀̿͊͛̇͂͂̅̄̇͗̓́̌̃͐̆̈́͋͒̓͂̿̄̎͗̅̉́́̈̈͗͐́̔̋͒̃͊́̏͊̈́̂̌̄͋͆̅̎̅͂́́̈͒̂̅͋̎̆̈̒̑̈̿̎̿͊͂̇̌̊̂́̂̉͆̋́̅̒̀̒̿̋͗͑̒̍̌͐̾̍͐̆̋͒͂͂̓͐̎́͂̐̌̔̍̉͌̾̇̈́̋̃́̈́̈́̔́̿̈́̾́͂̐̕̕͘͘͘͘̕͘̕͘͘͜͜͜͜͜͜͠͝͝͝͠͠͝͝͠͠͝͝͝ͅͅͅͅͅͅş̸̨̨̢̨̡̢̧̡̧̢̨̢̧̡̧̡̧̢̛̛̟̭̥͚͉̲̠̝̭͚̲̻̱̙̤̝͍̠͎̱̺͔̗̝̯̺̝͙͖̪̻͓̥̮̳̳͎͖͉͈͇͓̼̤̲̪̙͓̩̖̲̥̠̩̫̬̲͈͚̜͇͕̳͎̫̺͙͚̗͉̤͔̮̖̠̰̠̺͚͔̬̼̦̩̤̹͈̙̗̠̞̹͕̟̬͓͕̜͙̙̹͍͙̝͍͖̖̝̗̜̙͎̞̞̬̫͉̋̉̍́̓̈́̒̈͊̈͑̀́͋͛̂̑̑̈̑̿͋̊̈́̏̆̆̀͌͊͊͒̔̎̅͋̉̑̌̍͗̃͑͌̀̾̀̓̑̑̐̾̊̋͊͑́͒̍͒̇͒̏͊́̀̑̉̾̎̎̿̓̂̐͛̀̑̎̋̀͒͆͗̔̓̍͌͌͐̆͘͘͘̚̚̚͘͜͜͜͜͝͝͝͠͝͝͠͝͠͝͠͝͝ų̵̡̨̨̡̡̨̢̛̛̼̘̱̱͇̬͍͎̟̖͔͇̖̜͎̞͎̝͔̣̺̪̠̻͎͚̣͉̬̲͓̪̩̜̹̜̯͇̰̥͎̤̮̪̺̲̻̼͍̟̦͖͕̘̥̗̳̱͍̻̜̺̣̺̲̜̱͍͙͎͈̲̜̤̝̠̱̭̮͓͖̰͓̘̫̺̺̜̻̦͈̼͓̻̱̰̈́͌͂̎̈́̔͆̔̀͐̂͌͒̏̀̄̽͑͋̆̊͐̋̌̈́̄͒̓͌͑̂̿͌͆̉̃͒̄̊͛͆͊̐̉̀́̂̈́̄͂̋̓͌̿̑͐̀̅̃̓̄̈́̈́͘͜͜͜͜͜͝͝͠͝ͅͅņ̷̨̧̧̡͎͍̗͉̟̟̱͚̻͉͙̪͎̠̬̬͎͎̰͇̘̼͙͍͎̦̲̙͔̗̼͖̦̞͉̩̣̮̩͐̊̓͜͜͝ͅͅ",color=(128,0,0),center=(320,300),fontsize=20)
        elif mm1 == 7:
            screen.draw.text("b̴̢̢̨̧̧̜̖̫͙͎͓̤̖͚̜̮̖̻͓͉̩͚͔̳̼͕̤̹͚̜͔̼͎̤͙̝̳̼͇̤̰̭̟̹̗̗͕̙̻̗̲͍͉̈́̑̇̿͌̒̂̐̃̅͋̌̔̑͐̾̽͐͑͗̀̄̅̿̈́̅̔͆̀̋̀̄̒͛͊̂̂̆͐̓̇̽́̄͑̈́͘̕̚͝͝͠͝͝ͅư̵̧̡̢̢̛̛̛̛̛̝̱̫̥͙̠͕̘̞̼̞̰̬̱̺͚͈̥̙̙̣̘̘̙͉̟͈͍̳̙̱̘̗̫̙̩̙̙͉̱̮̎́͋̓͂̀͆͒̒͛̆̒̿͆͌͋̒͋͌̽̆͒̍̈́̇͐̃̄̈͒͊̐̇̂̔̀͒̇̍̆̓̆̂͐̓̎̓͂̅̓͛͋̈́̂͛̃́̄̈́̿̓̌̆̈́̃̀̓̍͊̈́͋̃͑̓͗͂́́̿͒͊̒̀̏̾̏̑́͐̂̾̾̾͐͒̈́̋͗̉̀͛͛̾̐̽́́̐̓͑͐̍̐̏͛̎͋͂̐̄́́͋̅͌́̈́̾̽͐̀̔́̈́͑͒̄̽͛̇̒͗̌͑̎̉̍̐̀͆̆͆͐̋̇̐̄̈̽̎̔̔̑̂̍̀̈͛̄́̇̽̃̃̔̐̔̒̀͗̓̋̀̑̅͐̅͂͛̍̌̽́̈́̉̈́͊́̍̒̏̉̐̉͂̿͋͗̑̆̈̕͘͘̚̕̕͘̕̚͘̚̕͘͘̕̕͝͠͠͝͝͠͝͝͠͝͝͠͝͠͝͝͠ͅr̶̨̡̧̨̧̡̡̨̡̨̡̧̧̧̢̨̧̨̡̡̧̡̡̧̧̨̧̧̧̨̡̡͎̹͙̖͈̳̮͓͓͕͓̝̦̫̠̝̗̭̙͕͖̘̺̻̼͉̙̱̱̪͉̤̼̱̖͎͈̩̳̺̼̝̙̙̟̟̘̟̖̗̯̭̟̙̗̥̖̫͇̪͍̙̹̗͕̤̹͇͚̹̯̼̳͓̰͉͚̫͈̼̙̥͉̯̳͙̠̹͈̥̜̝̞̝̺̟̺̙̲̥͚̙̤̖̝̩̣̟̫̣̫̪̮̟̖͍̞͍̝͚̗͈̙̼̟͙̟̞̬͕̫̹̺̦͓̙͎̘͔͇̬̣̺̝̖̖͈̬͓̺̙̯̲͎̖̙̺̤̲̗̠̗̳̱̺͔͔̩͔̰̺̤̹͉̪̳̪̪̼̭͎͕͎̱̞̼̞̜̮͍͔͉͙̹̫̥̯̩̣͖̩̩͍̪͖͙͔̱͉̰̻͓̬͓͕͓̠̯̫̫̗͈̱̻̟͚̼͎̪̲͈̣̠̣̱̖̥̗̤͎̗̱̠̪̣͕͇̤͔͍͖͎͆̏̉͊͗̏̍̚͜͜͜͜͜͜͜͜͜ͅͅͅͅͅͅͅd̷̢̨̧̨̡̢̧̨̧̢̨̢̡̧̢̨̡̡̢̛̛̛͚̰̘̣̲̰͇̖͙̝̩͇̼̱̜̳̰͈̯̜̲̺̟̮͙̟͚̥̖͓͉̗̘͈͎̲̰̮̥̜̲͇̭̜̞̮̫̰͕̮͙̠̻̦̤͖̮̭̥̮͔̼̙̰̞͙̞͔̝̺̩̠̥̣̙̖̲̱̦̣̦̟͇̪̗̙͖̜̝͙̻̺̬̪͉̘͎̻͎͕̤̣̘̣̞̞͚̳͚͔̯͉̩͕̼̜͙̤̝̺̗͓̞̳̼̫̭̠͔̙̭̮̮̜̗̥̳̻͇̯̦̥̘̘̱̦͎̖̟͈̤̝͖̦̮̙̼̙͉̥͍̤̥͔̼̞̮̺̬̠̹̣̦͎͎̠̬̙̭̬͙͉̟̭̤̰̫̹̼̙̱̲̼̪̦̹̩̹̩̮̝̖͉̯͙̥̪͍̐̎̈́̔̈́̈́̓͛͂͌͛̂̃̿͐̔̄͊́̋̌̍̒̔̈́͐̂͑̓͌̈́̿̀͗̃̈́͑̀̑̉̄̽̆̓̊͐͊͊̾̊̿̓͑̕̚͘͜͜͜͜͜͜͠͝͠͠ͅͅͅͅã̵̝̘̻̋̎̽̇̽͂̇͗̐̄͊̐̅͌̇́͒̆̾̾͆̉̒̎̃̊̓̂̚͘͘͝͝ ̷̧̡̨̢̢̨̡̡̡̢̡̡̧̧̡̡̧̨̨̧͎̣̮̹̝̲͈̱̖͍̜͎̣̖̗̙̰̞͕̯̟̰͓̝͇̤͉̞̦̱̖͉͇͍̠̬̖̼̮̪̬̟͈̲͎͍̩̲̮̖̤̻̞̭̥̞̞̦͓̯͚̳͔̮̲̘̝̰̤͓̠͇̙̭̮̮̤̫̞͇̙̯͙͔̞̠̻̮̥͓͔̙̫̱̱̳͙̰̭̣̫͓̥͎͙̤̤̞̳̪͓̣͙̳̝̙̼̰̜̪̰͖̝̲̲̤͕̙͙̦̙͕̝̻̤̗̝̮̙̳͙͓̻̦̥̜͓̺͕̪͈̤̰͇̪̤͙͇̻̭̬͚̯̗͙̘̺̩̣̯̥̩̱͖͙̠͚̹̩̱̖͔̝͈͍͖̰̻̞̻̗̮̺̼͓͍̠͖̬̤̮̺̭͕̘̘͎̣̰̪̬̱̫̥̝̝͓͔̗͈͈̥͉̘͓̲̫̳͖͓̹̥̱̙̳̠̯̱̯̟̹̩͔͕̲͔̼̰̣͎͍̣͈̯̖̟̙̙͉̗͕͇̰͇̏̈̒͆́̆̋͋̈́́͗̉͊̈́̆̈́̂̄̾̎͂̃͗́̑͑̊̅̒͆̾͛͌͌̿͛͛̊̓̾́̓͒̑̂́̊͛̍͒͘͘̕̕͜͝ͅͅͅí̵̡̡̡̨̨̢̢̡̡̡̡̛̛̛̛̛̛͚̭͇͈̱̱͎̬͔̙̠͔̝̙̞͎̼͔͚̟͚̩̲̩͙̺̬͖͉̳̖̣͕͉̙͚̩̞̥͈̦̞͍̰̜̯̱̮͍̪̙̯͚̖̭͈̳̝̣̤̺̜͖̝̯̮̹̼͚̲͖̯̻̻̠̪̥̭̦̯̼͉̲͍͓͎̫̘͖̅̾͂̆͐͛͐̀̍̆͌̀͊̐́̀̀̒̐͋̈́̎̀͋͐́͌͌͛̀̆͌̿̿̽̿̈́̅̄̊̈́̿̄̿̎̏̋̔̑̂̃̐̌̍̂́̇̿̾̐́̿̈́̀̏̐̑̑̅̀́̃̎͂̎͗̈̌͛̃͊̆̍̋̓̓̿̈́̈́́̒͂̊̽̈́̑̓͌̉̏̓̄̇͊̽̀̅̈́̒̿̒͂̈́̓̈́̓̇́̆͌̑̍̾͒̈́̇̓̄̓̃̆͒̍̊́̿̂̓͌̐͑̓͐̏̑̃̋̌̉͘̕̕̕͘͘͜͜͜͝͠͝͝͝͝͠͠͠ͅͅͅs̷̢̧̨̨̡̨̢̨̡̨̧̧̢̡̨̨̡̢̧̢̧̡̡̧̧̡̧̡̨̡̧̛̛̛̛̛̛̛̛̛͓̭̻͔̗̳͙͖̠̯̜̥͔͖̳̲͍͙͎̜̠͈͇̜̖͙̬̳͇̭̱̙̺͙̼̹̪̮̬̹̱̹̫̙̺̱̲̝̫͕̪͕̳̱̞̳͕̦̖̞̳̩͇͍̖̲̮͓͖͖̠̲̭̫̜̺̼̣͎̺̯̞͕̜̠͔̣̮̺͚̮̻̜̳̤̱͇͇̥̫̳̰͓̟̟͚̲̼̺̜͈̤̟̯̲͙̞̗̜̪͖̻̮̫͙͉̭̰̣̺̦̲̠̙͓̠̩͇̼͓͉̠̫̖̮̗̪̙̯̣͈͕̮̜͍̝͇̖̪̳͔͙̱̙̠̘̞̼̺̫̬̲͈̲̞̘͉̺̠̞̹̤̤̫̫͓̻̖̳̯͇̣̰̙̳̯̝̙̟̤̪̳̝̭̺̩͚͚͇̥̘̰̮̥̻̦͍̻̺͉̞̪̻̮͇̱̟̝̻͉̜͓̪͚̺̥͕͎͖̩͍̆̓̀́̔̇̀̓̈̓͗̽̌̋̉͐̎̀͂̆͗̿͂͐̈́͊͌̔̎̀̑͆̄̈̇̄͂͐̐̇̈́̑̑̾̒̈̾̏̽̈́̔̀͒͑̂̃́̈̄̄̽͛͆̎̎̈́̽̋̒̈́̈́̈́̉̉̾̈́̂̑̈́̂͑̿̅̑̿̊̈́̿̑̑̎͋̊̀̐́͗̎͆́̃͑́̾̓͆̈́̏̿͗͑̋̍̓̃͗̉̈́̊̾̆̇̌̐͌͂̊̈́́̀̈́̎̎̍̆̋̎͋͊́̑͋̎́̂̈́̊̍͒̽̓̒͌̎̐̓̐̇̇̆͑̿̀̈́́͗̈́̾̎̔͛͐̒̂͊͒̇̎̇͑̔̉͑̽͒̑͊͌̒̾͑̉̃̂͗̐̔͋̋̀́̄̔̍̇̀̋̒̾̆͐͒̌͑̄̐̓̄͑͊̐̽̒̑̾̐͊͛́̃̂̂̿͋̈́̕̕̕̚͘͘̚̚̕͘̕̚̚͘̚͘̚͘͘͘͘̚͘͜͜͜͜͜͜͜͜͝͝͝͝͠͝͠͠͝͝͝͝͝͝͝ͅͅͅͅͅͅͅͅͅͅt̴̨̢̨̡̢̧̡̨̨̢̢̧̧̧̡̢̢̨̛̛̛̛̳̣̺͕̹̦͖̟̣̺̯͇̝̪̙͖͓̫̘͖͓͈̲͉̭̼̲̻̤̞̣͎̠̳̰̞͕͎̤͖̲̮̤̜͍͎̯͕̳͙̪͕̲̜̖͙̣̝͔͓̮̠͖̯̻͚̜̣̪̣͚͓̺̩̳͓͔͉͎̺͔̼͓͓͖̥̮̞͔̝̻̱͈̪̭̩͇͍̟̮͚̜̙̭͎̦̞̭̲̯̲̜̖̟͍̥̖͎̘̠̘͖͕̯͖̰̰͍͈̫̫̞̯̰̞̱͕̗̤̝͎̣̬͎̭̠̭̭̟̣̭̤̦͖͈̹͓̪̯͈̙̲̩̭͖̼̙͂̈́́́̎̋͐̀̅̿̆́͆̓́͂́̓̉̌̐̉̈̃̎̈͛͌̍̿͛̃̊̄̀̓̈́̋́͒͊̽̈́͗̎̒̇̔̆́̋́̒̅̈́͋͋̈̐͗̍͌̆̾́́͐̓͊́̀͌̆͌̅̆̾̓̓̒͊̈́̆̋͂͂̐̓̓̂̔̈́̂͌́̆̐̑̂͒̋̂̔̔̆̍̆͑̓̍͆́̓̄̈́̈́͛͗̉̔͑̆͌̌͌͌͗͐̅͗̌̑̊̊̈́̉̀̇͊̃̈̀̈̿̔̍͒͗̈́̄̿̿̂̆̎̈́̇̒̅̋̈̋̀̈͌̾̈́̑̈́̌̈́̇̈́̚̕̚͘͘͘̕̕̚̕͜͜͜͜͝͝͝͝͝͝͠͝͝ͅͅͅͅḛ̸̢̨̢̧̧̢̡̧̢̨̨̡̢̨̢̡̧̨̢̢̢̧̧̡̡̢̰̦̲͕̖̣̫̥̟̹̹͖͕͓͉̲̖̘̘͖̝̟̜̲̘͖͚̩̱̝̲͈̝͔͓̮̲̮̝̙̗͓̬̩͖͇̤̲̻͉̩̖̯̮͉̥̙̟̠͓͉̘͙̬̬͈̬͔͚͚̫͔̳̦̩̫̰͚̗̦̬͖̝̰̲͉͇̝͇̦̯͈͍̹͓̹̤͔͖͙̪͍͍̝̲͍͙̪͇̥̩̲̤̳̻͓̝̮̫̥̝̲͓̼̤͓̰͚̫̤̬̳̯̙̺̬̫̞̖̦͈̰̘͈̳͚̟͓̫̖̲̻̦̩̖̭̺͈̯̪̟͔̠̣̩̭͉̩̟̤̤̖͖̘̗̞̩͇̤̯̻͈̬̘͍͎̰͊͑̇̈́̃̐̈́̌̈́̎̇̉̓̂̎̅͊͌̑̀̓̃͐̈̏̆͋̈́̍͜͜͜͜͜͜͜͜͜͜͝͠͝͝ͅͅͅͅͅͅņ̷̢̨̧̡̨̡̢̢̡̢̢̢̢̨̛̛̛̛̛̛̛̛̛̹͖͈̗̺̰̟̯̫̣͕̲̳̹͖͇͚̖̲̬̟̺̠̥̝͓̘̻̬͚̫̱̠̬̙͙̠̺̫̰͚͎͉͉͙̩̟̘̖̖̺̝͉̱̼͉͈̮̗̪̝̰̺͈̥̻̖͙̙̘̮̝͕͎̥͕̯͓͔̼͈̻̩̳̗̫̩͎̝̼̱͍͓̝͙͔̜͎̲̰̟͔̘̩̼̥̺͙̘͕̱͚̘̻͔̘̟̯͚̯̠̭̘̝̗̳͚̣͈̠̲̣̟̳̫̮̼͓͖̠͇̲̥̣̘̰̖̪̻̦͖̺̳̟͚̬͓̺̩̩̪̀̈́̉͊̿̒͛͂͗̍͛̊͂̎̉̆͆̔̐́̿̑̽́̃̄̄̐̈́͒͌̉͑̏̿̈́͑͗͒̎̌̓̉̄̔͑̿̉̄͛͑͛̀̈͊̎̐͐̒̾̾̉͐͛̅̈̊̓̀́͋̔͋̿̍̈́͊̽͗̋͊͊̔̀͗͒͛̊͛̈́̑͊̈́͛͛̊͒̔̉̇̌̾̓͐̀̈́̀̃̔̃̆̈̀͋̌̋̈́̔͗̇̈́̂̇̆̾̀̀̽̆̊̒͒̃̓͐̃͆̅̓̿̂̂̓͊̍̀͌̑̀̈́̑̾͛̈́̌̇̒̈́̒̅̀̐̉̆̓̎̓̂̆̈́̉͐̆͒̌̌́̓̒̄̉̅͒̽̇̐͂̔́̚̚̚͘̕̕̕̚͘͘̚͘̚̚͜͜͜͜͜͝͝͝͠͝͝͝͝͠ͅͅͅͅͅm̴̨̢̢̡̧̡̨̢̡̛̠̗̠͎̥̟̬̥̝̳̦̥̳̦̯̘͎͎̩̭̣̬̗̗̣͖̭͖͍̘̹̗̫̦̺̫̬̦̩͓͇̦̜̮̝͚̥̰͇̟͓̰̳̫̩̱͎͉͖̲͇̪̖̜̫̱̥̰̬͇͈̞͓͙̯̳͖̝̺̻̥̥̟͕̹̦̬͓̣̰̦͙̗̣͔͚̝̤̹̟̻͈̟̭̥͕̜̥̩̺͂̀̿͛̾̀̑͐̽̈́͛͋͆̄͛̍̇̓̃̅̽̊̃̈́̿́͛̅̊̃̃̌̌̓̂̆͂̑̍̔̑̒̿̄̐̿́̋̈́̈́͊͆̑̓̅͆͂͒́̉̒̊̽̿̏̔̉̍̈̋̒̇̄͒͆̓̍͌̍͆̊̓́̿̇͆͐̀̾̋͆́̏̉̌̏͛̃͊̈̑͐̓̂̆̈́̈̈́̉͂̀̑̇̾̌̈̐̍̒̉̇̇̏̐͌̓́̓͊̎̔͑̇̊͑̌̀͛̓͗͆̑̿͗́͛̅̏̔̿͊̂̋̈́̉̒͘̕͘̕̚͘͘̕̕̕̚̚̚̚͜͜͜͠͝͠͠͠͠͝͝͠ͅͅͅͅͅī̶̢̧̢̧̢̨̡̢̧̢̡̨̢̨̨̢̡̡̡̧̨̡̡̛̛̛̛̛̛̛͉̰͇̗̖̙͕̠̥̳̬̪͈̜̞̱̤͓̱͚̠͉͔̹̜͈̤͙̰̙̤̩̩͎̺̥̫̩̩̺͓̟͔͉̜̮̦̻͉̬̪̳͖̮̱̘̮̹̥̰̲̙̳͔̮̲̲̦̯̩͓̗͖̺͇̲̤͖̼͚̹͕̫͍̖̜͕̭͎͚̫̞̣͈̗̜̮͔͖̬̘̰͔̪̼̝̗̗̬̻͓̥̦͖͉̖̝̪̥͚̟̘̣̦̯͚̻͍̦̖͔̗͕̬̣̯̬͓̣͍͓̙͚̞͈͓͉͕͉͙̲͈̰͈̲̖͙͎͍̺͍͚̙̼̘̣͇͔̲̭̜̱̼͎͚̰͉̙̮̝̺̟̩̰̠̯͔̰͓̲̱̞̳̤̹͎̻̭͎̰̮̲̭̞̜̟̱͙̼̘̻̩̭̺̦̭̤̦̦̖͓̤̭̣̦̣͙̤̝͍̓̃̑̔̌̇̆̎̿̓͐̄̊̈̇͛̒̏̿̃́̿̀̐̿͐̈̅̓̀́͐̽͛̅̈͒̌̋̃͂̐́̾͑̍͐̔̊͑̂̔͗̓̾̎͑̊͂̈́́̈́̈́̅̀͌̉̈́̍͛́͌̎̇͋̂͋̋͐͗̅̊̈̽̈́̀̌̑͒́̄̏͛͗̇̃̀̂̿̃̂́́̒̋̂̄̄̃̐͐͐̔̊͆́̓̐͊̆̏́͊͐̑̈̊̉̉̈́͋̔̿̏̌̿͆̽͊̂̉̂̍̋̽̇̓͆͋̏̃̇̈́̽̽̈̂̋͗̃̾̂̃̔̽̒̑͑͐̈́͋̃̽͗͐̾̋̽͗̄̂̏̈́͂͗̽̐̅̇̓̒̋̆̃̈́̓̐͂̌̀̀̍̇̇̊̑͛̇̄͐̋̾͋̿̓̂̈́̾̈́͛̾̎͆̂̓̄̈̇̃͗̂̏̈́̏͘̚̕͘͘͘̕̕̚͘͘͘̕̚͘̚̕̚̚͘͜͜͜͜͜͜͜͝͝͝͠͠͠͝͝͝͝͝͝͝͠͝͠͝͠͝͠͝͝͝͝ͅͅͅͅͅŷ̴̧̢͉̘͉̱̥̗̹̦̝̼̠̻̲͙͓̝̗͕͚͖͙̹̪̤͈̰̝̞͖̪͖̘͎̤̯̠̘̞̯̗̮͙̦̹̻͍̘͙͖̣̫̲̝̹͙̺͓̳͎̠͔͍̫̦͎̭̪̩̬̼̭̖͍̂̃͋͗̏̅̀̍̊̉͜͠ͅͅo̵̧̨̢̢̧̢̢̢̡̡̨̡̢̢̡̢̧̨̢̨̧̧̧̢̨̡̠̙̰̝̳̫̦̱̯̘̳̣̠̲̩̝̩̪̼̲̥̟͉̮̮̜̤͚͎̳̫͔̹̯͍̳̳̻̫͕̩͕̣̞̼͓̪͔̝͈͔̤͔̜͖͓̲͉̙͕̲̥̗͙̼̟̱̞̹̝̗̦̩̺͉͍̻̙͕̯̺̬̜̻̝͚̱͇̰̰͓̣̣̰̻̖͕͕͇͇̣̳̮̺̪̜͇̼̮̟̞͍̟͎̹̙̞̜͕̫͓̝̹̯̣̼̜͔̦̟͈̝̣͍̘͎̝͚͇͍͔̝̭̪̭̫̥̫̞̯̖͎̳̤̬͈͓͕̣̳̪̥͓̱͕̝̻̲̰̮̩̠̖͕̞̱͙̲̞̲̯̤̖̠̠̮̘͍̪͇̥̣̱̝̹͍̰̙̺̘̥̩̮̗̮͕̩̲̯̘̲͓͈̦̯̭̤͚̮͈̱̙̩̤̣̻̲̦͕̪̝̝̫͙̫͕͈͙͎͉̹̰͒̓̓́̋̒̓̐̃͐̐̑̈̅̈̒̍̋̆͒̈̄̊̉͛̉̔̎̂͑̿̑̒̇̐̋̀̌̊̃́̔̈́̓̓̋͊͗̀̑̽̑͗̂̔͒̕͜͜͜͜͝͝͠͠͝ͅͅͅͅͅͅͅͅs̵̢̨̨̢̧̨̢̨̡̨̛̱̪̩̙̬̭̰̣̞̗̻͈͍̦̩͔̫͎̪̜͖̞̙̤̖̯͉̝̦͓͔̻͇̘̮̪̹̭͔̝̫̻̥͙̼̗͓̼͔̮̩͙͈̼͙͓͙̟͉̼̜̳̯͖̰̜̲̖̼̜̯̖̬̗̬̲̫̠̘͎̗̲̻̱͙̗͈̫̫͕̎̋̓̆͛̃̐̆̎̏̒͆̄͒̍̅̔͂͂̽̾̍̂̓͗͂̀̋̑̿̍̿̇̓̊͆̒̈́̏̂̽͛̄̏̈́͑̉̾̔͌̏̊̍͗̂̀̆̒̃̄́͒̂̓̂̈̋̆̀̑̿̎̍͂͛͑͂̏̂͂͐̋̏͋̐̌́͛̆̓͊̀̃̐̑̎͒̓̃̽͗̓̽͂̆̈́̐̔́̾̍͛̂̃̊̾̋̍̅̔͒̑̔͒͒̉̂̆͆͐̓͐͑̂͒̈́̌̔̒͌̀̎͂̔͛̓̾͗̽̑͂̎̆͒̀͛̆͑̈́̍̆̾̒͒̎̐͌̇͂̔̒̃̃̈̎̍̿̌̿̊̓̒͐̋͗̅͗͐̇͌̈́̒̏̈́͂̆̉̍̎͒̓̅̌̈̅͛͌̓̇̎͗̿͗͊̈́̽́̇͂̄̌̓͆̄͆̀̕̚͘͘͘̕̚̕̚̕̚͘͜͜͜͜͜͠͠͠͠͝͝͝͝͝͝͝͝͠ͅͅͅͅų̴̧̢̡̧̢̢̧̧̧̢̢̢̡̢̛̗̯̞̗̳̜͙̯̩̻̖̰̬̙̰̮̮̦̦̗̻̠̞̟̟͖̟͕̹̠̬͈̖̹̭̼͇͈͍̠͔͙̫̼̹͚͇͉͕͇̩͙̗̯̟͉̳̭̬͔̭͔͇̬̻̼̺̗̝̟̤͓̣̹̗̞̬̘̪̞̰̥͔͖̬̜̮̪̖̤̙͎͍̗̭̫̮̻̘̞̠͔̱͔̩͕̦̻͕̰̖̙͍̼͚͖̲̰̻͇͇̩͖̓̑̈͋̽̄͒̾̾̌̒̆̎̔͌͂̐͌̽́͊̒͆̀́̀́̓̒̊̾̒͋̇̋̂̍͗̀̒̓̇̾͐͆̊́̽́̀̚͘͜͜͜͜͝͝͠͝ͅͅͅͅn̶̡̧̧̢̡̡̨̢̢̧̨̢̨̨̧̢̡̨̢̧̢̧̨̡̲͓̹̺̙̜̬͇̩̣̗̜̻̩̝͈̳͖͚̯͔̫̬͔̪̺̤͓̪̝̝̖̱͉̟̫̟̹̰͕̠̗̟̭̩͙̗̥̝͓̥̻̫̭̞͈͚̤̦̳̮̟͙͍͍̙̠̦͉̠̞̯͓͓̠̯͔̠̟̣͙̜̜̫͎͖͎̹͕̬̯̱̰̘͇͙͈̱̙̠͔͇̱̥̯͖͕͚̘̙͍̱̦̱̰̲̮̰̘̘̣͖̣̝̟̜̪̰̫͙̻͓̬̝̗̯̰̹̝̩̭̬̖͉͖̞̬̟̼͍͖̣̗͙̼̭̟͇͕̥̭̬͓̙̣͉̈́̓̏̃̐͌͗̍̔͑͊̒̂̀͌͛̾͊̓͆̈̄͌́̋͋̈͛́̄̌̆̈́̇̑̾͊̆̏̃̏̓̐̅̉̌̑̈́̓̒̈̈́̐͐́̑́̑̚̕͘̕͜͜͜͜͜͠͝͝͝ͅͅͅ",color=(139,0,139),center=(370,370),fontsize=20)
        elif mm1 == 8:
            screen.draw.text("b̶̨̧̨̨̢̧̧̡̧̡̢̛̼̘̩̞̬̭̪̻͖̪̲̼̦̘̤͈̦͈̪̮͖̺̳͇̲͈̟̱͕̠̗̥̳̻̟̝͍̻͍͇̪͕̦̝̤͚͙̪̱̳̱͓͚̭̟̠̟̺̫̠̖̰͇͖̼̘̫̱̻̤̲͇̻͕̭̗̣̦͖̝̳͎̤͖̜̺͔̭̭̠͍͔̹̘̮̝̠̖͖͉̮̼̱͇̬̭̠͉̤̞̞̳͕̼̦͙͓̜̣̗̱͓̱̥̤͕̜̱̩̱̟̘̫̪͙̭̣̺̝̺͔̘͉̱͎̟̬͚̟̜̘͎̗̗̜̹͍̦̙̝͊̐̄̒̃̈́̔̀͌̍̓̈̃͐͋͑̄̑͒̿̓͆̋͒͒͆́̉̿̐́͌̀̋͛́̇͋̐̾̿̄̄̾̾̋̓̓̔͗͐̔͌̿́̔͌̈́̏̈́̈́́̉̀̆͗̀̆͗̂̅̓̏͊͛͋̉̈̂̐̽̀̇́̆́͌̔̏̍̋͂̈́̎̂͗̊̓́̈́̈̿͆̏̋̃̀̽̉̒́̾̉́̂̊̓̏̉̍̾͛̿̏͌̾̾̏́̀͗̒͆͐̏́͋̓͆̅͘͘̕͘̚̚̚͘̕̕̚͘̕͜͜͜͜͠͝͝͝͝͠͠͝͝͝͝ͅͅͅͅͅi̸̢̡̨̨̡̧̨̡̨̨̧̧̢̪̱͍̯͍̙̝̠̗͕̺̙̭̟̫̻͕̰̜͎̳̖̝̖̰̱͚͍̠͈̳͓̻̲͙̙̬̹̣̤̝̜̭̻̘͔̣̬͖͓̟̣̠͇̮̱͚͉̺̥͚̺̦̥͓͓͓̖̞̣̪̳͍̼̭̺̪̮͚̻͍̘͎̥̟̣̩̜̹̠͓͚͓̹̥͓̤̣̠̝̞̻̼̙͖̦̬̞͎̺̦͓̹͖̯̠̻̘̰̠̮̙̟̻̞̪͔͉͉͈̖̭͚͉̘͚͔̺̹̬̖͈̬̻̠͈̗͖̖̔̒͗̓̿̾̀̽̋͑͜͜͜͜͠͠ͅͅͅͅͅͅͅz̴̡̢̢̨̢̢̢̡̢̨̨̨̢̨̡̛̛͓̘̻̼͕̜͖̺̳̙͇̯̫͔̪̘̗̪͚̝̪͉̙͎̭̝͎̤̖͖̬̞͕̖̥̣̱̱̞̙͕̖̦̞͓͖̙̳͎̖͙͙̯͚̣̰̞̠͔̦̲̰͓̼͖̞͕̹̼̱̞̘͉͖̝͇̯̭̮͉̜̪̮̥͓̻͈̼͖̳̞͍͔̻̗͍̞͎̼̳̜̗̟̦̀̑̈̒̽̈́̒̈́͒̒̽̆̑̋̓̉͗̽̓̈́̇̊̆̒̄͑͂͌̊͌̀̈͐̒̿̊͂̑́̈͊͋̿͊͆̐̀̈́̊̑̑͊̎̾̂́̈̈̓̒̄́̾͋͗̓̅̈̏̄̾̑̑͗̑̈̐̚̚̕͜͠͠͠͝͠͝ͅͅͅȩ̵̛̛̛̛̛̭̟̞̠̬̰͔̤̝͇̬̱̜̖̹̗̯͉͖͖̭̪͎̘͔̹̠̮̲̖͙̝̟̬̓̈̿̑̂̉͒̾̒̃̉͛̍͋̽̇̏͑̉̅͒̒̌͌͛̃́͆̓̀̂̽̓̔̏̾̐̂̌̈́̇͆͌̃̈́͌̉̇́̑͂͊̅̑̊̅͗̀͒̓̍̒̍̿̽͑͒̅͑̀̈́͑̋̔́͂̐̆̄͛̽̉̌̿̉͌̔́͒̒̽̅̈́͊̊̀͐̿͒̾͒̓́͊̀̋̉͒̑͗́́̈̅̉̋́̈̎̈͑̈̾̇͋̀͛̃̃̿̅̋̈́̈́́͐̀̿̍̊̈́̿̍͊̄̍͐̉̃̓͆̋̀̊̓͗̓͐̓̓̇̃̋̏̐̂̊̊̇̄̉͋͐̆̉̈̃̀͒̉̈́̋̂̉̑͒̂̔̋̕̕̚̚͘͘̕̕̕͠͝͠͠͠͠͝͝͝͠͝͝͝͝͝͠͝͝͠͝͠͝ ̵̨̨̧̨̢̧̧̧̡̢̨̡̨̛̛͉͇͇̩̼̪̞͕͕̬̰̻͕̘̤͓͖̻̯͍̼̦̠͕͓̯̤̰̞̮̯̫̫̗̙͈͖̺͈̦͔̳̬̖̥͙̲̰̻̹͎͈͚̥͉̤̭̤̟̹͙̦̟̟͕̻̠͖̮̥͎̪͚̱̹̱̤̙̜͓̳͎̹̰̤͓̹̤̮̦̥̼̺͇͙̫͙͙̗͈̰̺̤̹͈̮͇̤̗̝͍̤̞̩͕͕͒̇̔͐̋̔̌͑̓̓̈́̍̄͋͛̋̃̓̉͊͐̊̊̎̈́̀͐̉̓̾͌́̓͊̈́͐̿͐͛̀̈͒͑̂̃̽͑̊̋̿̈́̓̉̄̋̔̄͊̍̀̒̽̐̾̅̏͂͒̀̎̔͋̆̈̐̿̔̄̒̇͒̾͐̇̅̋̃̎̋̽̋̀̐̉̒̌̑̿͌̓͆̾̊͂̔̈͐̈́̃͒̇͛͐̎͂̅̈̓̍̽̀̅͑̉̐͆̈́̒̎̾͋͊̅͐̀́̽̇́̈́͗́̇̄̒͑̾̽̄̐͂̌̎̈̈́̂̈́͗͊̊͛̀̓̊̎̅̒̍̈̈́̋̽̍̈̿͑̂͊̆͗͑͛̈́̀̊͋͗͛̈́̈́͛̾̀͊́̓̔̍̔̌̈́͂̎̆͂̆̎͛̀͐͆̓̍͆̂̈̾͆̓̔̽̑͆́̔̂̅̈́͋͂͒͌̀̾̄̽͊͒̍͑͂͒́͋͛̂͆̿̚̕̕̚̚͘̚͘̕͘̕͘̕͘̚̕͜͝͠͝͠͝͠͠͝͠͠͠͝͠͝͠͝͠͝͝ͅͅͅͅͅͅͅͅͅͅy̶̡̧̨̨̢̡̨̡̢̡̢̧̡̡̛̛̛̛̛͕̫͙͎̙̻̠̤͇͉̺̰̫̻̰͉̥̣̱̹̗̪͔͖̞̰͚̣͔͎̟̯͚̠͈̞̰͚̬̫͍͙͍͇̙͍̰̜̲͍͓̲̳̟̮̞̘͉̣̞͇̠̦͎͉̭̤̥̼̱̘̺͚̟͖͕̩̭̯͎͙̼̻̖͇̜̗̣̗̫̣̘̻̟̜̮͇͙̹͖̪̲̬̱͇̼͙̲̹̟͉͓̳̘͕̟̦̜̦͚̮͇̦̹̥̭͔͕̗͕̱͉̫͚̻̦̐͗̆͗̓̅͑̀̄̀͑͛͂̾̏͒̔̊͆͋̄͊̅̓̽̃̄͂̓̀͋̎͐̈́͌͌̀͌̌̂́̃̽͋̊͆̂͂̅͌͒̈́͒̈̈́̿̇̒͗͗̇̍̐́̀̋̏̎̓̓͐̂̂̃̉̿͐͊̍͌̍͒͂͊͒̌̋̂̃̓́̅̓̾̿̈̅͑̈́̍͛̾̅̀̌̌́̍̒͛̅͂̆̚͘͘͘͘͘̚͘͘͘͘͘͜͜͝͝͝͝͝͝͝ͅą̶̨̢̢̨̧̨̢̡̨̨̡̢̡̢̨̡̧̧̢̛̛̛̛̛͓̬̦̝̥̦͔̭̝̥͈̙̖̙̳̺͚̯͈̞͔͙̘͙̱̻̱̮̬̝̘͙̝̜̪̺̜̙̬̗̬̝̻̩̥͉̬̮͔̳̣͍̝̼̯̖̠̜͍̜̤̗̮̥̜̦̪̼̻͙̣̬̯͎̝̹͎̝̦̩̼͎͕̞̼͖̖̥͕͙͇̳̱̼̜͓͍͈̜̙̲͔̩̝͓̦̥̣̥̟̦͚͕̖̣̥̩̞̖̤̬͈̭͙̞̳͕̳̟͕͔̼͖̦̞̣̹̳̦͍̗̦̹̦̥͕̦̜̹̯̱̖͚̠̻͇̪̭̘̻̲̞̣̤̞̲̗̻̫͚͍̦̗̦͎̟͍̹̩͚͖̥̜̮̼̟̺̪͎̺̳̩̲͍̬̮̩̥͍̟̐̃̔͊̏̈́͐̌̃̃̎̈́̔̇̀̈́̊̉͊̌̅̿̊̿̄̋̂́̅͛̉̿̎̒̆̍̉͑́̈̈͛͆̓̋̉͋̈́̓͋̿̈́́̊͐̾̽̿̃͛̈́͑̑͋͌̂̑̾̓̈́͌͆̏̐̈́͒̓͗̒̏̾̂̐͛̅͋͗̓̈́͗͂̃̊͐̽̒̓̽̉͊̾͂̈́̍̿̈́̏̾̂̒̇̔̈̈̈͐́̅̈̆͛̃̓̿̆͋́̂̃̓̋̽͗͐͂̈́̑͑͑͑͐̽̿͂̈͑̐̈́͛͒́̓́̓͗̉̀͛͌͆̑̃́̿̊͌̃͆̂̿͛̀͋̐̀́̔̆̏̄͒̎̌̾͆͑̀̈̾̎͂̂̋̆̉̋̐̎̕̚̕̚͘̕̕̕̕̕͘̕̚̚̕͜͜͜͜͜͜͜͝͝͝͝͠͝͠͝͝͠͝͝͠͝ͅͅͅͅk̵̨̢̢̡̡̨̡̢̢̧̨̡̧̡̨̨̛̛̛̛̮̮͓̰̪̰̻͚̬̬̪̲̺̗̩͙̹̞̗͚̥̣̱̥͔̮̤͓̥̤̟̬̠̮̰̜̝̣̹̺̝̭͔̫̟̥̜͍̤̙̥̘͙͓͚͓̣̜̥͙̟͚̞͔̟͉̣̻̙͕̤̘̹̹̯͖͙̥̗̩͓̖̘̳̯͚͍͕̣̳͇̫̤̖͕̺̩̯̳̮̫̬͓̤̮̩͇͚͍̘͎͓̲͚͖̬̬̻͚̺̰̰̠̥̯̙͎͔̮̻͈̮̺̻͎̝͖͕͖͓͓̘̗̞̫̞̯̖͍͇̹͔̐̊̆͊̓̈͐̒̀́̊̌͂̏͂̀̓̀̈͗̏́̌͂̈́̑͛́̇̒͋͛̿̀̅̐̋̐̃͌̓͐̏͑͂͊͐̄̊̈́͗͂̈́̃̈́̏͑̃̊̈͆̀̏̄̌͑̿̉͗͒̌͑́͂̅͌͆̀́́͗͌̐͌̃͊̿̏͌̐̋̀̅̆̏͊̿̈̀̐͌̐̿̀͌̃̓̆̽͑͒̄̽͑̎̚̕̕͘͘̚̚͜͜͜͜͝͠͝͝͝͝ͅͅͅͅl̷̨̨̨̢̨̛̛̛̛̛̰͔̲̺͕͍̱͈͖̜̠͉͓͎̲̳̱̳͕̗̠͎̫̰̳̰̙͈̥͙̞̖̬̺͉͕̟̤̳̣͕͍̝̘̹̮̻͉͙̠̫̭̱̣͓͇̪̯͍͔̳̠͉̞̲̫̩̺͇̺͒̏̓̽̿̌̔̆̉̍̾̅͒̅̎̏̔̑̋̿̐̿̈́̈́̈́̈́̈́̾̀̍͊̓̄̐̓̈͌̎̈́͂̈̔͑̔͆̈́͑̌͌̀̐̆̄̉͒̈́͗̋͐͑̈́̉͌̃̑͌̈́̃̑̋̋̉̾́͂̿̀́̊̄͋͊̈́̂͐̿́̽̍̏̅̇̎̽͌̓̉̉̔͒͑͗͐͆͋͗͌́̐͛͛̈́̕͘͘͘͝͝͝͝͝͠͝͝͝ͅą̴̨̧̧̧̨̨̢̡̡̢̡̧̨̢̨̡̧̨̨̧̢̧̢̡̧̨̛̳̰̤̘͕̗̯̲͚̮͕̞̼̪̘̗͕͔̯͎̙̝̦̱̞̬̞͚̮̦̬̠̦͉̬͉̠̻͈͙͕̳̺̭̲̟̖͍̹̗̟̭̻̮͍͍͍̦͔̥̭̥̰͚̤̺̟̘̦̞̻̯̘͔͎̣͔̙̙̱̫͔̻͙̖̭͚̞͙̱̯͙̱͙͔̥̹͙͕͎̞̰̤̦̘̮̙͉͈͚͍̭̭̰̝̜̥̦̞̬͖̜͇̙̩̘̺̙͚͉̱̳̲̩̹̼͇͇̳̰̲̬̳̹̻̰̬͔̳̦͖̥͚͎̤̤͎̼̯̦̳̯̙̩̲͚̹̳͕̲͔̪̼͙͖̙̰̦̠̻̻̩̩̮͔̦͙̳̩̭̰͎̖̜̘͇̠͈͎͖̖̞͍̫̜̠̥̭̳͓͔͉̲͓̻̳͓̯̲̩̬͎̙͔̮̰̘͎͔̻̭̫͔͍̲̮̬̩͈̣̱͙͍̬̼͔̻̱͓̩̲̩̼͈̱̺͙̪̮̊̊͑̈́͑̔̆̅̓́͊̿̑́̊̊̑̔̀̾͗̑͐͊̉̅͗̄́͊̒͆̽̈́̒̋̋̃́̈̆̏͋͆̓̍̓̂̎̄́͊̌̎͂́͊̾͗͛̊̅̿̔̈́̄̄̀́̋͗͆͑̐̈́̉͆̅̅̒̀͐̈́̓̎̍̓͌̈́̍̎̈́̄̀͊̕̕͘͘͘̕͜͜͜͜͜͜͜͝͠͝͝͝͝͠͝͠͝ͅͅͅͅͅͅͅş̶̨̡̨̧̢̡̡̡̢̢̨̡̢̨̧̨̨̢̡̨̡̢̢̡̛̞͎̩̺̼̜̯̠̲͖̲̟̱̼̤̻̳͚͇͖̯̳͇͓̦̪͈̞͓͉͇̹̲̞̯̘̬͙̩̲̗̞͚͚̙̜̼͉͍̖̗̲̫̟̟̹̰͍͖̤̯͖̬̼͖̞͖̳̹̼̲̲͙̻̱̦͇̺̥̥̤̪̘̜͇̣͓̺͚̫͕̳̦͙͍̲̼͚͍͍̲̯͈̦͖̥͙̘̥͚̦̺̹͇͇̗̟͚̫̞̱͚̱̼̺͎̺̥̗̮̼͎͖̼̬̟̮̬̦̤̱͔̖̜̦͇̮̻̹̣͙̹͍͉̺̖̜̭͍͉͇̪̬͚̗͖̳̼͍͈͔̹͍͔̙̫̲͉͎̬̥͙͕̤͕̤̭̲̼̲͔͎͚͉̠̱̼͚̬͙̘̺͔͍̦̫͕̭̠͚͔̳͉͎̞̤̮̪̣͈͍̩͕̦̭͕̤̭̻̫͖̙̺̘̜̹̘̯͓͍̺͓͎͋̍̂̉̏͛̅̏̅́͗͊̌̈̎̓̈́̇̂͑̒̿̿̒̀̿͑̃̉̉̈́͗̃͂͋̽̄́́̆͆̾̍́̄̾̓̐̔̿̂̏̒͛͆̑̇̓̇̋̇̏̄̆͌̅̔̍̓̉͌͊̏͗͑͗̃̐̒̿̽͗͊͊͛̈͗̀̇̾̀́̑͌͋̓̔͛̒̒̃̌̾͒̌̾͆̈̓̿̾̄̑̿͒͆̕̚̚̕̕͜͜͜͜͜͜͜͝͠͝͝͝͝͠͝ͅͅͅͅͅͅͅͅͅͅͅͅ",color="red",center=(385,50),fontsize=20)
        elif mm1 == 9:
            screen.draw.text("k̴̛̛̛̛̛̛̛̛̛̛̛̛̛̗̭̦͕̇̈́̊̄̾̒̒̈́̄̿̋̂̔̋͐͆̎̄̇̔̐͛̂̃̆̋̀́̓̈̓͂̑̀̅̇͌͋̎̑͑̃́͒͋́͌̍͊́͊̈́̈́̂̊̃́͂̋̒̀̔͒̅͐̇͌͊́̂̅̿̿́̓̈́̓͗̈̋̉͆̔̄͂̓̔̎́̇̎̒̈́̇̆̃͆̽̂̓̏͛̎̆́̃͒͂̽͒̔́̑̽̃̔̄̀̂͒̉̍̃̑́͐͂̐̅̉̎̓̎̇́̄͑̋̆͐͂͋̄̒̐̈́͑̿͂̅̾̂͐͂̔̑͗̒͒̏̊̈͛̿̾̎̇͐̏́̂̈́̑̏̐͛́̾̈́̆̒̇͌̏̈̇̃͛͒͒̾̆̌͒̆͊͒̊̽̈́̏̂͑̃̽̎̒̊̎̄̔̇͆̒̒̌͂̒̂̋̈́͂̈́́̿̇̿͐̓͒͆̔̊̐̾̿̅͛̓̓͆̅̇̂̒͘̕͘͘͘̚͘̕̚̕͘̚̚͘̚̚͝͝͝͠͠͠͝͝͝͠͝͝͠͝͝͝͝͠ơ̷̢̢̡̡̧̡̛̛͈̤̬̥͔̤̞̣̳̳̮̖̞̭͈̩̬̤̤͔̹̳̪̯̺̝͚̣̺̹͎̳͙͔͉͙̳̹͙̝̹͕̮͙̮͎̪͙̭̹̳̟͈̘̩̑̓̏̔͒̒̌̄̀̉̂̌̿̉͌̊̈́̄̋̈́̾͛͌̅̐̿̉͆͐̂̊̆͑̾̓̅̃̍͊̃̉̐̄̎̔̈́̿͂̄̾̈́̾̔̊͂̈́̈́̍̀̂̎̍̒͗̂͆͑̇̒͛̽̌̀̅͆̎̄̽̽͐́̀̏̒̎͂͊̃̐͐̌͂͒̉̆̈́͂̍̉̏̔̑̂̒̂̚̚͘̚̕͜͝͠͝͠͠͝͠͠͝͝͝ͅr̴̛̛͉̭͚̦̥͈͉͉̳̘̳͎̻̥̗̊̂̔́͂̈́̽̃̎͊̽̔̅̀͌͒̏͊̀͒̈́̈́̈͒̈́͋̑̾̂̅̈̽̂̐̌̇̈́̂̅͂͒̋͑̓͛́̑͆̄̌̽͒̿̔̈́́̒̒̽͌̏̿̇̀͐̃͊̒̽̈̃͂̿̈́̒͐̽͗̂̄͛͌̇̓̑̊̇̍̋̓̎̇̽͐̔̂͒̈́̌̐̓̄̑̓͋̽͗̓͋͘̕̚̚̚̚̚͘̕̚̚̕͠͝͝͝͝͝͠͝͠͝͝͝͝͠͝͝ǩ̵̡̧̧̨̧̡̧̢̧̡̡̧̧̨̡̨̧̛̛̝̗̤͓̭͈̗̜͇̗̣̹̟̜͚̗̺̰̖̤̙͎͉̯̭̠̯̜̙͔͙͖̝̤͎̪̠͔̬͍̠͇̞̗̯͎̺͚̭̥͈͔͕̝͎͍̠̻͍̪̭̠̭̝͇̱̤̙̲͈̣̲͉̤̳̳̤̗̳̺̖̭̩̟̲͔̲̗̘͕͈̥̣͙̠͇̹̪͇̦̹̳̪̙͍̜̞̦̖͇̩̗̳̜̩̭̬̺̩̩͈̝̟̗̪̗̥͈̗̹͙̮͕͚̤̺͕̼̰̪̜̹̜͉͖͙̙͚͉͔͖͍̗͚̯̪̭̰̰̫͆̅͂̾̓̇̿̒̇̐̑͑͋̈́̏̍̐̀͋̍̌͋̃́͋̐̎̏̌͌͊̑̉̀́̅̑́̒̈́͋̀̈́̇̽̎̑̔̏͆̂͂́̑͑̃̃̓̌͑̌͆͒͗̅̑̒̀̎̈̄̀͂́̀̇͑̐͂̊̋̇̅͌̀̈́̈̊̎̾̊͋͊̽̆͑̄̀̈̆̆͛̿̏̆͋͐̿͒͆̉̓́̀̆̐̉̉̓̒͒́̃̈́̌̀̈̈͋̇͒̆̎́̊͒͊̊̚͘͘̚̚͘͘̕̕̕̚̚͘͜͜͜͜͜͝͝͝͝͝͠͠͝͝͝͝͝͝͝͝͝͝͝͠͝ͅȕ̵̧̡̡̧̡̢͈̱̮͙̯̦̼͔̪̗̠̟̼͇̟͇͓̙͔͈͈̪̣̯̼̞̭̖̙̘͔̺̟̘̖̥̺̜͕̼͓͖̱͍̰̥̩̰͎̹͉̼̬͓̫̬̭͕͙̱̟̳͖̯̰̠̯͕̘̦̟̫̺̤̱̤̇́̏̽͐̀̒͐͐͆̀͑̒̀̓̒̆̉́́̄͆̽̇̑̀̅͑̈͒̋͑̏̎̃̑̐̈́̈́̅̓͛́͛̋̕̕̚̚̕͜͝͝͝͠͠͠ͅͅy̷̛̛̛̲̩̤̌̽̈́͗͛͆̈́͐͗̅̔́̾͑͑̈́̈̌̇̑̈́̊̐̊͆̉̀̏͋̈́̔̎̌͆͗͐̏̎̈͒̄̈́͛̂͗̊̀̽̇̓̈́̓͂̏̃͋̓̇̏̋͌̆͋̿̋̔͋̍͊̄̌͒̒̎͌͋͊̀́̌͐̍͋̄̊̂͑͂̐̈͛̋̀̚̚̕̚̕̕͝͝͝͝͝ͅǫ̸̨̢̡̧̛̛̛̛̛̛̛̩̘̰̱̗̝͔̬̳͈̱̙̟̠̘̭̱̞̪͔̗͖̫͈̳̠͔͕̖̪͖̺͉̫̬̬̞̟͉͔͓̣̖̤̩̟̳̻͔̗̌̿̌̂̃͌̐̌̓̀͊̿̓͒̎͑̈́̍̈́̈́̿̾̐͂͊̊̈̓̋͑̏̿͑̓̈́̌̔̇̊́̓̔͐̾̓͐̏̈́͒͂͗͂̅̽͒̍͊́̂̓͒̀̉̈́̓́̿̋̒̈́͗̿̄͑́̓̀̓͗̽̍̂̍͒͒̌͐̅̔̽̏͑̾͛̽͊̅̓̔͌͐͛̍͛̿͒̈́̋̈́̔̈́̋̎́̑̽̇̊̓̓̾̃͒͂̀́͋̒̀̈́́̎̍̏͂̾̈́͋̓͒̎̑͌̎̆̍̊̉̇̈̒́́͛͒̎̀̇̓̉̐̓̍̓͒͌̔́̔̆́̅̀̂͂̇̉̋̂̓͆̈́̾̾͐͂̃̋̀̿͛̈́̀̿̽̇̋̓̍̃͒̿͂̆͊̑͘̚͘̕̕̚͘̕̕͘̕̚͘̕̕̕͜͜͝͝͠͝͝͠͝͠͠͝͝͠͝͠͝͠͝ͅr̷̢̨̨̨̢̧̢̡̨̡̨̡̧̡̡̡̧̧̨̨̢̨͕̗̤̞̦̺̻̖̰̼̻̮̖͕̠̻͇̗͖̤̝̼̱̤͎̟͖̭̭͉̺͕͈̟͕̦̥͚͈̩͖̩͔̳̺̩̱͓̗͔͖͍͇̝̣͈̼̜͖̣̻̞̦̭̠͇͖̝̮̟͚͔̙̰̫̣͍͈͍̩͎̦̖̻̼̰̙͍̥̳̳̟̘̫̫̰̙̹͇̲̠̪͕͖͉̩̣̝̘̜͎̯̯̮̘̟̣̱̝͕̩͎̥̠̗͙̮̘̤̺̱͙̯̣̙͓̦̦̜͔̣̗̪̹̜͙͕̬̲̟͚̙͉͍͚̹͉͖͎͔̤̮̥͖̼͔̗̠͚̞̮̬̽̎̉͛̆͐̈́͐͐̑̏̀͋͒̔͆͑̽̔́͋͋͑͘̕̕͜͜͜͜͜͜͠͠ͅͅͅͅͅͅͅͅͅm̸̢̢̨̨̨̧̧̧̨̨̢̢̨̧̧̧̧̡̢̢̡̡̢̨̢̛̛͚̞̬̱͔̪̰͔̤̠̝̤͕͇͇̩͉̬̩͔̬͙̟̞͙̳̖̬͍̬̮̠̭̯̬̘̫̱̙̠̗̘̞̗̲͈͍̦̯͕͉̱̥̬̞͈̦̭̟͔̼̼̣̰̦̖͉̹͍͍̺̹̬̜̠͉̘͈͉͇͈͇̻̳̲̜̲̤̞̠͔̣͎͚̯͙̥̙̰͔̻͔̭̗͙͉̪̥̭̹͎͙̳̬̳͇͉͙͖̥̝̻͈̙͔͍̠̦̘̳̪̲͙͓̦͉̫̥͚̯͇̰̼̥̪͉̫̹͔̣̩̣̬͔̩̙̰͉̪̹̼̩̲͎̝͍̬͖͙̭̜̣̜̺͙̭̤̫̗̖̳̗̺̠͉̳͉̘̱̞͕̣̗̲̞̦̖̟̫̼͎̞̗̟̭̺̣̪̣̼͇̥̞̦̹̲͍̘̯̯̭̪̦̲͇̰̞̭̠͖̜̹̘͈̳͔͙͍͙͍͕̖̝̩̞̖̘͓̲͉͌̇̓̐̽̃̂͐̀̄́͌̈́̈͊̉̏̓́̓̃̒́͋͌̆͊͛̃͋̈́̊̑̈̃̉̒͐̈́̇̍̆̈́͒̾̂̾̿̾̂̃̐̂̏̀̉͊̀̐͛̀̇̐̀̂̿̉̄̈́̈̈́̋͌̀͒̍̎͒̾͆͊̂̀̄̿̒̉̈́͋̀̎̾̈́̿̑̔͘͘̚͘̚̕̕͘͘̕̚͜͜͜͜͜͜͜͜͜͝͠͝͠͝͝͝͝ͅͅͅͅȗ̵̢̡̨̢̧̢̨̢̧̧̡̨̨̡̢̡̡̦̳̤͕̙̰̱̝̝̲̜̞͓͇̗̫̼̥̹̲̝͈̖̮̮͖͎̜̳͖͇̖͇̺͍̖̦̺̻̘̝̩̲̟̗͉̦̮̜̣̖͍̥̣̳̟̫̬̱̼̺̯̤̤̤͉̭͙̱͔̖̗̤̤̻̺̜̥̲͔̥̳̭͙̩̬͇̗̥͈̝̰̩͈̝̳̱̟̺̳̭̠̣͈̙̗͔͎̜̪̣̙͕̗͕̳̘̣̱̣̬̱͓̜̤̥͈͇̻͉͙͓͇̠̮̮̹͉̭̟͇̙̞̩̫̯͉̫̠̪̦̞͖̪̻͇̭͕̩̪̹̯̭̠̮̼̳̖͔̖̠̯̳͎͔̜̟̤̙̺͕͍̗̺̰̺̜̟̮͍̣͔͔̰̟̗̠̩̟͚͙͚̝̼̺̝̜̙̘͕̞̳̝̣̩̠̯͚̮̳̩͚̻̖͇͈̗͎̺̏̓͑͗͌͐̌͊̊̂͊̌̔̿̑̌͐̀̉̽͂̊̉̽̚͜͜͜͜͜͝͝ͅͅͅͅͅͅş̸̡̡̧̢̧̡̢̨̧̨̢̢̨̡̨̡̨̡̧̧̨̛̛̛̛̛̭͙̺̣̥͔̩͕̰͖̝͖̯͕̞̗̲̤̼̗̲̱̟͙̭̬̖͚̜̯̫̣͇̼̖̪̫̻̹͕̹̘͖̦͖̞̠̦͚͚̙̺͈̱̘̙̟̰̱̬̜̮̣̘̰̯͙͉̯͈̗̦͙̱̳̱̘̦͚͎͔̯͖̞̙̺͔̖̣̣͎̦͉̻͕̤̠̤̘̻͚̪̣̥̮̻̭̖͔̦̦̙̗͈̜̟͇̳̫̬̝̰̩̦̙̟͚͇̥̩͕͓̭̼̙̭͍̣̯͎̭̫̮̣͓̤̮͔̣̠̣̮̫̦̹̘̗̗̪̮̖̜̰̱̙̥̰̘͚͙̱̘̙̙̮̟̘͙͙͔̬̙͔͓̼͖̳̫̖̲̼͈̩̹̖̯̘̞̦͙̼̣̠̫̫͉̥͍͖̬̮̺̦̤̙̱͙̹̤̞͈̭̲̭̝̭̪͓̻̣͇̯̆̊͋̋͌͋̀̂̇̉̅̂̂̃̓̌́͒̽̉̀̃͂́̒̑̀̂̀͂͂̄̒̀͐̋̔͑̃̈́̓̂̔̑̇̓̏̓͂͛̂̎́̈̅̋̀̄́̌͆̈̔́͂̃̎̂̈́͒̉̈́̿̅̄̽̈́̈̀̓̈́̏̓́̋͛̉̆͌̿̊̓͂̈́̋̏̾̀͋͗̌͐̊̍̿̈̈́̅̎́͛̌̆̑̽̈́͋̌̽̐͌̅̈̈́̉͗̌̒̈̉̈́̑͋͆͆́͂̂̑̆̍͛̊̈́̈́͘̚͘͘̚̚̕̕̚͘͘̚̚͜͜͜͜͜͜͝͠͝͝͝͝͝͝͠͝͠͠͝͝͝͝͝ͅͅͅͅͅͅͅͅư̴̛̛̛̛̛̺̮̦̲̝̳̗̪͋̊̇͊̿́̈͐̏́̍̀̇͒̉͊̀́́̅̔̉͛͛͋̆̎̂͑̾́̒̀̓̋̓̑̏̍̓̈́̀͋́͆͊̐̐̽͋̄̆̃̆͊̈́̃͗̀͊̌̊̑͌̈͛̽́̍̆̐͋̎͊̈́̏̓͐́̒͌̈́͆́̉͂̎̄̿̈́͊̓̒̅̉̐̆̋́̄̓̄͂̀̽̋̾̌̃̍̀̄͆͒̉̿̽̈́̾͗̉̒̉͒̆̀̽͑͒͆̄̓͐͊͆̒̿̓͛́́̒͗̀̅̃̊̉͛͗̏͊͆͒́̓̓̃͋̓͒́̈͛́̐͂̔̈́̉̊̀̊̾̈̈́̓̃̓̂̿̌͌͊̒̉͊̾͛̋̈́̌͛͌͌͒͗̐͛̉͂͐͒̔͋͊̋͑͋̄̏̑̾͂̐̏͛͆̓̃͒͆̌͐̈̅̿̈́̆̌͊̐̈́̅͌̚̕̚͘̕͘̚͘̕̕͘̚̕̕̚͜͝͝͝͠͝͠͠͠͠͝͠͝͝͠͠͝͝͝͝͠͝͝ǹ̸̢̛̥͔͉͓͚͕̜̟̯̻̩̠̞̙͉̣̮͖͇̱̰͎̦̪̘̬̳͉̬͎͎̰̬̻̤̥̼̮̤̭̯̦͔̦̦̙͆̄̒̅͊̈̎̋̈̂͒͂̆͛̌̍̔̋̒́͛̕̚͘̕͘͜͝͠͠͝ͅ?̴̢̨̢̢̢̢̧̢̧̢̢̨̡̢̡̡̧̧̡̧̢̧̢̛̛̛̛̛̖̤̫̹̦̜͈̣̖̠̩͓̤̲̙̞̬̲̱͇̯̜̫͍͇̯͎̘͍̲̫̠̜͎̩̫̥̱̪͓̞̳̜͓̰̜̤͓͙̠̹̟̘̲̹̜̭̣̤̜͎̲̪̥̟͓̰̗͍͔͕̬̮͈̖͎͖̯̱̪̞͎̜͍̼͍̪̩̦͓̪̝̖̟̮̻̠͕̟̪̯̩̼͉͓̣̯̩̞̙̬̲̦̱̹̪̜̥̯̳͓̪̱̜̼̭̺̮̬̬͖̜̮̦̤̩͈̰̤̩̗̟̥̜̺̞̘̹̹͖͙͈͚͕͉̥̻̠̖͉̝͎̤̺̼̤̭͉͎̫̜̺̗̖̜̖̜̜̱̝̙̼͓̲̻̟̲̱͈̣͉̪̣̠͍̰̠̬̖̪̞͍̤̝͓͕͚̙͍̲̬̹̠̹̼̥̬̙̘̭͔̖̭̺̤̙͈̰̳̰͕̠̙̯͓̪͇̖͕̣̺̯̜͕̥͑̋̌̽̾̈́̀̿́͂̐͋̈́̋͑̈́̃̍͌̆̃̐͋͐̋̈̾͋͋̄͛̋͂̈́̀̀̒̂̌̈́̐̈́͌̋͒̇̒̈̃̉̐͋͋̓̌͌̊̀̂́͆͆̿̋͂̌͗̒̎͂̂̀̐͑̓̈̎̉̇̔̃̀̃̋͗̑͐́́̄́̂̃͋̓̀͗̿͂̎̅̋̒͆̓͆̐̽̿̿̊͆͛͗͑̊͆̆̌̿͂́̄̈́̀͐͐̏̄̈́́̂̒̀̌̊̓͂͂̏̎̃͂̌͂̍̎̎̾̾̃̂̈̽̅̓͑̇͗̉̈́͐̄̑̀͑̀̾̅̓̌̓̋͒́̓̏͒͛̌̏̆̓̈́͐̓̎͌͑̇̾̈́͑̂̀̇̓̀͂̓̿͐̾̈̅̉̓̑̀̌̂̀̔̈̍̀̋́̐̈͘̚̕̕̚̕̚͘̚̚̚͘̕͜͜͝͝͝͝͝͠͝͠͝͠͝͠͝͝͝͝͝͝͝͝͝͝͠͠͝͝͠͠͠͝ͅͅ",color=	(216,191,216),center=(75,55),fontsize=20)
    elif oda == "level1win":
        mab999cizim()
        yasadin.draw()
        screen.draw.text("Hepsini hakladın!",color="white",center=(240,265),fontsize=20)
        screen.draw.text("Devam etmek için ENTER'a bas",color="red",center=(400,470),fontsize=15)
    elif oda == "geçişdönemi3":
        mab999cizim()
        screen.draw.text("Devam etmek için ENTER'a bas",color="red",center=(400,470),fontsize=15)
    elif oda == "koridor2":
        mab4cizim()
        dex2.draw()


    



#9 - update(dt):
def update(dt):
    global oda
    global dex3i
    if oda == "başlangıç":
        if dex.colliderect(yatak):
            oda = "geçişdönemi1"
    elif oda == "1.kısım":
        if dex1.colliderect(gecis):
            oda = "gecisdönemi2"
    elif oda == "koridor1":
        if dex2.y >= 230:
            oda = "level1"
        elif dex2.colliderect(gecis):
            oda = "geçişdönemi3"
    elif oda == "level1":
        if not düşman1Liste:
               oda = "level1win"
        if dex3i["hp"] <= 0:
            lose1 = random.randint(1,100)
            if 1<=lose1<=24:
                oda = "level1lose1"
            elif 25<=lose1<=49:
                oda = "level1lose2"
            elif 50<=lose1<=74:
                oda = "level1lose3"
            elif 75<=lose1<=99:
                oda = "level1lose4"
            elif lose1 == 100:
                oda = "level1lose:("

    
            
    no2()
    a()
def carpisma():
    for i in range(len(düşman1Liste)):
        if dex3.colliderect(düşman1Liste[i]):
            düşman1Liste.pop(i)
            break
#10 - Klavye:
def on_key_down(key):
    global oda
    global dusman1
    
    eskix = dex3.x
    eskiy = dex3.y
    
    if oda == "başlangıç":
        if key == keys.W and 320<dex.y and dex.y < 460 and dex.x > 60:
            dex.y -= 5
        elif key == keys.W and 64<dex.y and dex.y < 320:
            dex.y -= 5
        elif key == keys.D and 64<dex.x and dex.x < 425 and  dex.y > 320:
            dex.x += 5
        elif key == keys.D and 64<dex.x and dex.x < 270:
            dex.x += 5
        elif key == keys.A and 70<dex.x and dex.x<440:
            dex.x -= 5
        elif key == keys.S and dex.y<455:
            dex.y += 5
    elif oda == "1.kısım":
        if key == keys.W and dex1.x > 268 and dex1.y > 320:
            dex1.y -= 7
        elif key == keys.W and dex1.x < 268 and dex1.y > 55:
            dex1.y -= 7
        elif key == keys.D and 64<dex1.x and dex1.x < 425 and  dex1.y > 320:
            dex1.x += 7
        elif key == keys.D and 64<dex1.x and dex1.x < 263:
            dex1.x += 7
        elif key == keys.A and 70<dex1.x and dex1.x<440:
            dex1.x -= 7
        elif key == keys.S and dex1.y<455:
            dex1.y += 7
    elif oda == "geçişdönemi1":
        if key == keys.RETURN:
            oda = "1.kısım"
    elif oda == "gecisdönemi2":
        if key == keys.RETURN:
            oda = "koridor1"
    elif oda == "geçişdönemi3":
        if key == keys.RETURN:
            oda = "koridor2"
            dex2.x = 240
            dex2.y = 20
    elif oda == "koridor1":
        if key == keys.W and dex2.y > 20:
            dex2.y -= 8
        elif key == keys.S and dex2.y < 471:
            dex2.y += 8
        elif key == keys.D and dex2.x < 425:
            dex2.x += 8
        elif key == keys.A and dex2.x > 9:
            dex2.x -= 8
    elif oda == "koridor2":
        if key == keys.W and dex2.y > 20:
            dex2.y -= 8
        elif key == keys.S and dex2.y < 471:
            dex2.y += 8
        elif key == keys.D and dex2.x < 425:
            dex2.x += 8
        elif key == keys.A and dex2.x > 9:
            dex2.x -= 8
    elif oda == "level1":
        if key == keys.W and 300>dex3.y>175:
            dex3.y -= 3
        elif key == keys.S and 296>dex3.y>171:
            dex3.y += 3
        elif key == keys.D and 300>dex3.x>175:
            dex3.x += 3
        elif key == keys.A and 301>dex3.x>180:
            dex3.x -= 3
        düşman1Car = dex3.collidelist(düşman1Liste)
        if düşman1Car != -1:
            dusman1 = düşman1Liste[düşman1Car]
            dusman1.hp -= dex3i["hit"]
            dex3i["hp"] -= dusman1.hit
            if dusman1.hp <= 0:
                carpisma()
                dex3.x = eskix
                dex3.y = eskiy
                dex3i["xp"] += random.randint(23,35)
    elif oda == "level1win":
        if key == keys.RETURN:
            oda = "koridor1"
            dex2.x = 240
            dex2.y = 260
    elif oda == "level1lose1":
        if key == keys.RETURN:
            oda = "koridor1"
            dex3i["hp"] += 10

    elif oda == "level1lose2":
        if key == keys.RETURN:
            oda = "koridor1"
            dex3i["hp"] += 10

    elif oda == "level1lose3":
        if key == keys.RETURN:
            oda = "koridor1"
            dex3i["hp"] += 10

    elif oda == "level1lose4":
        if key == keys.RETURN:
            oda = "koridor1"
            dex3i["hp"] += 10

    elif oda == "level1lose:(":
        if key == keys.RETURN:
            dex3i["hp"] += 10
            oda = "koridor1"

                
                
    elif oda == "geçişdönemi2":
        if key == keys.RETURN:
            oda = "koridor1"
#11 - Mouse:
def on_mouse_down(button,pos):
    global oda
    if pygame.mouse.get_pressed()[0] and oda == "menü":
        if b01.collidepoint(pos):
            oda = "başlangıç"
        elif b02.collidepoint(pos):
            oda = "credit"
    elif pygame.mouse.get_pressed()[0] and oda == "credit":
        if exit.collidepoint(pos):
            oda = "menü"
    elif pygame.mouse.get_pressed()[0] and oda == "hikaye":
        if exit.collidepoint(pos):
            oda = "menü"
#12 - on_mouse_move:
def on_mouse_move(pos):
    tkalp.pos = pos
pgzrun.go()